{
  "name": "Morrind",
  "nation": "Morrindim",
  "population": 100000,
  "metro": 150000,
  "majority": "Morrind Dwarves",
  "ruling": "Morrind Dwarves",
  "minorities": [],
  "exports": [],
  "landmarks": [
    {
      "name": "The Council of Captains",
      "description": "The Council of Captains is the central hub of government for Morrindim, with every captain in the fleet having a vote.  The number of members present shifts depending on the season and the importance of issues at hand from a few hundred to several thousand.  The Council hall itself seats 10,000."
    },
    {
      "name": "The Mage's Guild",
      "description": "If there is one thing that is as predictable as dwarves digging holes, it's mage's building towers, and the Morrind mages are no different. The Mage's Guild of Morrind is the one highly distinguishable structure from the outside of the city, sticking up several hundred feet from the squat expanse of the cities stone roof.  It is also one of the only buildings with windows, a very unusual architectural feature for dwarves."
    },
    {
      "name": "Trimala's Harbor",
      "description": "Trimala, God of the sea and storms, is one of the patron Gods of the Morrind.  Trimala's Harbor, meanwhile, is the largest enclosed harbor in the world, able to bring nearly two-hundred ships to dock at one time, 15 functioning drydocks, and a massive shipyard complex.  Life in the city revolves around the harbor and its adjoining markets and warehouses, and it is estimated that more money changes hands here on a daily basis than in all of Kandor."
    }
  ],
  "coords": [-52, -16],
  "description": "Morrind is the populous capitol and trade hub of the Morrind dwarves.  The city itself is built as a single massive stone structure, an attempt by the early Morrind to mimic the traditional dwarven hold, on an island made of pourous volcanic rock and silt.  The island is dominated by the city, but the morrind also have villages and towns that dot the surrounding archipelago and provide much needed raw materials and trade goods."
}