{
  "name": "Parakas",
  "nation": "Malinval",
  "population": 315000,
  "metro": 330000,
  "majority": "Grunt Orcs",
  "ruling": "High Orcs",
  "minorities": [
    "High Orcs",
    "Kobolds",
    "Goblins"
  ],
  "exports": [
    "Parakas Steel",
    "Metal Goods"
  ],
  "landmarks": [
    {
      "name": "Ironbreaker Wall",
      "description": "The winds crossing the Rust Desert pose a significant hazard to anyone who would live near it.  High winds pick up the tiny slivers of rusted iron and send them hurtling at high speeds across the flat landscape, someone caught in such a storm without cover rarely live.  The orcs of Parakas have built a powerful defense however.  The massive ironbreaker wall, 200 ft high, 15 ft thick of concrete and steel 5 miles long. It acts as a massive windbreak on the western edge of the city, protecting its residents from the worst of the brutal rust storms."
    }
  ],
  "coords": [18, 105],
  "description": "Parakas, the City of Steel, is an imposing sight on approach. The walls are 60 foot tall structures of burnished red steel, and the buildings of the city are all made of the same material.  On the west side of the city, facing the rust desert, the walls reach up to 200 feet tall, designed to protect the city from the 'rust storms' that blow in from the rust desert. The protection of the walls is not perfect, and the windows of the city are all fitted with steel window shades that can be closed to protect the residents, and no one puts a window on the western side of a house.\n\n Despite this very real threat, the wealth brought by the rust desert is enough to make this city one of the most prosperous in the world. The steel made from the iron of the rust desert is not only the best in the world, but has a distinctive red color that makes it hard to sell a counterfeit. The warlord of Parakas has a unique status among the orc warlords, in that none care to threaten his position, so long as he agrees to sell steel to all parties, an arangement that likely has as much to do with the cities formidable defenses and near impossibility to siege. The last army to attempt it, in YFC 1808, was shredded by a large rust storm that killed more than a third of the besieging army in less than an hour, on the second day of the siege.\n\n The city itself is ruled as a paternalist communistic society, with the power of the local warlord nearly absolute."
}