{
  "name": "Cleric",
  "level": 0,
  "hitdie": 8,
  "proficiencies": {
    "armor": ["light armor", "medium armor", "shields"],
    "weapons": ["simple weapons"],
    "tools": [],
    "saving throws": ["wis", "cha"],
    "numskills": 2,
    "skills": ["history", "insight", "medicine", "persuasion", "religion"]
  },
  "features": [
    {
      "level": 1,
      "name": "Spellcasting",
      "description": "As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the cleric spell list.\n\n#### Cantrips\n\nAt 1st level, you know three cantrips o f your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.\n\n#### Preparing and Casting Spells\n\nThe Cleric table shows how many spell slots you have to cast your spells o f 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list o f cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list o f prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list o f cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.\n\n#### Ritual Casting\n\nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\n#### Spellcasting Focus\n\nYou can use a holy symbol (found in chapter 5) as a spellcasting focus for your cleric spells."
    },
    {
      "level": 1,
      "name": "Divine Domain",
      "description": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.\n\n#### Domain Spells\n\nEach domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day.\n\nIf you have a domain spell that doesn’t appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
    },
    {
      "level": 2,
      "name": "Channel Divinity",
      "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.\n\n#### Channel Divinity: Turn Undead\n\nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    }, 
    {
      "level": 5,
      "name": "Destroy Undead",
      "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table."
    },
    {
      "level": 10,
      "name": "Divine Intervention",
      "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature o f the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required."
    }
  ],
  "subclass": [
    {
      "name": "Air Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Air Domain Spells",
          "description": "1st - feather fall, thunderwave. 3rd - gust of wind, dust devil. 5th - wind wall, lightning bolt. 7th - conjure minor elementals (air only), storm sphere. 9th - control winds, conjure elemental (air only)."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with martial weapons."
        },
        {
          "level": 1,
          "name": "Disciple of Air",
          "description": "Also starting at 1st level, your lightning spells are more effective, you add your wisdom modifier to the damage of any spell you cast that does lightning damage."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Gale",
          "description": "Starting at 2nd level, you can use your Channel Divinity to create a gale of wind like a tornado\n\nAs an action, you present your holy symbol and gale force winds permeate the area. The area within 60 ft of you becomes filled with strong winds. You and a number of creatures equal to your wisdom modifier that you select ignore these winds, meanwhile for any other creature moving 1 ft requires 2 ft of movement as they battle through the strong winds. Additionally, when the winds start each creature effected must make a strength saving throw or be knocked prone."
        },
        {
          "level": 6,
          "name": "Burst of Wind",
          "description": "At 6th level your God grants you the ability to manipulate winds around you. As an action you can use the force of the wind to knock over creatures and move objects. To do so, select a 10 ft cube within 60 ft of you. Any creatures in that area must make a strength saving throw or be pushed 10 ft in a direction of your choice or fall prone, they choose which effect they are subjected to. If they succeed they are not affected. Objects in the area that are not secured are automatically pushed 10 ft away."
        },
        {
          "level": 8,
          "name": "Lightning Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with lightning energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 lightning damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Living Air",
          "description": "At 17th level you gain the ability to summon a air elemental once per day. The air elemental serves you and only you faithfully, obeying your verbal commands. It stays with you until it is killed, but you can only have one elemental companion such as this at a time. Summoning the elemental requires 1 minute of intense concentration and meditation, during which you cannot move more than 5 feet from the location you started the summoning, and must use your action on every turn to continue the summoning ritual."
        }
      ]
    },
    {
      "name": "Arcana Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Arcana Domain Spells",
          "description": "1st - detect magic, magic missile.  3rd - magic weapon, Nystul's magic aura.  5th - dispel magic, magic circle. 7th - arcane eye, leomund's secret chest. 9th - planar binding, teleportation circle."
        },
        {
          "level": 1,
          "name": "Arcane Initiate",
          "description": "When you choose this domain at 1st level, you gain proficiency in the Arcana skill, and you gain two cantrips of your choice from the wizard spell list. For you, these cantrips count as cleric cantrips."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Arcane Abjuration",
          "description": "Starting at 2nd level, you can use your Channel Divinity to abjure otherworldly creatures.\n\nAs an action, you present your holy symbol, and one celestial, elemental, fey, or fiend of your choice that is within 30 feet of you must make a Wisdom saving throw, provided that the creature can see or hear you. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly end its move in a space within 30 feet of you. It also can't take reactions. For its action, it can only use the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\n\nAfter you reach 5th level, when a creature fails its saving throw against your Arcane Abjuration feature, the creature is banished for 1 minute (as in the banishment spell, no concentration required) if it isn't on its plane of origin and its challenge rating is at or below a certain threshold, as shown on the Arcane Banishment table."
        },
        {
          "level": 6,
          "name": "Spell Breaker",
          "description": "Starting at 6th level, when you restore hit points to an ally with a spell of 1st level or higher, you can also end one spell of your choice on that creature. The level of the spell you end must be equal to or lower than the level of the spell slot you use to cast the healing spell."
        },
        {
          "level": 8,
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "level": 17,
          "name": "Arcane Mastery",
          "description": "At 17th level, you choose four spells from the wizard spell list, one from each of the following levels: 6th, 7th, 8th, and 9th. You add them to your list of domain spells. Like your other domain spells, they are always prepared and count as cleric spells for you."
        }
      ]
    },
    {
      "name": "Craft Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Craft Domain Spells",
          "description": "1st - Identify, Unseen Servant. 3rd - Heat Metal, Locate Object. 5th - Nondetection, Protection from the Elements. 7th - Leomund's Secret Chest, Stoneshape. 9th - Animate Objects, Creation."
        },
        {
          "level": 1,
          "name": "Bonus Cantrips",
          "description": "You learn the mending cantrip in addition to your normal known cantrips."
        },
        {
          "level": 1,
          "name": "Bonus Proficiencies",
          "description": "You gain proficiency in 1 set of artisan's tools of your choice. You also gain proficiency in martial weapons and heavy armor."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Hammer Throw",
          "description": "Starting at second level as a bonus action you can use your channel divinity ability to give yourself the ability to use nearly any hammer as a ranged weapon. For one minute Mauls & Warhammers can be used as a range weapon. Their range is 20/60. Light Hammers can be thrown for twice the distance listed in the PHB."
        },
        {
          "level": 6,
          "name": "Summon Weapon or Tools",
          "description": "Summon Weapon or Tools. As an action you can summon a Light Hammer, or Maul, or Warhammer, or a set of Artisan's Tools from the plane of your deity. You can do this a number of times per day equal to your Wisdom modifier or at least once per day. This is a finely crafted “masterwork” item that will last until you stop using it and then it will fade and return to its plane of origin."
        },
        {
          "level": 8,
          "name": "Soulforged Item",
          "description": "Starting at 8th level You can put a bit of yourself into an item that you craft to give it certain powers that you and only you can benefit from. Normally this is done by mixing a bit of your blood in the process of making the item thereby making it forever yours. The normal rules apply for crafting an item during downtime. When you craft a set of Artisan's Tools you gain advantage on all rolls with them. If you craft armor or a weapon they have a +1 bonus and are considered magic weapons whenever you use them. At 14th level armor and weapons you craft have a +2 bonus for you."
        },
        {
          "level": 17,
          "name": "Obey Thy Master",
          "description": "You are immune to cursed aspects of an item and you can gain whatever normal or magical beneficial ability that they posses without any risk of harm or injury. The item still possesses its curse but it will never affect you. Any intelligent items also pose no threat to use them as you bend them to your indomitable will."
        }
      ]
    },
    {
      "name": "Death Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Death Domain Spells",
          "description": "1st - false life, ray of sickness.  3rd - blindness/deafness, ray of enfeeblement. 5th - animate dead, vampiric touch. 7th - blight, death ward. 9th - antilife shell, cloudkill."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "When the cleric chooses this domain at 1st level, he or she gains proficiency with martial weapons."
        },
        {
          "level": 1,
          "name": "Reaper",
          "description": "At 1st level, the cleric learns one necromancy cantrip of his or her choice from any spell list. When the cleric casts a necromancy cantrip that normally targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Touch of Death",
          "description": "Starting at 2nd level, the cleric can use Channel Divinity to destroy another creature's life force by touch.\n\nWhen the cleric hits a creature with a melee attack, the cleric can use Channel Divinity to deal extra necrotic damage to the target. The damage equals 5 + twice his or her cleric level."
        },
        {
          "level": 6,
          "name": "Inescapable Destruction",
          "description": "Starting at 6th level, the cleric's ability to channel negative energy becomes more potent. Necrotic damage dealt by the character's cleric spells and Channel Divinity options ignores resistance to necrotic damage."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, the cleric gains the ability to infuse his or her weapon strikes with necrotic energy. Once on each of the cleric's turns when he or she hits a creature with a weapon attack, the cleric can cause the attack to deal an extra 1d8 necrotic damage to the target. When the cleric reaches 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Improved Reaper",
          "description": "Starting at 17th level, when the cleric casts a necromancy spell of 1st through 5th level that targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other. If the spell consumes its material components, the cleric must provide them for each target."
        }
      ]
    },
    {
      "name": "Earth Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Earth Domain Spells",
          "description": "1st - earth tremor, absorb elements. 3rd - shatter, dust devil. 5th - Erupting Earth, Meld into Stone. 7th - Conjure minor elementals (earth only). Stone Shape. 9th - Wall of stone, conjure elemental (earth only)."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor."
        },
        {
          "level": 1,
          "name": "Bonus Cantrips",
          "description": "You learn the magic stone and mold earth cantrips."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Armor of Stone",
          "description": "Starting at 2nd level, you can use your Channel Divinity to strengthen your armor with the strength of the earth itself.\n\nAs an action, you present your holy symbol and perform an incantation. Pick a number of willing creatures equal to your wisdom modifier within 30 ft of you. Each of those creatures has their armor class increased by 2 for 1 minute."
        },
        {
          "level": 6,
          "name": "Move in the Earth",
          "description": "Also Starting at 6th level, you gain a burrow speed equal to your movement speed. When you burrow you leave no trail behind you, as your body melds itself into the earth itself."
        },
        {
          "level": 8,
          "name": "Earth Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with additional force. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 magic bludgeoning damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Living Earth",
          "description": "At 17th level you gain the ability to summon an earth elemental once per day. The earth elemental serves you and only you faithfully, obeying your verbal commands. It stays with you until it is killed, but you can only have one elemental companion such as this at a time. Summoning the elemental requires 1 minute of intense concentration and meditation, during which you cannot move more than 5 feet from the location you started the summoning, and must use your action on every turn to continue the summoning ritual."
        }
      ]
    },
    {
      "name": "Fire Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Fire Domain Spells",
          "description": "1st - fairie fire, burning hands. 3rd - heat metal, flame blade. 5th - fireball, elemental weapon (fire only). 7th - conjure minor elementals (fire only), wall of fire. 9th - flame strike, conjure elemental (fire only)."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with martial weapons."
        },
        {
          "level": 1,
          "name": "Disciple of Fire",
          "description": "Also starting at 1st level, your fire spells are more effective, you add your wisdom modifier to the damage of any spell you cast that does fire damage."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Fire Burst",
          "description": "Starting at 2nd level, you can use your Channel Divinity to create divine flames.\n\nAs an action, you present your holy symbol and nearby enemies burst into flame. Pick a number of opponents equal to your wisdom modifier within 30 feet of you. Each of those creatures must make a constitution saving throw or catch fire. The fire does 3d6 fire damage every round at the start of that creatures turn until someone uses an action to extinguish the flames."
        },
        {
          "level": 6,
          "name": "Manipulate Flames",
          "description": "At 6th level your God grants you the ability to manipulate flames. On your turn, you can manipulate any non-magical flame within 60 feet of you. As an action you can extinguish any fire smaller than a 5 foot cube, or turn a small fire (such as a torch) into a conflagration in a neighboring square. Any creature caught in the conflagration must make a dexterity save, taking 2d6 fire damage on a failed save, or half as much on a successful one. The conflagration lasts for only 1 round unless their is fuel available in the square, in which case it lasts until the fuel is consumed."
        },
        {
          "level": 8,
          "name": "Flame Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with fire energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Living Fire",
          "description": "At 17th level you gain the ability to summon a fire elemental once per day. The fire elemental serves you and only you faithfully, obeying your verbal commands. It stays with you until it is killed, but you can only have one elemental companion such as this at a time. Summoning the elemental requires 1 minute of intense concentration and meditation, during which you cannot move more than 5 feet from the location you started the summoning, and must use your action on every turn to continue the summoning ritual."
        }
      ]
    },
    {
      "name": "Knowledge Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Knowledge Domain Spells",
          "description": "1st - command, identify. 3rd - augury, suggestion. 5th - nondetection, speak with dead. 7th - arcane eye, confusion. 9th - legend lore, scrying."
        },
        {
          "level": 1,
          "name": "Blessings of Knowledge",
          "description": "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion.\n\nYour proficiency bonus is doubled for any ability check you make that uses either of those skills."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Knowledge of the Ages",
          "description": "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool."
        },
        {
          "level": 6,
          "name": "Channel Divinity: Read Thoughts",
          "description": "At 6th level, you can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it.\n\nAs an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can't use this feature on it again until you finish a long rest.\n\nIf the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute.\n\nDuring that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell."
        },
        {
          "level": 8,
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "level": 17,
          "name": "Visions of the Past",
          "description": "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n\n**Object Reading.** Holding an object as you meditate, you can see visions of the object's previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as w ell as the most recent significant event involving the object and that owner. If the object w as owned by another creature in the recent past (within a number of days equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature.\n\n**Area Reading.** As you meditate, you see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However, they might also include more mundane events that are nevertheless important in your current situation."
        }
      ]
    },
    {
      "name": "Life Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Life Domain Spells",
          "description": "1st - bless, cure wounds. 3rd - lesser restoration, spiritual weapon. 5th - beacon of hope, revivify. 7th - death ward, guardian of faith. 9th - mass cure wounds, raise dead."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor."
        },
        {
          "level": 1,
          "name": "Disciple of Life",
          "description": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Preserve Life",
          "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.\n\nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct."
        },
        {
          "level": 6,
          "name": "Blessed Healer",
          "description": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Supreme Healing",
          "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
        }
      ]
    },
    {
      "name": "Light Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Light Domain Spells",
          "description": "1st - Burning Hands, Faerie Fire. 3rd - Flaming Sphere, scorching ray. 5th - daylight, fireball. 7th - guardian of faith, wall of fire. 9th - flame strike, scrying."
        },
        {
          "level": 1,
          "name": "Bonus Cantrip",
          "description": "When you choose this domain at 1st level, you gain the light cantrip if you don't already know it."
        },
        {
          "level": 1,
          "name": "Warding Flare",
          "description": "Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Radiance of the Dawn",
          "description": "Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes.\n\nAs an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you is not affected."
        },
        {
          "level": 6,
          "name": "Improved Flare",
          "description": "Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you."
        },
        {
          "level": 8,
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "level": 17,
          "name": "Corona of Light",
          "description": "Starting at 17th level, you can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage."
        }
      ]
    },
    {
      "name": "Nature Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Nature Domain Spells",
          "description": "1st - Animal friendship, speak with animals. 3rd - barkskin, spike growth. 5th - plant growth, wind wall. 7th - dominate beast, grasping vine. 9th - insect plague, tree stride"
        },
        {
          "level": 1,
          "name": "Acolyte of Nature",
          "description": "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "Also at 1st level, you gain proficiency with heavy armor."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Charm Animals and Plants",
          "description": "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants.\n\nAs an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other creatures you designate."
        },
        {
          "level": 6,
          "name": "Dampen Elements",
          "description": "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Master of Nature",
          "description": "At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn."
        }
      ]
    },
    {
      "name": "Tempest Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Tempest Domain Spells",
          "description": "1st - fog cloud, thunderwave. 3rd - gust of wind, shatter. 5th - call lightning, sleet storm. 7th - control water, ice storm. 9th - destructive wave, insect plague."
        },
        {
          "level": 1,
          "name": "Bonus Proficiencies",
          "description": "At 1st level, you gain proficiency with martial weapons and heavy armor."
        },
        {
          "level": 1,
          "name": "Wrath of the Storm",
          "description": "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Destructive Wrath",
          "description": "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity.\n\nWhen you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling."
        },
        {
          "level": 6,
          "name": "Thunderbolt Strike",
          "description": "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Storm born",
          "description": "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors."
        }
      ]
    },
    {
      "name": "Trade Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Trade Domain Spells",
          "description": "1st - Comprehend Languages, Charm Person. 3rd - Zone of Truth, Calm Emotions. 5th - Tongues, Sending. 7th - Freedom of Movement, Dimension Door. 9th - Teleportation Circle, Rary's Telepathic Bond."
        },
        {
          "level": 1,
          "name": "Bonus Proficiency",
          "description": "Starting when you take this domain at 1st level you gain proficiency with one type of Artisan's tools of your choice, the persuasion skill, and in 2 additional languages"
        },
        {
          "level": 2,
          "name": "Channel Divinity: Appraisal",
          "description": "Starting at 2nd level, whenever you touch an object you can use an action and a use of your channel divinity feature to learn what it is and its monetary value, if any. You learn about the object as if you had cast the 'identify' spell on it. Additionally you get an idea of what it's approximate monetary value is on the open market (although individual buyers may offer different amounts)."
        },
        {
          "level": 6,
          "name": "Fast Travel",
          "description": "Starting at 6th level your movement speed increases by 10 ft. Additionally once per day you can use your action to increase the movement speed of any friendly creature within 30 ft of you by 10 ft for 1 hour."
        },
        {
          "level": 8,
          "name": "Dimensional Pocket",
          "description": "Starting at 8th level you can access a dimensional pocket where you can store your acquisitions and wealth. It takes a 1 minute ritual to access the dimensional pocket, after which you can add or remove any non-living object that you can hold in your hands and which is smaller than 10 ft in all dimensions. No other creature can access your pocket plane, however, if you die all of it's contents appear near your corpse."
        },
        {
          "level": 14,
          "name": "World Wanderer",
          "description": "Starting at 14th level, you add the spells Teleport and Mordenkainen's Magnificent Mansion to your list of domain spells, also you can ignore the material component cost of Teleportation Circle."
        },
        {
          "level": 17,
          "name": "Channel Divinity: Money is no Object",
          "description": "Starting at 17th level you can use your channel divinity feature to turn other metals into gold. Choose one object made of metal of less than 50 lbs and less than 5 ft in any dimension. As an action you can turn that object into pure gold. If that object is an armor or weapon, it's damage or AC are reduced by 2."
        }
      ]
    },
    {
      "name": "Trickery Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "Trickery Domain Spells",
          "description": "1st - charm person, disguise self.  3rd - mirror image, pass without trace. 5th - blink, dispel magic. 7th - dimension door, polymorph. 9th - dominate person, modify memory."
        },
        {
          "level": 1,
          "name": "Blessing of the Trickster",
          "description": "Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Invoke Duplicity",
          "description": "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself.\n\nAs an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target."
        },
        {
          "level": 6,
          "name": "Channel Divinity: Cloak of Shadows",
          "description": "Starting at 6th level, you can use your Channel Divinity to vanish.\n\nAs an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with poison-a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Improved Duplicity",
          "description": "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet."
        }
      ]
    },
    {
      "name": "War Domain",
      "castermult": 1,
      "features": [
        {
          "level": 1,
          "name": "War Domain Spells",
          "description": "1st - Divine Favor, Shield of Faith. 3rd - magic weapon, spiritual weapon. 5th - crusader's mantle, spirit guardians. 7th - freedom of movement, stoneskin. 9th - flame strike, hold monster."
        },
        {
          "level": 1,
          "name": "Bonus Proficiencies",
          "description": "At 1st level, you gain proficiency with martial weapons and heavy armor."
        },
        {
          "level": 1,
          "name": "War Priest",
          "description": "From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action.\n\nYou can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Channel Divinity: Guided Strike",
          "description": "Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
        },
        {
          "level": 6,
          "name": "Channel Divinity: War God's Blessing",
          "description": "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
        },
        {
          "level": 8,
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "level": 17,
          "name": "Avatar of Battle",
          "description": "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from non-magical weapons."
        }
      ]
    }
  ]
}