{
  "name": "Ranger",
  "level": 1,
  "hitdie": 10,
  "proficiencies": {
    "armor": ["light armor", "medium armor", "shields"],
    "weapons": ["simple weapons", "martial weapons"],
    "tools": [],
    "saving throws": ["str", "dex"],
    "numskills": 3,
    "skills": ["animalhandling", "athletics", "insight", "investigation", "nature", "perception", "stealth", "survival"]
  },
  "features": [
    {
      "level": 1,
      "name": "Favored Enemy",
      "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy commonly encountered in the wilds.\n\nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. You gain a +2 bonus to damage rolls with weapon attacks against creatures of the chosen type. Additionally, you have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n\nWhen you gain this feature, you also learn one language of your choice, typically one spoken by your favored enemy or creatures associated with it. However, you are free to pick any language you wish to learn.\n\nYou choose one additional favored enemy, as well as an additional language, at 6th level and 14th level, and the damage you do to your favored enemies increases to +4 at 6th level, and +6 at 14th level."
    },
    {
      "level": 1,
      "name": "Natural Explorer",
      "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy commonly encountered in the wilds.\n\nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. You gain a +2 bonus to damage rolls with weapon attacks against creatures of the chosen type. Additionally, you have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n\nWhen you gain this feature, you also learn one language of your choice, typically one spoken by your favored enemy or creatures associated with it. However, you are free to pick any language you wish to learn.\n\nYou choose one additional favored enemy, as well as an additional language, at 6th level and 14th level, and the damage you do to your favored enemies increases to +4 at 6th level, and +6 at 14th level."
    },
    {
      "level": 2,
      "name": "Fighting Style",
      "description": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\n\n#### Archery\n\nYou gain a +2 bonus to attack rolls you make with ranged weapons.\n\n#### Defense\n\nWhile you are wearing armor, you gain a +1 bonus to AC\n\n#### Dueling\n\nWhen you are weilding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n\n#### Two-Weapon Fighting\n\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
    },
    {
      "level": 2,
      "name": "Spellcasting",
      "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.\n\n#### Spell Slots\n\nThe Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell animal friendship and have a 1st-level and a 2nd-level spell slot available, you can cast animal friendship using either slot.\n\n#### Spells Known of 1st Level and Higher\n\nYou know two 1st-level spells of your choice from the ranger spell list.\n\nThe Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nSpell attack modifier = your proficiency bonus + your Wisdom modifier."
    },
    {
      "level": 3,
      "name": "Ranger Archetype",
      "description": "At 3rd level, you choose an archetype that you strive to emulate: Hunter or Beast Master, both detailed at the end o f the class description. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."
    },
    {
      "level": 3,
      "name": "Primeval Awareness",
      "description": "Beginning at 3rd level, you can use your action and to focus your awareness on the region around you. For 1 minute you can sense whether the following types of creatures are present within 1 mile of you: aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures location or number. If at least one of the creatures is within 60 feet of you this ability reveals the location of the nearest creature."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 5,
      "name": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
      "level": 8,
      "name": "Land's Stride",
      "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
    },
    {
      "level": 10,
      "name": "Hide in Plain Sight",
      "description": "Starting at 10th level, you can remain perfectly still for long periods of time to set up ambushes.\n\nWhen you attempt to hide on your turn, you can opt to not move on that turn. If you avoid moving, creatures that attempt to detect you take a −5 penalty to their Wisdom (Perception) checks until the start of your next turn. You lose this benefit if you move or fall prone, either voluntarily or because of some external effect. You are still automatically detected if any effect or action causes you to no longer be hidden.\n\nIf you are still hidden on your next turn, you can continue to remain motionless and gain this benefit until you are detected."
    },
    {
      "level": 14,
      "name": "Vanish",
      "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail."
    },
    {
      "level": 18,
      "name": "Feral Senses",
      "description": "At 18th level, you gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it.\n\nYou are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened."
    },
    {
      "level": 20,
      "name": "Foe Slayer",
      "description": "At 20th level, you become an unparalleled hunter. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
    }
  ],
  "subclass": [
    {
      "name": "Beast Master",
      "castermult": 0.5,
      "features": [
        {
          "level": 3,
          "name": "Animal Companion",
          "description": "At 3rd level, you learn to use your magic to create a powerful bond with a creature of the natural world.\n\nWith 8 hours of work and the expenditure of 50 gp worth of rare herbs and fine food, you call forth an animal from the wilderness to serve as your faithful companion. You can select any beast of cr 1/2 or less that could reasonably appear in the area you are in, see the . However, your DM might pick one of these animals for you, based on the surrounding terrain and on what types of creatures would logically be present in the area (for examples see the Learning Beast Shapes tables in Xanathar's Guide to Everything, pages 24-26).\n\nAt the end of the 8 hours, your animal companion appears and gains all the benefits of your Companion’s Bond ability. You can have only one animal companion at a time.\n\nIf your animal companion is ever slain, the magical bond you share allows you to return it to life. With 8 hours of work and the expenditure of 25 gp worth of rare herbs and fine food, you call forth your companion’s spirit and use your magic to create a new body for it. You can return an animal companion to life in this manner even if you do not possess any part of its body.\n\nIf you use this ability to return a former animal companion to life while you have a current animal companion, your current companion leaves you and is replaced by the restored companion.\n\n#### Companion's Bond\n\nYour animal companion gains a variety of benefits while it is linked to you.\n\nThe companion obeys your commands as best it can. It rolls for initiative like any other creature, but you determine its actions, decisions, attitudes, and so on. If you are incapacitated or absent, your companion acts on its own.\n\nWhen using your Natural Explorer feature, you and your animal companion can both move stealthily at a normal pace.\n\n#### Keeping Track of Proficiency\n\nWhen you gain your animal companion at 3rd level, its proficiency bonus matches yours at +2. As you gain levels and increase your proficiency bonus, remember that your companion’s proficiency bonus improves as well, and is applied to the following areas: Armor Class, skills, saving throws, attack bonus, and damage rolls.\n\nYour animal companion has abilities and game statistics determined in part by your level. Your companion uses your proficiency bonus rather than its own. In addition to the areas where it normally uses its proficiency bonus, an animal companion also adds its proficiency bonus to its AC and to its damage rolls.\n\nYour animal companion gains proficiency in two skills of your choice. It also becomes proficient with all saving throws.\n\nFor each level you gain after 3rd, your animal companion gains an additional hit die and increases its hit points accordingly.\n\nWhenever you gain the Ability Score Improvement class feature, your companion’s abilities also improve. Your companion can increase one ability score of your choice by 2, or it can increase two ability scores of your choice by 1. As normal, your companion can’t increase an ability score above 20 using this feature unless its description specifies otherwise.\n\nYour companion shares your alignment, and has a personality trait and a flaw that you can roll for or select from the tables below. Your companion shares your ideal, and its bond is always, \"The ranger who travels with me is a beloved companion for whom I would gladly give my life.\n\nYour animal companion gains the benefits of your Favored Enemy feature. It uses the favored enemies you selected."
        },
        {
          "level": 7,
          "name": "Beast's Defense",
          "description": "At 7th level, while your companion can see you, it has advantage on all saving throws."
        },
        {
          "level": 11,
          "name": "Storm of Claws and Fangs",
          "description": "At 11th level, your companion can use its action to make a melee attack against each creature of its choice within 5 feet of it, with a separate attack roll for each target."
        },
        {
          "level": 15,
          "name": "Superior Beast's Defense",
          "description": "At 15th level, whenever an attacker that your companion can see hits it with an attack, it can use its reaction to halve the attack’s damage against it."
        }
      ]
    },
    {
      "name": "Hunter Conclave",
      "castermult": 0.5,
      "features": [
        {
          "level": 3,
          "name": "Hunter's Prey",
          "description": "At 3rd level, you gain one of the following features of your choice.\n\n**Colossus Slayer.** Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it is below its hit point maximum. You can deal this extra damage only once per turn.\n\n**Giant Killer.\n\n When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.\n\n**Horde Breaker.** Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon."
        },
        {
          "level": 7,
          "name": "Defensive Tactics",
          "description": "At 7th level, you gain one of the following features of your choice.\n\n**Escape the Horde.** Opportunity attacks against you are made with disadvantage.\n\n**Multiattack defense.** When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn.\n\n**Steel Will.** You have advantage on saving throws against being frightened."
        },
        {
          "level": 11,
          "name": "Multiattack",
          "description": "At 11th level, you gain one of the following features of your choice.\n\n**Volley.** You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapons range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target.\n\n**Whirlwind Attack.** You can use your action to make melee attacks against any number of creatures within 5 feet of you, with a separate attack roll for each target."
        },
        {
          "level": 15,
          "name": "Superior Hunter's Defense",
          "description": "At 15th level you gain one of the following features of your choice.\n\n**Evasion.** When you are subjected to an effect, such as a red dragon's fiery breath or a lightning bolt spell, that allows you to make a dexterity saving throw to take only half damage, you instead take no damage if you succeed on a saving throw, and only half damage if you fail.\n\n**Stand against the Tide.** When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.\n\n**Uncanny Dodge.** When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
        }
      ]
    },
    {
      "name": "Gloom Stalker",
      "castermult": 0.5,
      "features": [
        {
          "level": 3,
          "name": "Gloom Stalker Magic",
          "description": "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Gloom Stalker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n*3rd - disguise self\n*5th - rope trick\n*9th - fear\n*13th - greater invisibility\n*seeming"
        },
        {
          "level": 3,
          "name": "Dread Ambusher",
          "description": "At 3rd level, you master the art of the ambush. You can give yourself a bonus to your initiative rolls equal to your Wisdom modifier.\n\nAt the start of your first turn Of each combat, your walking speed increases by 10 feet, which lasts until the end of that turn. If you take the Attack action on that turn, you can make one additional weapon attack as part of that action. If that attack hits, the target takes an extra 1d8 damage of the weapons damage type."
        },
        {
          "level": 3,
          "name": "Umbral Sight",
          "description": "At 3rd level, you gain darkvision out to a range of 60' feet. If you already have darkvision from your race, its range increases by 30 feet.\n\nYou are also adept at evading creatures that rely on darkvision. While in darkness, you are invisible to any creature that relies on darkvision to see you in that darkness."
        },
        {
          "level": 7,
          "name": "Iron Mind",
          "description": "By 7th level, you have honed your ability to resist the mind—altering powers of your prey. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
        },
        {
          "level": 11,
          "name": "Stalker's Flurry",
          "description": "At 11th level, you learn to attack with such unexpected speed that you can turn a miss into another strike. Once on each of your turns when you miss with a weapon attack, you can make another weapon attack as part of the same action."
        },
        {
          "level": 15,
          "name": "Shadowy Dodge",
          "description": "Starting at 15th level, you can dodge in unforeseen ways, with wisps of supernatural shadow around you. Whenever a creature makes an attack roll against you and doesn’t have advantage on the roll, you can use your reaction to impose disadvantage on it. You must use this feature before you know the outcome of the attack roll."
        }
      ]
    },
    {
      "name": "Horizon Walker",
      "castermult": 0.5,
      "features": [
        {
          "level": 3,
          "name": "Horizon Walker Magic",
          "description": "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Horizon Walker Spells table. The spell counts as a ranger spell for you, but it doesn’t count against the number of ranger spells you know.\n\n*3rd - protection from evil and good\n*5th - misty step\n*9th - haste\n*13th - banishment\n*17th - teleportation circle"
        },
        {
          "level": 3,
          "name": "Detect Portal",
          "description": "At 3rd level, you gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\nSee the “Planar Travel” section in chapter 2 of the Dungeon Master’s Guide for examples of planar portals."
        },
        {
          "level": 3,
          "name": "Planar Warrior",
          "description": "At 3rd level, you learn to draw on the energy of the multiverse to augment your attacks.\n\nAs a bonus action, choose one creature you can see within 30 feet of you. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage from the attack. When you reach 11th level in this class, the extra damage increases to 2d8."
        },
        {
          "level": 7,
          "name": "Ethereal Step",
          "description": "At 7th level, you learn to step through the Ethereal Plane. As a bonus action, you can cast the etherealness spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
        },
        {
          "level": 11,
          "name": "Distant Strike",
          "description": "At 11th level, you gain the ability to pass between the planes in the blink of an eye. When you take the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.\n\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature."
        },
        {
          "level": 15,
          "name": "Spectral Defense",
          "description": "At 15th level, your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack’s damage on this turn."
        }
      ]
    },
    {
      "name": "Monster Slayer",
      "castermult": 0.5,
      "features": [
        {
          "level": 3,
          "name": "Monster Slayer Magic",
          "description": "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Monster Slayer Spells table. The spell counts as a ranger spell for you, but it doesn’t count against the number of ranger spells you know.\n\n*3rd - protection from evil and good\n*5th - zone of truth\n*9th - magic circle\n*13th - banishment\n*17th - hold monster"
        },
        {
          "level": 3,
          "name": "Hunter's Sense",
          "description": "At 3rd level, you gain the ability to peer at a creature and magically discern how best to hurt it. As an action, choose one creature you can see within 60 feet of you. You immediately learn whether the creature has any damage immunities, resistances, or vulnerabilities and what they are. If the creature is hidden from divination magic, you sense that it has no damage immunities, resistances, or vulnerabilities.\n\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 3,
          "name": "Slayer's Prey",
          "description": "Starting at 3rd level, you can focus your ire on one foe, increasing the harm you inflict on it. As a bonus action, you designate one creature you can see within 60 feet of you as the target of this feature. The first time each turn that you hit that target with a weapon attack, it takes an extra 1d6 damage from the weapon.\n\nThis benefit lasts until you finish a short or long rest. It ends early if you designate a different creature."
        },
        {
          "level": 7,
          "name": "Supernatural Defense",
          "description": "At 7th level, you gain extra resilience against your prey’s assaults on your mind and body. Whenever the target of your Slayer’s Prey forces you to make a saving throw and whenever you make an ability check to escape that targets grapple, add 1d6 to your roll."
        },
        {
          "level": 11,
          "name": "Magic-User's Nemesis",
          "description": "At 11th level, you gain the ability to thwart someone else’s magic. When you see a creature casting a spell or teleporting within 60 feet of you, you can use your reaction to try to magically foil it. The creature must succeed on a Wisdom saving throw against your spell save DC, or its spell or teleport fails and is wasted.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
        },
        {
          "level": 15,
          "name": "Slayer's Counter",
          "description": "At 15th level, you gain the ability to counterattack when your prey tries to sabotage you. If the target of your Slayer’s Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds, in addition to the attack’s normal effects."
        }
      ]
    }
  ]
}