      {
        "id": "alohim",
        "name": "Alohim",
        "holysymbol": "A Yellow Rising Sun on a White Background",
        "symbolimage": "https://elthelas-images.herokuapp.com/holysymbol/alohim-symbol.png",
        "alignment": "Lawful Good",
        "domains": "Light, Rulership, the Divine Right of Kings",
        "domains5": "Light, War",
        "worshippers": "Alohim is worshiped mostly by nobles, particularly those who believe in a divine right to rule, and the nobility of strength.\n\nThe Clergy of Alohim tend to be wealthy, as they receive large donations from the nobility whom they support. They tend to support good order in a country through the strict separation of nobility and serf.",
        "weapon": "Lance",
        "enemy": "Mat'raktha",
        "appearance": "Alohim has shoulder length golden brown hair, often tied back and golden brown eyes.  He either dresses in rich noble clothing with plenty of gold trim and purple or golden armor and well-made boots of leather.  He has a long face with large features.",
        "home": "Alohim's palace lies at the peak of Mount Celestia",
        "tenets": [
          "I must above all, safeguard the lives of those who depend on me.",
          "I must recognize the divine right to command granted to Kings and their vassals.",
          "I must pray each day at dawn, celebrating the coming of the light.",
          "I must never show cowardice in the face of my enemies",
          "I must keep myself pure both in appearance and soul"
        ],
        "holiday": "Alohiman 26, The Dominion of the Sun. On the longest day of the year people celebrate with dancing in public squares and other outdoor spaces. Great tables are set up and it is encumbant on the local lord to host a great breakfast feast for the whole town at dawn. It is also the traditional day for oaths of fealty.",
        "lore": "Alohim, the eldest child of Nera, is considered among good aligned nations to be the father of the Gods, which makes sense given that his 3 daughters are 3 of the most revered in such places, Amathera, Sara, and Cora. He and his daughters are said to have worked cooperatively to create humans, and until Dorman's ascension he was considered a patron God of all humanity. In the Gods War it was Alohim and Mat'raktha's argument over who should have dominion over Kings and Nations that quickly descended into argument and war. The clergy of Alohim acknowledge this, claiming the dominion of rulership was granted to Alohim at his creation. The sun is considered to be a manifestation of Alohim's power.",
        "level1": "**Light of Dawn.** You know the light cantrip and can cast it at will.",
        "level10": "**Cleansing Light of Alohim.** You can cast the daylight spell as a 3rd level spell 1/day without using a spellslot."
      }