      {
        "id": "amathera",
        "name": "Amathera",
        "holysymbol": "A sheaf of grain over a kite shield",
        "symbolimage": "https://elthelas-images.herokuapp.com/holysymbol/amathera.jpg",
        "alignment": "Neutral Good",
        "domains": "Safety, Family, Community, Peace, and Protection",
        "domains5": "Arcana, Knowledge, Life",
        "worshippers": "The poor, the weak, and those in need of protection from greater foes all pray to Amathera. The nation of Zelfir worships Amathera exclusively, as she aided them in their liberation from the Sorceron now imprisoned in the Sorcerer's Prison.\n\nThe clergy of Amathera receive little to no recognition (at least outside of Zelfir) and live as humbly as those they administer to, usually having cells within the poor houses they operate. They must be blessed with robust health by Amathera for they often work in the dirtiest and most dangerous areas, yet they rarely suffer from disease or attack. Indeed, only the most wretchedly depraved would attack a cleric of Amathera while he was undertaking his duty, for all are welcome to the protection of the Goddess.",
        "weapon": "Spear, Shield(shield bash)",
        "enemy": "Malik",
        "appearance": "Amathera appears as a tall, slender, well muscled woman with dark hair and brown eyes.  Typically dressed in a simple white dress or robe and carrying a large shield. She wears a crown of olive leaves",
        "home": "Celestia",
        "tenets": [
          "All people of means should give of what they have to the poor.",
          "Knowledge is a safeguard against the evils of war. Learning is the pathway to peace.",
          "Love for your neighbor is the paramount good",
          "I must never force another to my will. Rather I must sit with my enemies and teach them, that they might be edified and learn a better way."
        ],
        "holiday": "Amatherin 30, the Festival of the Lowly. Each year on the shortest day of the year Amathera's priests hold the feast of the lowly where the poorest in the community are honored guests and all must bring offerings of their best to grace them.",
        "parents": "3rd generation, born of Alohim and Nera",
        "lore": "Amathera is mentioned little in the ancient texts, besides that she is the daughter of Alohim and Nera. The greatest single work she is known for is the freeing of the Hisru peoples from their Sorceron master. She is not prone to great works, grand proclomations, or righteous war. Rather she slowly builds up the world through acts of kindness. Rescuing refugees, feeding the poor, and building homes for the homeless.",
        "level1": "",
        "level10": ""
      }