      {
        "id": "area",
        "name": "Area (pronounced ah-REE-ah)",
        "holysymbol": "A field of grass",
        "symbolimage": "https://elthelas-images.herokuapp.com/holysymbol/",
        "alignment": "Chaotic Evil",
        "domains": "The inevitable end of times, revenge, space and distance",
        "domains5": "",
        "worshippers": "Area does not have worshippers, as her lore has been all but forgotten in the modern era. The Gods long ago agreed to never speak of the 3rd Mother God, worried that should she return from her imprisonment, she would end all things. Nevertheless, there have long been whispers of those touched by a mad God with no memory who speaks to them, and some few others know the truth, that beyond the known planes there is a prison for a being that not even Nera could kill.",
        "weapon": "unarmed strike",
        "enemy": "Nera",
        "appearance": "Area, when she takes a humanoid form, takes the appearance of a young girl child. Her innocent appearance belying her vengeful nature.",
        "home": "Aitia, but currently confined in The Plane of ME, hidden within the Outer Realms",
        "tenets": [
          "The world is finite, and its end approaches",
          "The Gods themselves have sinned. Their destruction is the only correct result.",
          "One must take from ones enemies in equal measure to what is taken from you."
        ],
        "holiday": "None",
        "parents": "1st Generation",
        "lore": "Area, the 3rd Mother Goddess, the Forgotten One, She who is without name. Area is the mother of 1/3 of the Gods, but is reviled by all. When the Gods War broke out, Area declared creation failed, and proposed that all of creation be destroyed so that the Mother Gods could start over. Her sisters rejected this plan, so Area attempted to disable them so she could do it herself. She struck down Gaian, putting her into a deep coma, before Nera tricked her into her current prison, her mind sealed behind walls that she cannot breach on her own. Most churches do not even acknowledge her existence except in the most hidden secret lore. It is rumored that certain arcanum crystals in the world serve as parts of the wall of her prison, and touching them can bring one into contact with a fragment of Area's mind. This fragment, known as ME because it cannot remember it's name, nor remember the concept of having one (I am ME, it often says when asked), blindly grasps at minds to attempt to find servants willing to free it, releasing some portion of Area's power back into the world. Some say it succeeded once, only to have its Avatar destroyed by Nera herself with the aid of a group of adventurers.",
        "level1": "",
        "level10": ""
      }