{
        "id": "nera",
        "name": "Nera",
        "holysymbol": "A disc half white and half black",
        "symbolimage": "https://elthelas-images.herokuapp.com/holysymbol/neraholysymbol.png",
        "alignment": "Neutral Good and Neutral Evil",
        "domains": "Goddess of Life, Birth, and Death",
        "domains5": "Death, Life, Twilight",
        "worshippers": "Nera's worshippers are rare and hunted in most countries in the modern era, as the common belief is that she is the God of Necromancers. She is worshipped as the one true great God in the country of Arad. Within Arad, her church acts as both ruler and church.",
        "weapon": "Flail",
        "enemy": "Area",
        "appearance": "The mother of the gods (or so she claims) has a very curvy healthy figure.  Pale, glowing skin, blue-black long wavy hair, dresses in long white flowing clothing with bare feet.  She has a round face with a wide generous mouth large silver-grey eyes with a straight nose.",
        "lore": "Nera's good aspect teaches of the immortality of the soul, and that one should act wisely in this life in order that you may continue to aid your progenitors beyond death. One does this by being kind, nurturing, and giving of oneself. Those sainted people who do this well may return as deathless from time to time to aid those they care about or causes they consider important. Her devout followers are granted exceptionally long lives. However, she also holds that true immortality is reserved for the Gods, and those who attempt to defy that suffer her wrath.<br/>Nera's evil aspect teaches of the power of undeath and the quest for immortality through undeath. Those who displease the Goddess may find themselves facing the ultimate death, in which the soul itself dies and their is no rebirth.<br/>It is rumored that only Nera can impose death upon a God.",
        "home": "Logos",
        "tenets": [
          "All must eventually face the death of their mortal bodies. It is best to accept death with grace.",
          "Bodies are but houses for the soul, once the soul has departed the body should be used to help the living."
        ],
        "holiday": "",
        "parents": "1st Generation",
        "lore": "",
        "level1": "",
        "level10": ""
      }