{
        "id": "nera",
        "name": "Nera",
        "holysymbol": "A disc half white and half black",
        "alignment": "Neutral Good and Neutral Evil",
        "domains": "Balance, Creation, Death, Good, Moon, Planning, Renewal, Time OR Balance, Death, Deathbound, Evil, Moon, Time, Undeath",
        "domains5": "Death, Life",
        "interfaithblessing": "Good Aspect: +1 to attack rolls and skill checks Evil Aspect: +2 to attack rolls",
        "worshippers": "Nera's worshippers are rare and hunted in most countries in the modern era, as the common belief is that she is the God of Necromancers. She is worshipped as the one true great God in the country of Arad.",
        "allowedalignments": "Lawful Good, Neutral Good, Chaotic Good, Neutral, Lawful Evil, Neutral Evil, Chaotic Evil",
        "weapon": "Flail",
        "enemy": "",
        "appearance": "The mother of the god has a very curvy healthy figure.  Pale, glowing skin, blue-black long wavy hair, dresses in long white flowing clothing with bare feet.  She has a round face with a wide generous mouth large silver-grey eyes with a straight nose.",
        "dogma": "Nera's good aspect teaches of the immortality of the soul, and that one should act wisely in this life in order that you may continue to aid your progenitors beyond death. One does this by being kind, nurturing, and giving of oneself. Those sainted people who do this well may return as deathless from time to time to aid those they care about or causes they consider important. Her devout followers are granted exceptionally long lives.",
        "clergy": "<br/>Nera's evil aspect teaches of the power of undeath and the quest for immortality through undeath. Those who displease the Goddess may find themselves facing the ultimate death, in which the soul itself dies and their is no rebirth.<br/>It is rumored that only Nera can impose death upon a God.",
        "home": "The Confluence",
        "church": "",
        "tenets": [],
        "level1": "",
        "level10": ""
      }