{"model":"Ancestries","documents":[{"id":"aarakocra","name":"Aarakocra","singular":"Aarakocra","description":"Long believed to only exist on the Plane of Air, there are in fact many Aarakocra native to Elthelas, building cliffside cities in the mountains of western Asura. They are an insular people, rarely venturing out of their native lands.","traits":[{"name":"Size","description":"Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 7m, and you have a flying speed of 15m"},{"name":"Talons","description":"Your talons are natural weapons, which you can use to make unarmed strikes. They have the light and finesse properties and do 1d6 slashing damage on a hit."},{"name":"Wind Caller","description":"Starting at 3rd level, you can cast the gust of wind spell with this trait, without requiring a material component. Once you cast the spell with this trait, you can't do so again until you finish a long rest. You can also cast the spell using any spell slots you have of 2nd level or higher.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for it when you cast gust of wind with this trait (choose when you select this race)."}],"agepoints":{"puberty":6,"sexualmaturity":9,"mentalmaturity":12,"middleage":30,"oldage":40,"averagelifespan":50,"maxage":60},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/aarakocra.png","description":"","traits":[],"averageheight":60,"baseheight":53,"heightroll":"2d6","averageweight":90,"baseweight":55,"weightroll":"2d4","speed":[7,15,0,0,0]}]},{"id":"aasimar","name":"Aasimar","singular":"Aasimar","description":"\n\nAasimar are the distant descendents of angels and gods. In many societies the birth of an aasimar is heralded as a grand event. Aasimar are incredibly rare, and don't have a unique culture of their own, but their personality is invariably altered by their divine forebear. The expectation that they will be better than their peers is strong, and can be overwhelming to some, while to others it is a call to true greatness.","traits":[{"name":"Darkvision","description":"darkvision 18m"},{"name":"Speed","description":"Your base walking speed is 9m"},{"name":"Size","description":"Your size is medium"},{"name":"Celestial Resistance","description":"You have resistance to necrotic damage and radiant damage."},{"name":"Healing Hands","description":"As an action, you can touch a creature and cause it to regain a number of hit points equal to your level.  Once you use this trait, you can't use it again until you finish a long rest."},{"name":"Light Bearer","description":"You know the light cantrip.  Charisma is your spellcasting ability for it."}],"agepoints":{"puberty":18,"sexualmaturity":22,"mentalmaturity":35,"middleage":60,"oldage":80,"averagelifespan":110,"maxage":140},"subraces":[{"id":"protectedaasimar","name":"Protected Aasimar","singular":"Protected Aasimar","image":"https://elthelas-images.herokuapp.com/races/aasimar.jpg","description":"\n\nProtector aasimar are charged by the powers of good to guard the weak, to strike at evil wherever it arises, and to stand vigilant against the darkness. From a young age, a protector aasimar receives advice and directives that urge to stand against evil.\n\n","traits":[{"name":"Radiant Soul","description":"Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing your eyes to glimmer and two luminous, incorporeal wings to sprout from your back.\nYour transformation lasts for 1 minute or until you end it as a bonus action.  During it, you have a fly speed of 9m, and once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or spell.  The extra radiant damage equals your level.\nOnce you use this trait, you can't use it again until you finish a long rest."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":175,"baseweight":120,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"scourgeaasimar","name":"Scourge Aasimar","singular":"Scourge Aasimar","description":"\n\nScourge aasimar are imbued with a divine energy that blazes intensely within them. It feeds a powerful desire to destroy evil-a desire that is, at its best, unflinching and, at its worst, all-consuming. Many scourge aasimar wear masks to block out the world and focus on containing this power, unmasking themselves only in battle.\n\n","image":false,"traits":[{"name":"Radiant Consumption","description":"Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing a searing light to radiate from you, pour out of your eyes and mouth, and threaten to char you. Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed bright light in a 3m radius and dim light for an additional 3m, and at the end of each of your turns, you and each creature within 3m of you take radiant damage equal to half your level (rounded up). In addition, once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra radiant damage equals your level. Once you use this trait, you can't use it again until you finish a long rest."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":175,"baseweight":120,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"fallenaasimar","name":"Fallen Aasimar","singular":"Fallen Aasimar","description":"\n\nAn aasimar who was touched by dark powers as a youth or who turns to evil in early adulthood can become one of the fallen-a group of aasimar whose inner light has been replaced by shadow.\n\n","image":false,"traits":[{"name":"Necrotic Shroud","description":"Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing your eyes to turn into pools of darkness and two skeletal, ghostly, flightless wings to sprout from your back. The instant you transform, other creatures within 3m of you that can see you must each succeed on a Charisma saving throw (DC 8 + your proficiency bonus + your Charisma modifier) or become frightened of you until the end of your next turn. Your transformation lasts for 1 minute or until you end it as a bonus action. During it, once on each of your turns, you can deal extra necrotic damage to one target when you deal damage to it with an attack or a spell. The extra necrotic damage equals your level. Once you use this trait, you can't use it again until you finish a long rest."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":175,"baseweight":120,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"bugbears","name":"Bugbears","singular":"Bugbear","description":"\n\nBugbears are born for battle and mayhem. Surviving by raiding and hunting, they bully the weak and despise being bossed around, but their love of carnage means they will fight for powerful masters if bloodshed and treasure are assured.\n\nBugbears are often found in the company of their cousins, hobgoblins and goblins. Bugbears usually enslave goblins they encounter, and they bully hobgoblins into giving them gold and food in return for serving as scouts and shock troops. Even when paid, bugbears are at best unreliable allies, yet goblins and hobgoblins understand that no matter how much bugbears might drain a tribe of resources, these creatures are a potent force.\n\nBugbears are typically found in the hills and wild places of the world where society is limited. Most worship Malik, God of chaos, war, and destruction, although a few have been known to worship Tiamat or Trolka, particularly in places where a show of faith to one of those Gods may be expedient to their survival (such as in Dragonhome and Gorgro).\n\nDespite their intimidating builds, bugbears move with surprising stealth. They are fond of setting ambushes and flee when outmatched. They are dependable mercenaries as long as they are supplied food, drink, and treasure, but a bugbear forgets any bond when its life is on the line. A wounded member of a bugbear band might be left behind to help the rest of the band escape. Afterward, that bugbear might help pursuers track down its former companions if doing so saves its life.\n\n","traits":[{"name":"Size","description":"Bugbears are between 6 and 8 feet tall and weigh between 250 and 350 pounds. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m"},{"name":"Surprise Attack","description":"If the bugbear surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 7 (2d6) damage from the attack."},{"name":"Stealthy","description":"Bugbears are always proficient in dexterity (stealth)"},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Long Limbed","description":"When you make a melee attack on your turn, your reach for it is 1m greater than normal."},{"name":"Powerful Build","description":"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."}],"agepoints":{"puberty":8,"sexualmaturity":10,"mentalmaturity":15,"middleage":25,"oldage":35,"averagelifespan":50,"maxage":65},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/bugbear.jpg","description":"","traits":[],"averageheight":85,"baseheight":72,"heightroll":"2d12","averageweight":290,"baseweight":200,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"childofmolton","name":"Child of Molton","singular":"Child of Molton","description":"\n\nMolton, God of Fire and Lust, has long made it a habit of dallying with mortal women from among his worshippers. Those willing worshippers whom he selects are invited across the planes into his palace, where they report on returning having the best sex of their lives, returning with enough riches to set them and the resulting child up for the rest of their lives. His fertility knows no bounds, and even the most infertile women have found themselves with child after such encounters. The resulting children are usually still mostly resemble their mothers, but find themselves infused with the essence of fire. They are renowned for their lustful ways (sometimes unfairly) as well as their affinity for fire, music, and dance. Children of Molton are born with hair in bright fiery colors of red, orange, yellow, blue or green and golden skin. They are also invariably beautiful, their skin without unnatural blemishes, faces well balanced, and a form that is lithe and graceful.\n\nEvery Child of Molton is naturally born into the church of Molton, and expectations for them are high. Meanwhile, within society itself they are seen as unpredictable or even dangerous. They are often blamed when spouses stray, compared to succubi or incubi. They tend to be drawn to fire in unpredictable ways, sometimes channeled in helpful ways, such as joining a fire defense crew in their local town, but other times less so, tending towards pyromania or arson. Sexuality among children of molton tends to be much more fluid than in other races, and their attitudes towards sex and sexuality are typically much more relaxed.","traits":[{"name":"Size","description":"Children of Molton are generally similar to elves or humans in height, weight, and build. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 10m"},{"name":"Darkvision","description":"You have the darkvision ability up to 36m. While in the dark you see everything in shades of red."},{"name":"Pyromancer","description":"You know the firebolt and produce flame cantrips. Charisma is your casting stat for both."},{"name":"Embodiment of Lust","description":"You have advantage on charisma checks involved in a romantic encounter."},{"name":"Fire Resistance","description":"You have resistance to fire damage."}],"agepoints":{"puberty":16,"sexualmaturity":20,"mentalmaturity":30,"middleage":50,"oldage":70,"averagelifespan":110,"maxage":140},"subraces":[{"id":"default","name":"default","description":"","traits":[],"image":"https://elthelas-images.herokuapp.com/races/childofmolton.jpg","averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":155,"baseweight":100,"weightroll":"2d4","speed":[10,0,0,0,0]}]},{"id":"dragonborn","name":"Dragonborn","singular":"Dragonborn","description":"\n\nAfter the people of Dera were rescued by the Dragon God Bahamut, many dragons came to live among the people of Dera'Dragorim, and it became a matter of honor to bear the child of a dragon. While half-dragon children were rarely viable, those that were born proved to be incredibly fertile, and it was considered almost as great an honor to bear the child of a half-dragon as a dragon. This led to a large population of people with a quarter or less of dragon blood, called Dragonborn or Spellscales. Dragonborn are more draconic in appearance than their Spellscale cousins, are larger, and considerably stronger. They have scaly hides, draconic like faces, and often have clawed hands and feet or even wings. Outside of Dera'Dragorim and more urban settings, they are often seen as monsters.\n\n","traits":[{"name":"Size","description":"Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Draconic Ancestry","description":"You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table."}],"agepoints":{"puberty":19,"sexualmaturity":24,"mentalmaturity":40,"middleage":65,"oldage":90,"averagelifespan":120,"maxage":150},"subraces":[{"id":"black","name":"Black Dragonborn","singular":"Black Dragonborn","description":"","image":"https://elthelas-images.herokuapp.com/races/dragonborn.jpg","traits":[{"name":"Acid Resistance","description":"you have resistance to acid damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 9m line that is 1m wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 acid damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Chromatic Warding","description":"Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to acid damage. Once you use this trait, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"copper","name":"Copper Dragonborn","singular":"Copper Dragonborn","description":"","image":false,"traits":[{"name":"Acid Resistance","description":"you have resistance to acid damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 4m cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 acid damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Metallic Breath Weapon","description":"At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 4m cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n\n* **Enervating Breath.** Each creature in the cone must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\n* **Repulsion Breath.** Each creature in the cone must succeed on a Strength saving throw or be pushed 6m away from you and be knocked prone.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"blue","name":"Blue Dragonborn","singular":"Blue Dragonborn","description":"","image":false,"traits":[{"name":"Lightning Resistance","description":"you have resistance to lightning damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 9m that is 1m wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 lightning damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Chromatic Warding","description":"Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to lightning damage. Once you use this trait, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"bronze","name":"Bronze Dragonborn","singular":"Bronze Dragonborn","description":"","image":false,"traits":[{"name":"Lightning Resistance","description":"you have resistance to lightning damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 4m. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 lightning damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Metallic Breath Weapon","description":"At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 4m cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n\n* **Enervating Breath.** Each creature in the cone must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\n* **Repulsion Breath.** Each creature in the cone must succeed on a Strength saving throw or be pushed 6m away from you and be knocked prone.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"brass","name":"Brass Dragonborn","singular":"Brass Dragonborn","description":"","image":false,"traits":[{"name":"Fire Resistance","description":"you have resistance to fire damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 4m cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 fire damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Metallic Breath Weapon","description":"At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 4m cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n\n* **Enervating Breath.** Each creature in the cone must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\n* **Repulsion Breath.** Each creature in the cone must succeed on a Strength saving throw or be pushed 6m away from you and be knocked prone.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"gold","name":"Gold Dragonborn","singular":"Gold Dragonborn","description":"","image":false,"traits":[{"name":"Fire Resistance","description":"you have resistance to fire damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 4m cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 fire damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Metallic Breath Weapon","description":"At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 4m cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n\n* **Enervating Breath.** Each creature in the cone must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\n* **Repulsion Breath.** Each creature in the cone must succeed on a Strength saving throw or be pushed 6m away from you and be knocked prone.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"red","name":"Red Dragonborn","singular":"Red Dragonborn","description":"","image":false,"traits":[{"name":"Fire Resistance","description":"you have resistance to fire damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 9m line that is 1m wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 fire damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Chromatic Warding","description":"Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to fire damage. Once you use this trait, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"green","name":"Green Dragonborn","singular":"Green Dragonborn","description":"","image":false,"traits":[{"name":"Poison Resistance","description":"you have resistance to poison damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 9m line that is 1m wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 poison damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Chromatic Warding","description":"Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to poison damage. Once you use this trait, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"silver","name":"Silver Dragonborn","singular":"Silver Dragonborn","description":"","image":false,"traits":[{"name":"Cold Resistance","description":"you have resistance to cold damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 4m cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 cold damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Metallic Breath Weapon","description":"At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 4m cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n\n* **Enervating Breath.** Each creature in the cone must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\n* **Repulsion Breath.** Each creature in the cone must succeed on a Strength saving throw or be pushed 6m away from you and be knocked prone.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"white","name":"White Dragonborn","singular":"White Dragonborn","description":"","image":false,"traits":[{"name":"Cold Resistance","description":"you have resistance to cold damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 9m line that is 1m wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 cold damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10). You can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},{"name":"Chromatic Warding","description":"Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to cold damage. Once you use this trait, you can’t do so again until you finish a long rest."}],"averageheight":75,"baseheight":66,"heightroll":"2d8","averageweight":240,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"amethyst","name":"Amethyst Dragonborn","singular":"Amethyst Dragonborn","description":"","image":false,"traits":[{"name":"Draconic Resistance","description":"You have resistance to force damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 force damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."},{"name":"Psionic Mind","description":"You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language."},{"name":"Gem Flight","description":"Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."}]},{"id":"crystal","name":"Crystal Dragonborn","singular":"Crystal Dragonborn","description":"","image":false,"traits":[{"name":"Draconic Resistance","description":"You have resistance to radiant damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 radiant damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."},{"name":"Psionic Mind","description":"You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language."},{"name":"Gem Flight","description":"Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."}]},{"id":"emerald","name":"Emerald Dragonborn","singular":"Emerald Dragonborn","description":"","image":false,"traits":[{"name":"Draconic Resistance","description":"You have resistance to psychic damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 psychic damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."},{"name":"Psionic Mind","description":"You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language."},{"name":"Gem Flight","description":"Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."}]},{"id":"sapphire","name":"Sapphire Dragonborn","singular":"Sapphire Dragonborn","description":"","image":false,"traits":[{"name":"Draconic Resistance","description":"You have resistance to thunder damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 thunder damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."},{"name":"Psionic Mind","description":"You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language."},{"name":"Gem Flight","description":"Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."}]},{"id":"topaz","name":"Topaz Dragonborn","singular":"Topaz Dragonborn","description":"","image":false,"traits":[{"name":"Draconic Resistance","description":"You have resistance to necrotic damage."},{"name":"Breath Weapon","description":"When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 necrotic damage. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."},{"name":"Psionic Mind","description":"You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language."},{"name":"Gem Flight","description":"Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."}]}]},{"id":"dwarves","name":"Dwarves","singular":"Dwarf","description":"\n\nThe Dwarves suffered a difficult split at the end of God's War, one large group of them found themselves abandoned on a chain of islands, while the biggest group was in the center of the large easter continent, Elathia, and under constant attack by orcs and trolls. Since then those trapped on the islands have become the most adept sailors in the world, finding safety and wealth on the sea. The others have found homes in both mountains and plains, and have formed a caste-based republic.\n\nThis has split the dwarves into 4 distinct sub-races, that although they are capable of interbreeding, rarely do.\n\n#### Dwarven Culture in Elthelas\n\nThe Dwarves of Elthelas have a deep affinity for underground and contained spaces. Deep in the vaults of the earth, where light is a rare and expensive thing, art rarely takes the form of the visual, though dwarven stonework and sculpture is often of an incredible caliber. Instead music, particularly singing, are greatly valued. Complicated overlapping resonances fill the caverns, and the choirs of Dorun's faithful are unparalleled. The challenges of an underground life also meant dwarves were the first to invent the water-powered and wind up clocks in Elathia.  Productivity and stoicism are highly valued, as is good order. Many terms common among humans are reversed for dwarves. Darkness is considered good and safe, where light is associated with fear, exposure and death. Phrases like 'moving up in the world' are reversed to 'moving down in the world' as how deep in the earth one lives is associated with status. The acquisition of wealth, particularly in the form of precious metals and gems, approaches the status of religion among the dwarves, such that many of the caste restrictions that exist are centered around methods of acquiring wealth such as restrictions on owning wealth generating property, using banking services, etc.\n\nAnother unusual aspect among dwarven cultures in Elthelas is their tendency towards republicanism.  Both Curinor and Morrindim are governed by semi-democratic representative bodies. Their is no true landed nobility among the dwarves, and those who manage to become wealthy have as much political clout as those who were born to it.\n\n#### Cultural differences among the Morrind\n\n The Morrindim share most of the basic cultural traits with other dwarves of Elthelas, except that they have dropped the traditional caste system.  Access to vehicles of wealth generation is more open in Morrind society.  Similarly the Morrind place less emphasis on living deep within the earth. While the terminology and tradition of 'dark/deep' being equated with 'good' remains, the leaders of Morrind society spend their whole lives in the sun aboard ships.","traits":[{"name":"Size","description":"Dwarves stand between 4 and 5 feet tall and average about 150 lbs. Your size is medium."},{"name":"Dwarven Resilience","description":"You have advantage on saving throws against poison, and you have resistance against poison damage."},{"name":"Dwarven Combat Training","description":"You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."}],"agepoints":{"puberty":15,"sexualmaturity":19,"mentalmaturity":30,"middleage":50,"oldage":70,"averagelifespan":95,"maxage":120},"subraces":[{"id":"deepdwarves","name":"Deep Dwarves","singular":"Deep Dwarf","image":"https://elthelas-images.herokuapp.com/races/dwarf.jpg","description":"The Deep Dwarves are the ruling caste of dwarven society in Curinor. They rarely (if ever in their lives) see the sun, preferring to stay in the deepest parts of the dwarven holds. They travel between holds via underground roads or by palanquin, and almost never associate with plains dwarves, let alone non-dwarves. Deep Dwarves have exceedingly pale, almost colorless skin.","traits":[{"name":"Speed","description":"Your base walking speed is 7m. Your speed is not reduced by wearing heavy armor."},{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 27m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Tool Proficiency","description":"You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."},{"name":"Stonecunning","description":"Whenever you make an intelligence (history) check related to the origin of stonework, you are considered proficient in the history skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."},{"name":"Noble Blood","description":"You gain proficiency in one skill of your choice choosing from persuasion, performance, intimidation, or deception."}],"averageheight":47,"baseheight":42,"heightroll":"2d4","averageweight":135,"baseweight":100,"weightroll":"2d6","speed":[7,0,0,0,0]},{"id":"hilldwarves","name":"Hill Dwarves","singular":"Hill Dwarf","image":false,"description":"The Hill Dwarves of Curinor are the middle glue of society. Most dwarven craftsmen and warriors are hill dwarves, and they do most of the work in the lucrative mines and smithies of Curinor (although the deep dwarves still see most of the profits). Hill Dwarves are hardy folk, but are ill-accustomed to dealing with non-dwarves. Their skin is fair, but not pale, typically with rose colored undertones.","traits":[{"name":"Speed","description":"Your base walking speed is 7m. Your speed is not reduced by wearing heavy armor."},{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Tool Proficiency","description":"You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."},{"name":"Stonecunning","description":"Whenever you make an intelligence (history) check related to the origin of stonework, you are considered proficient in the history skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."},{"name":"Dwarven Toughness","description":"Your hit point maximum increases by 1 per character level."}],"averageheight":49,"baseheight":44,"heightroll":"2d4","averageweight":150,"baseweight":115,"weightroll":"2d6","speed":[7,0,0,0,0]},{"id":"morrinddwarves","name":"Morrind Dwarves","singular":"Morrind Dwarf","description":"The Morrind Dwarves were separated from the other dwarves in the God's War, and marooned on a distant island chain. They built a city in which they could remember their mountain home (called Morrind) and learned to build ocean worthy ships. They took to the sea, trading with whomever they could find in order to supply themselves with whatever they needed. By the time they found the other dwarves, they discovered that they were more comfortable at sea then on land, and unwelcome in the caste-system devised by their kin. Morrind dwarves tend to be less hardy but more dextrous compared to their kin, and are very adept at shipboard movement.","image":false,"traits":[{"name":"Speed","description":"Your base walking speed is 9m. Your speed is not reduced by wearing heavy armor."},{"name":"Tool Proficiency","description":"You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or carpenter's tools."},{"name":"Seacunning","description":"Whenever you make an intelligence (nature) check related to the sea, you are considered proficient in the history skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."},{"name":"Natural Sailor","description":"You are considered proficient and may add double your proficiency bonus to any acrobatics check on board a ship, a survival check made to navigate a sea, or an athletics check made to swim, you also gain proficiency with water based vehicles."}],"averageheight":55,"baseheight":48,"heightroll":"2d6","averageweight":175,"baseweight":125,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"plainsdwarves","name":"Plains Dwarves","singular":"Plains Dwarf","image":false,"description":"Plains Dwarves are the lowest of the low among the dwarves of Curinor. Living primarily on the surface, they are often shunned by other dwarves, however they are more accustomed to interacting with other races, as well as hard manual labor. Nevertheless, they are typically poor and ill-educated. Their life on the open plain has endowed them with a dark tan tone to their skin (particularly compared to the pale deep dwarves).","traits":[{"name":"Speed","description":"Your base walking speed is 9m. Your speed is not reduced by wearing heavy armor."},{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Tool Proficiency","description":"You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools."},{"name":"Stonecunning","description":"Whenever you make an intelligence (history) check related to the origin of stonework, you are considered proficient in the history skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."},{"name":"Dwarven Armor Training","description":"You have proficiency with light and medium armor."}],"averageheight":53,"baseheight":48,"heightroll":"2d4","averageweight":165,"baseweight":130,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"elves","name":"Elves","singular":"Elf","description":"\n\nThe elves were the first race to recover after the climactic God's War. The Gods and Sorceron did not see the mostly feral elves of the ancient world as reliable soldiers and Sylvan, their patron Goddess went to considerable effort to protect her people from harm. However once the war was over, with the other races having highly reduced and scattered populations, the elves finally got around to building cities and expanding. They formed the nation of Eldoran, which remains probably the most powerful nation on the planet besides Malinval. However, the high elves have often proven arrogant, and their internal conflicts with the moon elves finally resulted in civil war. The Moon Elves successfully asserted their independence and formed the nation of Demal Thor.\n\nThe Elves are split into 4 distinct subraces, the city dwelling high elves, the rural wood elves, the nomadic moon elves, and the still feral wild elves.\n\n","traits":[{"name":"Size","description":"Elves range from under 5 to over 6 feet tall and have slender builds. Your size is medium."},{"name":"Keen Senses","description":"You have proficiency in the perception skill."},{"name":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"name":"Trance","description":"Elves don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."},{"name":"Elf Weapon Training","description":"You have proficiency with the longsword, shortsword, shortbow, and longbow."}],"agepoints":{"puberty":18,"sexualmaturity":22,"mentalmaturity":35,"middleage":60,"oldage":80,"averagelifespan":110,"maxage":140},"subraces":[{"id":"highelves","name":"High Elves","singular":"High Elf","image":"https://elthelas-images.herokuapp.com/races/highelf.jpg","description":"\n\nThe High Elves make up the majority of the ruling and merchant class of elves in Eldoran, and are the primary residents in the cities. They are relatively few compared to the Wood Elves who live throughout the countryside, but because most elven merchants are high elves, they tend to be considered the most stereotypical. High Elves are somewhat weaker, but better educated then Wood Elves.\n\n","traits":[{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."},{"name":"Cantrip","description":"You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."},{"name":"Extra Language","description":"You can speak, read, and write one extra language of your choice."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":120,"baseweight":90,"weightroll":"1d4","speed":[9,0,0,0,0]},{"id":"moonelves","name":"Moon Elves","singular":"Moon Elf","image":"https://elthelas-images.herokuapp.com/races/moonelf.jpg","description":"The Moon Elves of Demal Thor are a hardier breed of elves than the High Elves or Wood Elves, but they are gruff loners who generally appear standoffish to those outside of their clan. They live in nomadic clans of between 2 and 3 hundred individuals that wander the plains following the herds.","traits":[{"name":"Speed","description":"Your base walking speed is 10m."},{"name":"Nomad","description":"You have proficiency with the survival skill, and add double your proficiency bonus to Wisdom (survival) checks."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":140,"baseweight":100,"weightroll":"1d6","speed":[10,0,0,0,0]},{"id":"wildelves","name":"Wild Elves","singular":"Wild Elf","image":"https://elthelas-images.herokuapp.com/races/wildelf.jpg","description":"The Wild Elves are as rare as they are reclusive, living in small groups in the deepest jungles of Eldoran and Gnarra. They generally lack education, and are often considered feral and uncivilized by other elves.","traits":[{"name":"Speed","description":"Your base walking speed is 10m."},{"name":"Darkvision","description":"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."},{"name":"Cantrip","description":"You know one cantrip of your choice from the sorcerer spell list. Charisma is your spellcasting ability for it."}],"averageheight":62,"baseheight":53,"heightroll":"2d8","averageweight":115,"baseweight":90,"weightroll":"1d4","speed":[10,0,0,0,0]},{"id":"woodelves","name":"Wood Elves","singular":"Wood Elf","image":"https://elthelas-images.herokuapp.com/races/woodelf.jpg","description":"The Wood Elves of Eldoran are only slightly removed from their feral roots. The Wood Elves are relatively unfamiliar with the learning and education present in much of modern civilization, but they are naturally strong, spending their lives as farmers, woodsmen, and craftsmen.","traits":[{"name":"Speed","description":"Your base walking speed is 10m."},{"name":"Darkvision","description":"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."},{"name":"Mask of the Wild","description":"You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":130,"baseweight":100,"weightroll":"1d4","speed":[10,0,0,0,0]},{"id":"eladrin","name":"Eladrin","singular":"Eladrin","image":"https://elthelas-images.herokuapp.com/races/eladrin.jpg","description":"Elves native to the feywild, it is incredibly rare to see them on the material plane.","traits":[{"name":"Season","description":"Each Eladrin belongs to a particular seasonal court of the Feywild. Choose one season, autumn, winter, spring, or summer. This affects your appearance as well as your Fey Step feature below. You can change your season whenever you finish a long rest."},{"name":"Fey Step","description":"As a bonus action, you can magically teleport up to 9m to an unoccupied space you can see. Once you use this trait, you can't do so again until you finish a short or long rest.\n\nWhen you reach 3rd level, your Fey Step gains an additional effect based on your season; if the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Charisma modifier:\n\n**Autumn.** Immediately after you use Fey Step, up to two creatures of your choice that you can see within 3m of you must succeed on a Wisdom saving throw or be charmed by you for 1 minute, or until you or your companions deal any damage to it.\n\n**Winter.** When you use your Fey Step, one creature of your choice that you can see within 1m of you before you teleport must succeed on a Wisdom saving throw or be frightened of you until the end of your next turn.\n\n**Spring.** When you use your Fey Step, you can touch one willing creature within 1m of you. That creature then teleports instead of you, appearing in an unoccupied space of your choice that you can see within 9m of you.\n\n**Summer.** Immediately after you use your Fey Step, each creature of your choice that you can see within 1m of you takes fire damage equal to your Charisma modifier (minimum of 1 damage)."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":120,"baseweight":90,"weightroll":"1d4","speed":[9,0,0,0,0]}]},{"id":"faelin","name":"Faelin","singular":"Faelin","description":"\n\nFaelin are frail, with light green skin and rainbow colored hair. These fey live in family groups in tree houses above the jungles of Gnarra. They are a stunningly beautiful and agile people, skilled at climbing any surface, and with latent magical talents, but they are physically weak when caught in single combat.\n\nThe Faelin have no written language and thus no recorded history, their reclusive nature means they are mentioned only in passing in the texts of other peoples. However, theological texts claim them as the patron people of the nature goddess Gaian, who brought them to Elthelas to be stewards of the deep forests.\n\n#### Faelin Culture in Elthelas\n\n The Faelin's culture revolves around matrilineal family groups. Often an extended family of up to 30-40 Faelin will live together, with the eldest matriarch given an outsized influence in decision making. Young men who come of age will visit nearby family groups until they meet their future spouse, then joining her family group where they will live for the rest of their lives. Divorce is unheard of among the Faelin. Beyond their family group, the Faelin almost universally dedicate themselves to serving the will of Gaian. Those who leave Gnarra typically do so on some mission or other from the Awakened Goddess. A Faelin treehouse is typically built in the canopy of the tallest trees of the Gnarra jungle, often 100 ft or more off the ground, and forming a massive complex throughout the branches of the tree. It is not unusual for a Faelin treehouse to encompass several thousand square feet of floorspace in a hodgepodge floorplan that grows as the family group does.","traits":[{"name":"Size","description":"Faelin are typically between 2 1/2 and 3 1/2 feet tall, and weight around 50 lbs, your size is Small."},{"name":"Speed","description":"Your base walking speed is 9m, you can also climb up rough surfaces such as trees and rough-hewn walls without making Athletics checks at a speed of 7m."},{"name":"Darkvision","description":" Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray."},{"name":"Natural Acrobat","description":"You have proficiency in the acrobatics skill."},{"name":"Fey","description":"Your fey heritage gives you advantage on saving throws against being charmed, and magic cannot put you to sleep."},{"name":"Trance","description":"Faelin don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."},{"name":"Cantrip","description":"choose one cantrip from the druid spell list. Charisma is your ability modifier for casting this spell."}],"agepoints":{"puberty":24,"sexualmaturity":30,"mentalmaturity":50,"middleage":80,"oldage":110,"averagelifespan":150,"maxage":190},"subraces":[{"id":"default","name":"","description":"","image":"https://elthelas-images.herokuapp.com/races/faelin.png","traits":[],"averageheight":36,"baseheight":31,"heightroll":"2d4","averageweight":40,"baseweight":35,"weightroll":"1","speed":[9,0,7,0,0]}]},{"id":"firbolg","name":"Firbolgs","singular":"Firbolg","description":"\n\nFirbolgs are an exceedingly rare race native to the hidden woods of Eldoran. No one really knows where the Firbolgs come from, though some in Eldoran claim, with hate in their eyes, that they are the twisted offspring of the unholy unions between elves and dwarves. While no modern union of elf and dwarf has ever produced viable children, this theory nevertheless continues to hold weight among the common people of Eldoran. The nature of Firbolgs, however, is so unassuming, and so closely aligned with the highest ideals of Elven society, that few can ever find enough fault in one to get any persecution to stick. Nevertheless, the Firbolgs largely keep to themselves, rarely interacting with others except to pay their taxes and occasionally trade for goods they cannot make themselves. They act as guardians of the deepest groves, a task for which the Elven monarchy has often paid them, but which they would likely do regardless.\n\n","traits":[{"name":"Size","description":"Firbolg are between 7 and 8 feet tall and weigh between 240 and 300 pounds. Your size is Medium."},{"name":"Firbolg Magic","description":"You can cast detect magic and disguise self with this trait, using Wisdom as your spellcasting ability for them. Once you cast either spell, you can't cast it again with this trait until you finish a short or long rest. When you use this version of disguise self, you can seem up to 3 feet shorter than normal, allowing you to more easily blend in with humans and elves."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Hidden Step","description":"As a bonus action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. Once you use this trait, you can't use it again until you finish a short or long rest."},{"name":"Powerful Build","description":"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."},{"name":"Speech of Beast and Leaf","description":"You have the ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."}],"agepoints":{"puberty":24,"sexualmaturity":30,"mentalmaturity":50,"middleage":80,"oldage":110,"averagelifespan":150,"maxage":190},"subraces":[{"id":"default","name":"default","singular":"","image":"https://elthelas-images.herokuapp.com/races/firbolg.jpg","description":"","traits":[],"averageheight":90,"baseheight":76,"heightroll":"4d6","averageweight":270,"baseweight":200,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"genasi","name":"Genasi","singular":"Genasi","description":"","traits":[{"name":"Size","description":"Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium."},{"name":"Darkvision","description":"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."},{"name":"Speed","description":"Your base walking speed is 9m."}],"agepoints":{"puberty":14,"sexualmaturity":17,"mentalmaturity":30,"middleage":45,"oldage":60,"averagelifespan":85,"maxage":110},"subraces":[{"id":"airgenasi","name":"Air Genasi","singular":"Air Genasi","image":"https://elthelas-images.herokuapp.com/races/airgenasi.jpg","description":"","traits":[{"name":"Unending Breath","description":"You can hold your breath indefinitely while you’re not incapacitated."},{"name":"Lightning Resistance","description":"You have resistance to lightning damage"},{"name":"Mingle with the Wind","description":"You know the shocking grasp cantrip. Starting at 3rd level you can cast the feather fall spell with this trait, without requiring a material component. Starting at 5th level, you can also cast the levitate spell once with this trait, requiring no material components. Once you cast feather fall or levitate with this trait you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."}],"averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":140,"baseweight":100,"weightroll":"1d6","speed":[9,0,0,0,0]},{"id":"earthgenasi","name":"Earth Genasi","singular":"Earth Genasi","image":"https://elthelas-images.herokuapp.com/races/earthgenasi.jpg","description":"","traits":[{"name":"Earth Walk","description":"You can move across difficult terrain made of earth or stone without expending extra movement."},{"name":"Merge with Stone","description":"You know the blade ward cantrip.\n\n Starting at 5th level, you can cast the pass without trace spell once with this trait, requiring no material components. Once you cast the spell with this trait you can't cast the spell with it again until you finish a long rest. You can also cast it using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."}],"averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":195,"baseweight":120,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"firegenasi","name":"Fire Genasi","singular":"Fire Genasi","image":"https://elthelas-images.herokuapp.com/races/firegenasi.jpg","description":"","traits":[{"name":"Fire Resistance","description":"You have resistance to fire damage."},{"name":"Reach to the Blaze","description":"You know the produce flame cantrip. Starting at 3rd level, you can cast the burning hands spell with this trait. Starting at 5th level, you can also cast the flame blade spell with this trait, without requiring a material component. Once you cast burning hands or flame blade with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability modifier for these spells when you cast them with this trait (choose when you select this ancestry)."}],"averageheight":67,"baseheight":58,"heightroll":"2d8","averageweight":165,"baseweight":120,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"watergenasi","name":"Water Genasi","singular":"Water Genasi","image":"https://elthelas-images.herokuapp.com/races/watergenasi.jpg","description":"","traits":[{"name":"Acid Resistance","description":"You have resistance to acid damage."},{"name":"Amphibious","description":"You can breathe air and water."},{"name":"Swim","description":"You have a swimming speed of 9m"},{"name":"Call to the Wave","description":"You know the acid splash cantrip. Starting at 3rd level, you can cast the create or destroy water spell with this trait. Starting at 5th level, you can also cast the water walk spell with this trait, without requiring a material component. Once you cast create or destroy water or water walk with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this ancestry)."}],"averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":165,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,9,0]}]},{"id":"gnomes","name":"Gnomes","singular":"Gnome","description":"The gnomes are a small, hardy folk, usually around 3 feet tall, but broad of shoulder with large featured faces (particularly their noses). Unlike halflings, who look like miniature humans with hairy feet, gnomes bodies are thicker and more dominated by the torso (although not to the extent of dwarves). The gnomes of Elthelas are split people. The eastern, Elathian Gnomes live in small reclusive communes within the cities of others, primarily the humans of Dormania, Kandor, and Gerasalim. Once they had a nation of their own, but it was destroyed and burned to the ground by the Emperor Dorman I, all record of it purged from history in the following years. Meanwhile in the west the gnomes of Stagenheim have become masters of technology.","traits":[{"name":"Size","description":"Gnomes range between 3 and 4 feet tall, and weight between 60 and 80 lbs. Your size is Small."},{"name":"Speed","description":"Your base walking speed is 7m"},{"name":"Darkvision","description":"18m"},{"name":"Gnome Cunning","description":"You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."}],"agepoints":{"puberty":10,"sexualmaturity":13,"mentalmaturity":20,"middleage":35,"oldage":50,"averagelifespan":65,"maxage":80},"subraces":[{"id":"elathiangnomes","name":"Elathian Gnomes","singular":"Elathian Gnome","image":"https://elthelas-images.herokuapp.com/races/elathiangnome.jpg","description":"The imperial gnomes are natural tricksters and illusionists, adept at surviving as the bottom rung of society. They tend to prefer city life and the excitement it brings over the quiet countryside. Adventuring is a common way that they find excitement, especially when they are relatively young. Once they do settle down they tend to have large families and live in communal groups of several large extended families.","traits":[{"name":"Natural Illusionist","description":"You know the minor illusion cantrip. Intelligence is your magic ability for it."},{"name":"Speak with Small Beasts","description":"Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts."}],"averageheight":40,"baseheight":35,"heightroll":"2d4","averageweight":55,"baseweight":40,"weightroll":"1d6","speed":[7,0,0,0,0]},{"id":"stagengnomes","name":"Stagen Gnomes","singular":"Stagen Gnome","image":"https://elthelas-images.herokuapp.com/races/stagengnome.jpg","description":"The Gnomes of Stagenheim have a long recorded history, but most of it is esoteric to outsiders, and they have few interactions the other nations beyond the defense of their borders. Not that others are typically interested in their mountain home. The Stagen people are lovers of technology above all else, and more-so, they are creators of technology and magical items without peer. The designs for their fabled airships are jealously guarded, as is the design and construction of their magical crystals, immune to anti-magic effects, and with limitless charges. Those outsiders who know of them often claim that the crystals are the result of the gnomes directly tapping the power of Gods, but such rumors are probably unfounded.","traits":[{"name":"Artificer's Lore","description":"You have advantage on Intelligence checks related to alchemy, magic items, and technological devices."},{"name":"Tinker","description":"You have artisan's tools. Using those tools, you can spend 10 minutes to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours. You can have up to three such devices active at a time. When you create a device, choose one of the following options:\n*   Clockwork Toy: This toy is a clockwork animal or person, such as a frog, mouse, bird, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noise as appropriate to the creature it represents.\n*   Fire Starter: The device produces a miniature flame, which you can use to light something like a candle, torch, or campfire. Using the device requires your action.\n*   Music Box: When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed."},{"name":"Artificer's proficiency","description":"You are proficient with one type of tools of your choice."}],"averageheight":36,"baseheight":31,"heightroll":"2d4","averageweight":60,"baseweight":45,"weightroll":"1d6","speed":[7,0,0,0,0]}]},{"id":"goblins","name":"Goblins","singular":"Goblin","description":"Goblins are small gangly humanoids between 3-3 1/2 feet of height, they have skin ranging in color from an olive brown to a verdant green, smashed upturned noses, and large ears similar to those of elves. Their limbs, particularly their arms, are long compared to their torso, and they often grow large amounts of body hair. Most Goblins in the world are tribal, cruel, and generally bullies wherever they can be. Nevertheless most goblins live their lives as slaves to orcs and hobgoblins. Goblins are unusually strong for their size, having about the strength of the average adult human in a body less than half that size. Their small size and gangly form makes them very nimble as well, nevertheless they are typically considered ugly and have a perpetually sour disposition.\n\n#### Goblin Culture in Elthelas\n\n Goblin's cruel nature is not a true genetic trait, but is rather the result of generations of racial resentment resulting from their perpetual slavery. Goblin's exposed to a life of freedom often are able to avoid that trap. Their cowardice is likewise typically a result of being the smallest creature in the room. Within the slave huts, the goblins have invented their own voodoo religion, and invented forms of music and art that cannot be stolen away by their captors, such as elaborate tatoos and multi-part acapella harmonies. Meanwhile tales of a prophesied goblin savior, who would free their people from their captivity, circulate regularly among the slave huts, despite the best attempts by the orcs to stamp them out.","traits":[{"name":"Size","description":"Goblins are between 3 and 4 feet tall and weight between 70 and 90 lbs. Your size is Small."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"You can see in dim light for 18m in front of you as if it were bright light, and in darkness as if it were dim light. You cannot see color in darkness, only shades of gray."},{"name":"Nimble Escape","description":"The goblin can take the Disengage or Hide action as a bonus action on each of its turns."},{"name":"Fury of the Small","description":"When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature.  The extra damage equals your level.  Once you use this trait, you can't use it again until you finish a short or long rest."}],"agepoints":{"puberty":8,"sexualmaturity":10,"mentalmaturity":15,"middleage":25,"oldage":35,"averagelifespan":50,"maxage":65},"subraces":[{"id":"default","name":"Goblins","image":"https://elthelas-images.herokuapp.com/races/goblin.jpg","description":"","traits":[],"averageheight":44,"baseheight":39,"heightroll":"2d4","averageweight":70,"baseweight":55,"weightroll":"1d6","speed":[30,0,0,0,0]}]},{"id":"goliaths","name":"Goliaths","singular":"Goliath","description":"Goliaths are a tall, gangly, rocky skinned and tribal people. They love sport and competition, and are exceptionally strong and hardy. Their incredible height, strength, and large limbs allow them to wield weapons and perform feats of strength much better than most creatures of a relatively similar size. The Goliaths of Elthelas live in wandering tribes in high mountainous areas. They have never formed any centralized nation, and there have never been enough of them for any existing nation to try to force them under the national banner. The largest concentrations of Goliath tribes live in Stagenheim and Curinor, and they trade regularly with the local gnomes and dwarves respectively.\n\n#### Goliath Culture in Elthelas\n\nThe reclusive goliath tribes live in the highest mountains of the world, where they worship a variety of Gods, particularly Sylvan, Dorun, and Gaian. Perhaps the only people in Elthelas to revere both Sylvan and Dorun, the Goliath's focus on their elemental aspects as the gods of air and earth rather than their more racially tinted domains. Goliaths are taught to always move with care, and to consider their actions carefully, a stance that has kept them safe from repercussions in a world where they are greatly outnumbered everywhere they live. Though they are often viewed as backwards or barbaric by outsiders, typically because their remote mountain homes preclude farming and thus permanent settlement, the Goliaths have a varied and full society. At the highest peaks, the first monastic orders of the world were founded by Goliaths seeking to reach the epitomy of mindfulness. These monastaries likewise have produced some of the world's greatest philosophers.","traits":[{"name":"Size","description":"Goliaths are between 7 and 8 feet tall and weigh between 280 and 340 pounds. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Natural Athlete","description":"You have proficiency in the athletics skill."},{"name":"Stone's Endurance","description":"You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can’t use it again until you finish a short or long rest."},{"name":"Powerful Build","description":"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."},{"name":"Mountain Born","description":"You’re acclimated to high altitude, including elevations above 20,000 feet. You’re also naturally adapted to cold climates, as described in chapter 5 of the Dungeon Master’s Guide."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":75,"maxage":95},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/goliath.jpg","description":"","traits":[],"averageheight":87,"baseheight":76,"heightroll":"2d10","averageweight":330,"baseweight":250,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"halfdwarves","name":"Half-Dwarves","singular":"Half-Dwarf","description":"\n\nThe rare offspring of a dwarf and a human, Half-Dwarves look like thick, powerful somewhat shorter than average humans or very tall, somewhat gangly dwarves. While they are almost unheard of in most lands, there is a small but vibrant community of half-dwarves in the border region between Curinor, Kandor, and Gerasalim. Half-Dwarves are not so insular as other dwarves, but they tend to be ponderous and slow to react.\n\n#### Half-Dwarf Culture\n\nIn dwarven society, half-dwarves find themselves on the very bottom of the caste system, looked down on as even beneath the Plains Dwarves, and given only the dirtiest and least desirable jobs. Meanwhile in human society they are often seen as ugly, or brutish. Thus half-dwarves have often built their own separate communities, some in the style of dwarven holds, and some more in the style of a human town or neighborhood. Half-dwarves tend to have a strong sense of community, where you stand up for your neighbor and pick them up when they are down, and a willingness to do what needs to be done to get by. While many half-dwarves today are truly the product of a union between a full human and a full dwarf, most today are born within the half-dwarf community to half-dwarf parents.","traits":[{"name":"Size","description":"Half-Dwarves stand between 4.5 and 5.5 feet tall and average about 150 lbs. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 7m. Your speed is not reduced by wearing heavy armor."},{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Dwarven Resilience","description":"You have advantage on saving throws against poison, and you have resistance against poison damage."},{"name":"Skill Versatility","description":"You gain proficiency in two skills or tools of your choice."}],"agepoints":{"puberty":14,"sexualmaturity":17,"mentalmaturity":30,"middleage":45,"oldage":60,"averagelifespan":85,"maxage":110},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/halfdwarf.png","description":"","traits":[],"averageheight":59,"baseheight":54,"heightroll":"2d4","averageweight":165,"baseweight":130,"weightroll":"2d6","speed":[7,0,0,0,0]}]},{"id":"halfelves","name":"Half-Elves","singular":"Half-Elf","description":"\n\nHalf-Elves are incredibly rare in most of the world, but in the eastern areas of Eldoran, Demal'Thor, and southwest Gerasalim, where elves and humans have lived side by side for generations, it sometimes seems as if every other person is a half-elf. Half-elves share some of the chiseled facial features of their elven parentage, while retaining some of the versatility and adaptability of their human forbears.\n\n#### Half-Elf Culture in Elthelas\n\nThe Half-Elves of Elthelas achieve different levels of acceptance in different places. In Gerasalim, particularly in the southwest, they are accepted readily by their human neighbors and live as normal members of the community, fully integrated into Gerasaline culture and life. Similarly in Demal'Thor a half-elf is simply another member of the tribe, though often with a missing parent, since their human mother or father rarely is accepted into the tribe. In Eldoran however, half-elves are forced into a lower rung of society, unable to rise to positions of leadership and often treated as outcasts by their peers. Their parents in particular face persecution and accusations of poluting the Fae blood of the elves. Thus they often gravitate towards more rural communities, where life is harder and every able body is needed.","traits":[{"name":"Size","description":"Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m"},{"name":"Darkvision","description":"Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"name":"Skill Versatility","description":"You gain proficiency in two skills of your choice."}],"agepoints":{"puberty":15,"sexualmaturity":19,"mentalmaturity":30,"middleage":50,"oldage":70,"averagelifespan":95,"maxage":120},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/halfelf.jpg","description":"","traits":[],"averageheight":66,"baseheight":57,"heightroll":"2d8","averageweight":155,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"halflings","name":"Halflings","singular":"Halfling","description":"\n\nHalflings are small, gentle folk, who look almost like half-scale models of humans (except for their large hairy feet.) They are found almost everywhere and among every people, although their numbers dwindle as you grow closer to major war zones. They live in the cities, as well as building villages of their own in more remote locations, and try to profit however they can. They enjoy good food and good humor, and few halflings seek adventure. There are two different varieties of halflings in the world, as well the 'tallfellows', descendents of halflings who have interbred with humans or elves. The Lightfoot halflings predominate in Elathia, while the Strongheart Halflings are more common in Atyrea.\n\n#### Halfling Culture in Elthelas\n\nHalflings have never had a country of their own, but at the same time, have never really pushed for one. In most nations they are accepted because they are peaceful people who don't make waves. They love food, hard work, and joyous celebration. Their music and art tends to be simple, but evocative, like the shepherd who sings the haunting melody that brings tears to everyones eyes. Many halflings yearn for adventure, not because they dream of battle, power, wealth, or glory, but for the sheer thrill of the challenge, and the opportunity to appreciate the world far away, before retiring home to their people and taking up the simple life.","traits":[{"name":"Lucky","description":"When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."},{"name":"Brave","description":"You have advantage on saving throws against being frightened."}],"agepoints":{"puberty":13,"sexualmaturity":16,"mentalmaturity":25,"middleage":45,"oldage":60,"averagelifespan":80,"maxage":100},"subraces":[{"id":"lightfoothalfling","name":"Lightfoot Halflings","singular":"Lightfoot Halflings","image":"https://elthelas-images.herokuapp.com/races/lightfoothalfling.jpg","description":"Lightfoot halflings tend to be happy-go-lucky sorts. They are most prevalent on the eastern continent of Elathia, where they live among the humans, elves, and dwarves primarily, with some small communities in orcish cities of the south. Lightfoot halflings are more slight of build compared to their cousins the Strongheart halflings.","traits":[{"name":"Size","description":"Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."},{"name":"Speed","description":"Your base walking speed is 7m."},{"name":"Halfling Nimbleness","description":"You can move through the space of any creature of a size larger than yours."},{"name":"Naturally Stealthy","description":"You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."}],"averageheight":36,"baseheight":31,"heightroll":"2d4","averageweight":40,"baseweight":35,"weightroll":"1","speed":[7,0,0,0,0]},{"id":"stronghearthalfling","name":"Strongheart Halflings","singular":"Strongheart Halfling","image":"https://elthelas-images.herokuapp.com/races/stronghearthalfling.jpg","description":"Strongheart halflings are somewhat more serious of nature than their lightfoot cousins. They live primarily in the western continent of Atyrea. Strongheart halflings lack the unusual luck of their eastern brethren, but are more adept in combat and war.","traits":[{"name":"Size","description":"Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."},{"name":"Speed","description":"Your base walking speed is 7m."},{"name":"Halfling Nimbleness","description":"You can move through the space of any creature of a size larger than yours."},{"name":"Stout Resilience","description":"You have advantage on saving throws against poison, and you have resistance against poison damage."}],"averageheight":36,"baseheight":31,"heightroll":"2d4","averageweight":50,"baseweight":35,"weightroll":"1d6","speed":[7,0,0,0,0]},{"id":"tallfellowhalflings","name":"Tallfellow Halflings","singular":"Tallfellow Halfling","image":"https://elthelas-images.herokuapp.com/races/tallfellowhalfling.jpg","description":"\n\nTallfellow halflings are the descendents of halflings and humans or halflings and elves. Considerably taller than your typical halfling (averaging between 4 1/2 and 5 feet) they are still considerably shorter than humans and most elves. Nevertheless they are able to wield human sized weapons, and ride full size mounts. They also make bigger targets.\n\nTallfellow halflings are rare, but are more common in more cosmopolitan cities. In more rural halfling communities they are often outcast as half-breeds, while in human and elven communities they are looked down on for their small stature.\n\n","traits":[{"name":"Size","description":"Tallfellow Halflings average about 4.5 feet tall and weigh about 80 pounds. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m."}],"averageheight":55,"baseheight":48,"heightroll":"2d6","averageweight":90,"baseweight":70,"weightroll":"1d4","speed":[9,0,0,0,0]}]},{"id":"hobgoblins","name":"Hobgoblins","singular":"Hobgoblin","description":"\n\nThe middle size cousin of the goblinoids, hobgoblins are also the most organized and militaristic. They live largely on the outskirts of Orcish society, and are often used as mercenaries by the Orcs in particularly hot battles. Hobgoblins are more versatile than your typical Orc, and do especially well in massed formations.\n\nLike all goblinoids, hobgoblins tend to be mean, vindictive, and deceitful. Unlike other goblinoids, they also tend to form large powerful bands capable of a real united threat. Hobgoblin mercenary bands can be found all over the world, although they primarily find themselves working for other evil creatures. Their greater versatility as compared to orcs and other goblinoids makes them excellent at filling specialized roles, everything from elite deep penetration teams to scouts to quartermasters.\n\nOutside of militaristic life, hobgoblin society is tribal, and focused on a specific pecking order.\n\n#### Hobgoblin Culture in Elthelas\n\nHobgoblin's are perhaps the least likely race in Elthelas to have never formed their own nation.  Militaristic, organized, and capable, they suffered primarily from their proximity to the much more numerous orcs who have continually dominated the hobgoblins. Nevertheless the hobgoblins have fared better than their smaller cousins, earning places as powerful semi-independent auxiliary units to orc armies, and freedom from slavery.\n\nHobgoblin society is regulated and communal, anyone who does not work towards the good of the tribe or the army is outcast. Spouses and children who are not warriors follow the army, cooking meals, repairing tools, weapons, armor, or whatever else is needed. There is little art among hobgoblins, and music tends to be marching or war songs.","traits":[{"name":"Size","description":"Hobgoblins are between 5 and 6 feet tall and weigh between 150 and 200 pounds. Your size is Medium."},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Speed","description":"Your speed is 9m"},{"name":"Martial Training","description":"You are proficient with two martial weapons of your choice and with light armor."},{"name":"Saving Face","description":"Hobgoblins are careful not to show weakness in front of their allies, for fear of losing status. If you miss with an attack roll or fail an ability check or a saving throw, you can gain a bonus to the roll equal to the number of allies you can see within 9m of you (maximum bonus of +5). Once you use this trait, you can't use it again until you finish a short or long rest."}],"agepoints":{"puberty":8,"sexualmaturity":10,"mentalmaturity":15,"middleage":25,"oldage":35,"averagelifespan":50,"maxage":65},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/hobgoblin.jpg","description":"","traits":[],"averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":165,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"humans","name":"Humans","singular":"Human","description":"\n\nHumans are the most populous race on the planet, but also the most fragmented and spread out. They are known among other races for their adaptability and diversity. Humans have established a number of empires and nations in the history of Elthelas, yet most have fallen apart due to internal corruption, or were destroyed by external forces.\n\nThere are 5 subraces of humans in Elthelas, loosely grouped by the empires to which they belonged. 3 subraces originate from the western continents of Riftlan and Atyrea, and 2 originate from the eastern continent, Elathia, and the sub-continent, Nerim.\n\n","traits":[{"name":"Size","description":"Your size is medium."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":75,"maxage":95},"subraces":[{"id":"deranhumans","name":"Deran Humans","singular":"Deran Human","image":"https://elthelas-images.herokuapp.com/races/deranhuman.jpg","description":"\n\nThe Deran people once had a great empire on the northeast coast of Riftlan. Their capital, Dera, was at the time the most beautiful city in the world, surpassing even Loridesa of Eldoran. then disaster struck in the form of demon invasion. They were saved from annihilation by the Dragon God Bahamut and relocated to a chain of islands off the coast, where the founded the nation of Dera'Dragorim. They have been close allies with dragon kind, particularly metallic dragons, ever since, and to this day they consider demons to be their most hated enemies (with devils not far behind).\n\n","traits":[{"name":"Skills","description":"You gain proficiency in one skill of your choice."},{"name":"Draconic Heritage","description":"You gain resistance to damage of one type: electric, fire, acid, or cold."},{"name":"Demon Hunter","description":"You have advantage on attack rolls, skill checks, and saving throws, made against or relating to fiends."},{"name":"Speed","description":"Your base walking speed is 30 ft."}],"averageheight":69,"baseheight":56,"heightroll":"2d12","averageweight":175,"baseweight":110,"weightroll":"2d4","speed":[30,0,0,0,0]},{"id":"hisruhumans","name":"Hisru Humans","singular":"Hisru Human","image":"https://elthelas-images.herokuapp.com/races/hisruhuman.jpg","description":"The Hisru people live primarily in the nations of Zelfir and Hisru'de'tan, and are the descendents of those humans in ancient times who were enslaved by the Sorceron now imprisoned northwest of Zelfir. Over the course of their slavery they were exposed to repeated compulsion spells, and over time built up a resistence to such effects. This resistence manifests itself in person as an incredible strength of will (what some would just call stubbornness). They also have a great tradition of horsemanship and herding, particularly in Hisru'de'tan where it is their entire way of life.","traits":[{"name":"Skills","description":"You gain proficiency in Animal Handling. You have advantage on Animal Handling checks made to ride or train mounts."},{"name":"Enchantment Resistance","description":"The hisru people, after centuries of living under the effects of enchantment, have developed a natural resistance to magic of the enchantment school. You have advantage on saving throws against enchantment spells."},{"name":"Master's of Magic","description":"The hisru people are unique among humans in their grasp of magic, both divine and arcane. Pick one cantrip from the bard, sorcerer, wizard, druid, or cleric list. You know that cantrip and can cast it at will. Your spellcasting ability for that cantrip depends on the list it came from: Wisdom for druid or cleric, Charisma for Bard or Sorcerer, and Intelligence for Wizard."},{"name":"Speed","description":"Your base walking speed is 30 ft."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":155,"baseweight":100,"weightroll":"2d4","speed":[30,0,0,0,0]},{"id":"imperialhumans","name":"Imperial Humans","singular":"Imperial Human","image":"https://elthelas-images.herokuapp.com/races/imperialhuman.jpg","description":"The imperials are descended from the scattered human nations on the eastern continent that were eventually united under the Dormanian Empire. Although the empire has since split into the nations of Gerasalim, Kandor, and Dormania, movement of people and continuous trade has resulted in a shared culture and heritage. Before the empire, the 15-odd nations that dotted the human portions of the continent each had their own rich and varied history, much of which was lost or destroyed when Emperor Dorman the 1st led his soldiers in conquest. Only the most studied of scholars today knows anything of the history of the varied parts of the empire before then.","traits":[{"name":"Speed","description":"Your base walking speed is 30 ft."},{"name":"Multiculturalists","description":"You learn two additional languages of your choice."},{"name":"Passionate","description":"Choose one skill, you are proficient in that skill and add double your proficiency bonus when making ability checks related to that skill."}],"averageheight":67,"baseheight":56,"heightroll":"2d10","averageweight":165,"baseweight":110,"weightroll":"2d4","speed":[30,0,0,0,0]},{"id":"neranhumans","name":"Neran Humans","singular":"Neran Human","image":"https://elthelas-images.herokuapp.com/races/neranhuman.jpg","description":"The Neran people descend from the old kingdom of Nerim, once a great player in world politics, and the center of Nera's cult. After the magical disaster that left over 90% of the population as roaming, mindless undead, those who remained fled north and west, taking up residence where they could, in lands that now make up the nations of Terron, Arad, Seran, and Shendarel. Their history has left this people changed in oddly contradictory ways. Having been touched by the Death Goddess herself, they are naturally skilled at necromancy, but highly distrustful of those who use such magic. This touch also often makes them sickly. Their history of warfare with the undead has forced their clerics to train more than others in the art of channelling energy to turn undead, and their warriors more skilled at fighting them. Their natural distrust of others makes them poor diplomats, but they also have an unusual ability to recognize and avoid evil.","traits":[{"name":"Speed","description":"Your base walking speed is 35 ft."},{"name":"Darkvision","description":"You can see in the dark as if it were bright light out to 60 ft"},{"name":"Affinity for the Dead","description":"+1 to the saving throw DC of all necromancy spells you cast, you always add your proficiency bonus to the saving throw DC and attack rolls for necromancy spells, even if you do not have your spell focus."},{"name":"Skills","description":"You gain proficiency in one skill of your choice."},{"name":"Will to Live","description":"You have advantage on death saves."},{"name":"Undead Fighting Training","description":"You have advantage on attack rolls, skill checks, and saving throws, made against or relating to the undead."}],"averageheight":65,"baseheight":56,"heightroll":"2d8","averageweight":155,"baseweight":110,"weightroll":"2d4","speed":[35,0,0,0,0]},{"id":"staelichumans","name":"Staelic Humans","singular":"Staelic Human","image":"https://elthelas-images.herokuapp.com/races/staelichuman.jpg","description":"Often forgotten by the rest of the world outside of their immediate neighbors, the Staelic people inhabit the merchant kingdom of Alfadir, as well as their ancestral homeland of Staelia. They are masters of combat in medium and heavy armor, as well as tactical and mounted combat, and have developed an inherent resistence to the cold southern lands of their home. Historically their growth as a people has been checked by the endless war between them and the trolls, giants, and ogres who regularly sweep down from the Gorgro Plateau, and the strange and varied ice monsters that sweep northward from the ice wastes.","traits":[{"name":"Speed","description":"Your base walking speed is 30 ft."},{"name":"Skills","description":"You gain proficiency in one skill of your choice."},{"name":"Cold Resistance","description":"You have resistance to cold damage."},{"name":"Armored Knights","description":"If you are wearing medium or heavy armor your AC improves by 1."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":175,"baseweight":120,"weightroll":"2d4","speed":[30,0,0,0,0]}]},{"id":"kobolds","name":"Kobolds","singular":"Kobold","description":"\n\nPeripherally related to dragons, kobolds, unlike Dragonborn, are not half-breeds but instead genetic misfits. Kobolds, over the years, have evolved to be closer in form and type to the humanoids who live around them than the dragons that originally spawned them. Most have lost the ability to fly, as well as the innate magic otherwise common to dragonkind.\n\nEarly kobolds hid from their dragon elders in the nooks and crannies of the lairs of dragons, building tunnels in which to live, and whole societies that revolved around the scraps left by True Dragons. It became advantageous for kobolds to be small and quiet, and their evolution rapidly reflected this.\n\nAs many True Dragons died off over the millenia, the kobolds took over the old lairs and began sending out hunting parties above ground. However, it quickly became apparent that the small, slight kobolds could not effectively compete against the surface races either, at least not on their terms.\n\nToday Kobolds are capable craftsman and delvers, but lack the resources and technology to forge a society that can stand on its own. They live in mines and caves, and defend them ferociously, working in packs to overwhelm opponents that they could never hope to defeat on their own.","traits":[{"name":"Size","description":"Kobolds are between 2 and 3 feet tall and weigh between 25 and 35 pounds. Your size is Small."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Grovel, Cower, and Beg","description":"As an action on your turn, you can cower pathetically to distract nearby foes. Until the end of your next turn, your allies gain advantage on attack rolls against enemies within 3m of you that can see you. Once you use this trait, you can't use it again until you finish a short or long rest."},{"name":"Pack Tactics","description":"You have advantage on an attack roll against a creature if at least one of your allies is within 1m of the creature and the ally isn't incapacitated."}],"agepoints":{"puberty":7,"sexualmaturity":10,"mentalmaturity":10,"middleage":60,"oldage":80,"averagelifespan":100,"maxage":120},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/kobold.jpg","description":"","traits":[],"averageheight":30,"baseheight":25,"heightroll":"2d4","averageweight":30,"baseweight":25,"weightroll":"1","speed":[9,0,0,0,0]}]},{"id":"leonin","name":"Leonin","singular":"Leonin","description":"The Leonin are unheard of outside of Asura, where they dominate the central plains of the continent. They are a proud, nomadic people who travel in small clans (that they call Prides), following the herds that they hunt for food. Like the other beast walker races of Asura, they are the product of Sorceron experiments in ancient days, a merging of human and lion.","traits":[{"name":"Size","description":"Leonin are typically over 6 feet tall, with some standing over 7 feet. Your size is Medium."},{"name":"Speed","description":"Your walking speed is 9m"},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Claws","description":"Your claws are natural weapons, which you can use to make unarmed strikes. They have the light and finesse properties, and do 1d6 slashing damage."},{"name":"Hunter's Instincts","description":"You have proficiency in one of the following skills of your choice: Athletics, Intimidation, Perception, or Survival."},{"name":"Daunting Roar","description":"As a bonus action, you can let out an especially menacing roar. Creature of your choice within 3m of you that can hear you must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn. The DC of the save equals 8 + your proficiency bonus + your Constitution modifier. Once you use this trait, you can't use it again until you finish a short or long rest."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":75,"maxage":95},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/leonin.jpg","description":"","traits":[],"averageheight":77,"baseheight":66,"heightroll":"2d10","averageweight":255,"baseweight":180,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"lizardfolk","name":"Lizardfolk","singular":"Lizardfolk","description":"\n\nOnly a fool looks at the lizardfolk and sees nothing more than scaly humanoids. Their physical shape notwithstanding, lizardfolk have more in common with iguanas or dragons than they do with humans, dwarves, or elves. Lizardfolk possess an alien and inscrutable mindset, their desires and thoughts driven by a different set of basic principles than those of warm-blooded creatures. Their dismal swamp homes might lie hundreds of miles from the nearest human settlement, but the gap between their way of thinking and that of the smooth-skins is far greater.\n\nDespite their alien outlook, some lizardfolk make an effort to understand and, in their own manner, befriend people of other races. Such lizardfolk make faithful and skilled allies.","traits":[{"name":"Size","description":"Lizardfolk are a little bulkier and taller than humans, and their colorful frills make them appear even larger. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m, and you have a swimming speed of 9m."},{"name":"Bite","description":"Your fanged maw is a natural weapon, which you can use to make unarmed strikes. It has the light and finesse properties, and does 1d6 piercing damage."},{"name":"Cunning Artisan","description":"As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size Small or larger to create one of the following items: a shield, a club, a javelin, or ld4 darts or blowgun needles. To use this trait, you need a blade, such as a dagger, or appropriate artisan's tools, such as leatherworker's tools."},{"name":"Hold Breath","description":"You can hold your breath for up to 15 minutes at a time."},{"name":"Hunter's Lore","description":"You gain proficiency with two of the following skills of your choice: Animal Handling, Nature, Perception, Stealth, and Survival."},{"name":"Natural Armor","description":"You have tough, scaly skin. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."},{"name":"Hungry Jaws","description":"In battle, you can throw yourself into a vicious feeding frenzy. As a bonus action, you can make a special attack with your bite. If the attack hits, it deals its normal damage, and you gain temporary hit points (minimum of 1) equal to your Constitution modifier, and you can't use this trait again until you finish a short or long rest."},{"name":"Languages","description":"Lizardfolk gain draconic as a bonus language."}],"agepoints":{"puberty":7,"sexualmaturity":10,"mentalmaturity":15,"middleage":30,"oldage":45,"averagelifespan":65,"maxage":70},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/lizardfolk.jpg","description":"","traits":[],"averageheight":68,"baseheight":57,"heightroll":"2d10","averageweight":195,"baseweight":120,"weightroll":"2d6","speed":[9,0,0,9,0]}]},{"id":"loxodon","name":"Loxodon","singular":"Loxodon","description":"The half elephant Loxodon are a sedentary, peaceful people. Their lives are generally spent in the pursuit of knowledge. Their cities dot the plains of Asura, where they are often visited by the nomadic Leonin, with whom they do a great deal of trade.","traits":[{"name":"Size","description":"Loxodons stand between 7 and 8 feet tall. Their massive bodies weigh between 300 and 400 pounds. Your size is Medium."},{"name":"Speed","description":"Your walking speed is 9m"},{"name":"Powerful Build","description":"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift"},{"name":"Loxodon Serenity","description":"You have advantage on saving throws against being charmed or frightened"},{"name":"Natural Armor","description":"You have thick, leathery skin. When you aren't wearing armor, your AC is 12 + your Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."},{"name":"Trunk","description":"You can grasp things with your trunk, and you can use it as a snorkel. It has a reach of 2m, and it can lift a number of pounds equal to 5 times your Strength score. You can use it to do the following simple tasks: lift, drop, hold, push, or pull an object or a creature; open or close a door or a container; grapple someone; or make an unarmed strike. Your DM might allow other simple tasks to be aded to that list of options.\n\nYour trunk can't wield weapons or shields or do anything that requires manual precision, such as using tools or magic items or performing the somatic components of a spell."},{"name":"Keen Smell","description":"Thanks to your sensitive trunk, you have advantage on Wisdom (perception), Wisdom (Survival), and Intelligence (Investigation) checks that involve smell."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":100,"maxage":130},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/loxodon.jpg","description":"","traits":[],"averageheight":90,"baseheight":79,"heightroll":"2d10","averageweight":350,"baseweight":295,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"minotaur","name":"Minotaurs","singular":"Minotaur","description":"Half man, half cow, minotaurs are a strong warrior people. Created by the Demon Lord Baphomet in ages long past, those on the material plane who have avoided his demonic influence have shrunk somewhat in size over the generations. On the plains of Asura they build mazelike stone cities. Unlike the more demonic minotaurs that occasionally find their way to the Material, the minotaurs of Asura are strictly herbivorous.","traits":[{"name":"Size","description":"Minotaurs average over 6 feet in height, and have stocky builds. Your size is Medium."},{"name":"Speed","description":"Your walking speed is 9m"},{"name":"Horns","description":"Your horns are natural melee weapons, which you can use to make unarmed strikes. They have the light and finesse properties and do 1d6 piercing damage."},{"name":"Goring Rush","description":"Immediately after you use the Dash action on your turn and move at least 6m, you can make one melee attack with your horns as a bonus action."},{"name":"Hammering Horns","description":"Immediately after you hit a creature with a melee attack as part of the Attack action on your turn, you can use a bonus action to attempt to shove that target with your horns. The target must be no more than one size larger than you and within 1m of you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you push it up to 3m away from you."},{"name":"Imposing Presence","description":"You have proficiency in one of the following skills of your choice: Intimidation or Persuasion."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":75,"maxage":95},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/minotaur.jpg","description":"","traits":[],"averageheight":89,"baseheight":78,"heightroll":"2d10","averageweight":240,"baseweight":175,"weightroll":"2d6","stats":[2,0,1,0,0,0],"speed":[9,0,0,0,0]}]},{"id":"orcs","name":"Orcs","singular":"Orc","description":"\n\nOrcs are primarily characterized by their great strength. They are slightly taller than humans, and much more muscular, with green to mottled brown skin, large noses, a prominent brow-ridge and an underbite featuring tusks. While they are stereotyped as being stupid, evil, and cruel, only the last 2 are usually true. They are also the most populous race in the world save humans, and had they the same room to expand, they probably would have outbred humans long ago.\n\nOrcs are also generally tribal, and orcish society revolves around rule by the strongest. Unfortunately this does not lead to stable societies, but rather warlords who rise and fall, usually within a few years, and who war amongst themselves. These warlords are generally High Orcs, a breed that has long separated itself from their kin, favoring skill in leadership or sorcerous magic over pure brute strength. Far to the south, in Nerim, the Sand Orc tribes roam.\n\n#### Orc Culture in Elthelas\n\nThe Orcs in Elthelas are far more organized and varied than orcs in most settings. Their tendency towards chaos has been tempered by a natural respect for strength and a natural willingness to follow those who are stronger than they. This enables strong and ambitious warlords who can persuade others to follow them to build up strength and power. Their vast territory of fertile land also means that they developed farming, culture, and civilization right alongside the other nations of the world. While they lack a natural prediliction towards feats of the mind, building a great building can be seen as a sign of strength just as much as personal combat. Their numerical superiority over their early neighbors, the goblinoids and gnolls, enabled them to dominate these other races, enslaving them or otherwise manipulating them towards their own ends.\n\nOrc culture is focused on achieving personal strength and skill. Every town of size has regular gladiatorial tournaments, where warriors, both free and slave, compete against each other. Success in the tournaments is considered an excellent way to attract a mate, for both men and women, and comes with substantial prizes that can help to jumpstart a new household. Farming among the orcs focuses on the raising of livestock, particularly pigs, chickens, or other animals that require little feed to raise to adulthood.\n\nMedicine and magic among the orcs is most often practiced by witch doctors living on the fringes of society, or elites who use their sorcery to outwit their peers.  The church of Mat'raktha always has a firm hand in the order of society, intervening when clan wars become hot enough to threaten the cohesion of orcish society, and demanding the proper rights from any warlord who wishes to sit on the council in Marinval. A cleric may be consulted by both sides in a clan dispute before hostilities progress to blood, and that cleric may suggest alternative remedies to all-out war, such as a gladiatorial bout between clan champions, or a peace settlement to prevent a larger clan from wiping out a weaker one.","traits":[{"name":"Size","description":"Orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Menacing","description":"You gain proficiency in the intimidation skill."},{"name":"Aggressive","description":"As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started."}],"agepoints":{"puberty":9,"sexualmaturity":11,"mentalmaturity":20,"middleage":30,"oldage":40,"averagelifespan":55,"maxage":70},"subraces":[{"id":"gruntorcs","name":"Grunt Orcs","singular":"Grunt Orc","image":"https://elthelas-images.herokuapp.com/races/gruntorc.jpg","description":"The grunt orcs have never really been able to rule themselves in any organized or permanent manner. When they haven't been ruled by outsiders or their high orc brethren, they have generally been little more than tribal, ruled by whatever warlord happened to be the strongest. Grunt Orcs are the strongest of the orc breeds, and make up the bulk of the orc armies. When not at war they often compete in feats of strength, including blood sports.","traits":[{"name":"Savage Attacks","description":"When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."},{"name":"Blood Scent","description":"When an opponent is reduced to half or fewer hitpoints, the scent of the blood can send you into a sort of frenzy. Attacks against foes with half or fewer hit points do an extra 2 damage."}],"averageheight":75,"baseheight":62,"heightroll":"2d12","averageweight":265,"baseweight":175,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"highorcs","name":"High Orcs","singular":"High Orc","image":"https://elthelas-images.herokuapp.com/races/highorc.jpg","description":"The high orcs are less strong, and slightly smaller than grunt orcs, and more than a bit lazy, but they make up for it with greater social skills and diplomatic nature. They tend to be the rulers in Orc society, playing others off each other to rise to the top in orcish politics, befriending the strongest grunt orcs, and using them as champions as they rise to the top of society. Many of the high orcs live apart from their kin, on the island nation of Olda, where they keep vast hordes of slaves to do their bidding, watched over by highly paid mercenaries.","traits":[{"name":"Commanding Presence","description":"You have been born and bred for leadership. You have advantage on all Charisma (Persuasion) and Charisma (Intimidation) checks."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":215,"baseweight":140,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"sandorcs","name":"Sand Orcs","singular":"Sand Orc","image":"https://elthelas-images.herokuapp.com/races/sandorc.jpg","description":"\n\nThe Sand Orcs are an offshoot of Grunt Orcs that have taken up a nomadic lifestyle in the deserts of Nerim. They are a hardy people, and excellent riders, making use of powerful riding lizards for travel. They move from oasis to oasis in wandering tribes, and have little contact with the outside world.\n\nSand Orcs are leaner compared to their Grunt Orc and High Orc cousins, and their skin more brown and tan than green.\n\n","traits":[{"name":"Savage Attacks","description":"When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."},{"name":"Fire Resistance","description":"You have resistance to fire damage."}],"averageheight":73,"baseheight":60,"heightroll":"2d12","averageweight":231,"baseweight":140,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"sorceronblooded","name":"Sorceron Blooded","singular":"Sorceron Blooded","description":"\n\nthe Sorceron were a race of Godly servants that served all Gods. Originally serving the Gods in creating the world Elthelas and the many interconnecting planes of existence in an age long since forgotten. They were masters of magic, the inventors of the arcane arts. In the Gods War they served on both sides, and were the primary combatants, and while most of them died in that conflict, some few survivors retreating to other planes of existence besides the material with the Gods. Yet, before that age many Sorceron interbred with the races of Elthelas, and every now and then a child will be born with more Sorceron blood than typical. These unusual children show a rare talent for magic and are gifted with intelligence and charisma far beyond that of their kin.\n\nThe Sorceron Blooded look very similar to a normal human, but their blood typically betrays them when they are young, with their gift for magic blooming almost as soon as they can talk.","traits":[{"name":"Size","description":"The Sorceron-blooded are generally similar to elves or humans in height, weight, and build. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Natural Spellcaster","description":"Choose one cantrip from the sorcerer or wizard spell list, and one first level spell from the same list. You can cast this cantrip at will, and the first level spell once per short rest without expending a spell slot. The spellcasting ability for these spells depends on the list you chose it from. Charisma for a sorcerer spell, or intelligence for a wizard spell."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":80,"oldage":100,"averagelifespan":110,"maxage":140},"subraces":[{"id":"humanborn","name":"Human Born","singular":"Human Born","description":"Sorceron Blooded born of humans tend towards more versatility than many others. Often rising to positions of leadership and influence.","traits":[{"name":"Versatility","description":"Gain proficiency in two skills of your choice."}],"image":"https://elthelas-images.herokuapp.com/races/sorceronblooded.jpg","averageheight":69,"baseheight":56,"heightroll":"2d12","averageweight":175,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"elfborn","name":"Elf Born","singular":"Elf Born","description":"Sorceron Blooded born of elves retain much of the fey grace of their parents, but with a spellcasting ability beyond even most elves.","traits":[{"name":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"name":"Trance","description":"Elves don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."},{"name":"Darkvision","description":"Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."}],"image":"https://elthelas-images.herokuapp.com/races/elfborn.jpg","averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":140,"baseweight":100,"weightroll":"1d6","speed":[9,0,0,0,0]},{"id":"dwarfborn","name":"Dwarf Born","singular":"Dwarf Born","description":"Sorceron Blooded born of dwarves are hardy folk, with a keen intellect, often discernible from other dwarves only by their unnatural gift with magic.","traits":[{"name":"Dwarven Resilience","description":"You have advantage on saving throws against poison, and you have resistance against poison damage."},{"name":"Darkvision","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Dwarven Combat Training","description":"You have proficiency with the battleaxe, handaxe, throwing hammer, and warhammer."}],"image":"https://elthelas-images.herokuapp.com/races/dwarfborn.jpg","averageheight":47,"baseheight":42,"heightroll":"2d4","averageweight":135,"baseweight":100,"weightroll":"2d6","speed":[9,0,0,0,0]},{"id":"orcborn","name":"Orc Born","singular":"Orc Born","description":"Sorceron Blooded born of orcs are growing increasingly common since the awakening of the Prince of Fiends, as the Prince enjoys his carnal pleasures, and many an orc woman dreams of the prestige of bearing a child of the prince. As the first generation of orc born sorceron blooded has reached maturity they have been recruited into the highest echelons of orc society, serving as blackguards, warlords, and mages in service of the Prince.","traits":[{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Menacing","description":"You gain proficiency in the intimidation skill."},{"name":"Aggressive","description":"As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started."}],"averageheight":69,"baseheight":58,"heightroll":"2d10","averageweight":215,"baseweight":140,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"tabaxi","name":"Tabaxi","singular":"Tabaxi","description":"\n\nThe Tabaxi are a catlike people that wander the world in small bands, often stopping in small villages to trade. They rarely if ever have permanent homes, and largely keep to themselves in their wandering. They can be found in most any nation, but actively tracking one down can be incredibly difficult. It is rare that a band of Tabaxi, typically no more than 10 to 20 in number including children, will stay in a particular town longer than a few days. Tabaxi who come of age will typically leave the band they were born in, wandering alone until they either find a new band to marry in to, or meet up with other young wanderer on their own and form a new band.\n\n#### Tabaxi Culture in Elthelas\n\nTabaxi love to tell stories, play music, and dance. Most nights in a Tabaxi camp are spent on these pursuits. Tabaxi bands are typically pacifists, as most nations regard the Tabaxi as a nation without a state, and may consider any violence perpetrated by a Tabaxi as an attack by all Tabaxi against their people, often leading to violent retribution. This typically leaves them incredibly careful to avoid conflicts with others, and if a trade relationship with a particular town turns sour, the Tabaxi will simply leave and not return. It also means they are susceptible to bandits and outlaws, who often claim in court that the Tabaxi attacked *them*, and they simply defended themselves. Tabaxi bands thus generally avoid areas of great turmoil.\n\nMeanwhile, in distant Asura, their still exist cities of Tabaxi in the eastern forests of that land.","traits":[{"name":"Size","description":"Tabaxi are taller on average than humans and relatively slender. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"You have a cat's keen senses, especially in the dark. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Feline Agility","description":"Your reflexes and agility allow you to move with a burst of speed. When you move on your turnin combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."},{"name":"Cat's Claws","description":"Because of your claws, you have a climbing speed of 6m. In addition, your claws are natural weapons, which you can use to make unarmed strikes. They have the light and finesse properties, and do 1d6 slashing damage."},{"name":"Cat's Talent","description":"You have proficiency in the Perception and Stealth skills."}],"agepoints":{"puberty":12,"sexualmaturity":15,"mentalmaturity":25,"middleage":40,"oldage":55,"averagelifespan":75,"maxage":95},"subraces":[{"id":"default","name":"default","singular":"","image":"https://elthelas-images.herokuapp.com/races/tabaxi.jpg","description":"","traits":[],"averageheight":74,"baseheight":61,"heightroll":"2d12","averageweight":175,"baseweight":110,"weightroll":"2d4","speed":[9,0,6,0,0]}]},{"id":"tieflings","name":"Tieflings","singular":"Tiefling","description":"\n\nTieflings are the descendents of humans that have mated with demons or devils, they bear the mark of this touch in their appearance and nature. They often bear demonic traits, such as horns, forked tails or tongue, or reddish skin or eyes. They also tend towards evil more than the average person, and although this is far from a given, it is common enough that the distrust that follows them everywhere is justified.\n\nTieflings are not quite as rare as Aasimar (given demons' proclivity for lust), although they are still rare enough to cause a stir in any town they show up in, especially given their heritage. Tieflings are more common in the west, where demons, and demon attacks, are also more common. Tieflings of a good or neutral persuasion can usually find shelter in Dera'Dragorim or Zelfir, the second as a service to Amathera as a pity of their natural plight, and the first in recognition of a shared victimization at the hands of aggressive demon invaders.\n\n#### Tiefling Culture in Elthelas\n\nThe distrust that tieflings face at the hands of common folk, combined with the chaos in their blood, leads many to take up life as an adventurer or wanderer. Some find their way to the tiefling enclaves in more friendly cities, while many find themselves taken advantage of by evil lords who give them opportunities where no one else would. The largest population of settled Tiefling's in Elthelas is in the Deran city of Vasha. There it is common enough to see someone with horns or a forked tongue walking down the street that few pay it any mind. The Tiefling's there have found a niche working as alchemists, smelters and smiths, as well as other jobs where their natural resistances give them an edge over an ordinary human. These Tieflings are well integrated into Dera'Dragoran society.\n\nElsewhere in the world tieflings have evolved their own counter cultures. For example, In Malinval Tieflings are subject only to the church of Mat'raktha, and have a near monopoly on intercity trade, since they are the only race not subject to the warlords or mandatory slavery.","traits":[{"name":"Darkvision","description":"Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."},{"name":"Hellish Resistance","description":"You have resistance to fire damage."}],"agepoints":{"puberty":8,"sexualmaturity":10,"mentalmaturity":15,"middleage":25,"oldage":35,"averagelifespan":50,"maxage":65},"subraces":[{"id":"humanborntiefling","name":"Human Demon Tiefling","singular":"Human Demon Tiefling","image":"https://elthelas-images.herokuapp.com/races/tiefling.jpg","description":"Most tieflings are the descendents of humans and demons, and the unions are rarely consensual, though sometimes they are several generations back. These children are often outcasts. Reminders to their families of the horrible things in their pasts, and feared as carrying the disposition of their demonic progenitors.","traits":[{"name":"Size","description":"Tieflings have about the same size and build as humans. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Infernal Legacy","description":"You know the thaumatergy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per long rest as a 2nd-level spell. Once you reach 5th level you can cast the darkness spell once per long rest. Charisma is your spellcasting ability for these spells."}],"averageheight":66,"baseheight":57,"heightroll":"2d8","averageweight":155,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"feyrisubrace","name":"Fey'ri","singular":"Fey'ri","image":"https://elthelas-images.herokuapp.com/races/feyri.jpg","description":"At the time of the demon invasion, Dera was home to the largest elven community outside of Eldoran. Unfortunately for these elves, their community was among the first attacked by the demons. Throughout most of the world it is believed that all of the elves were slaughtered, however a small percentage were kept as slaves, serving the whims of their demon masters, and subject to their lusts. Many of them died birthing the demonic offspring of these unions, and those who did not were rendered infertile. When Bahamut turned his wrath on the demons, forcing them to flee, they left their slaves, and their offspring, behind. These elves, trapped between an angry God and demon slave-masters, hid in the sewers of the ruined city, where they have lived since, expanding them as they had need of space. Over time they have intermarried and the demonic blood has spread and become diluted throughout their people. Today they rarely leave their underground home, but occasionally one will leave to travel the world. They are typically mistaken for a pointy eared , skinny and winged tiefling, and they rarely find a welcoming reception. Most return home.\n\nFey'ri have a naturally evil disposition, and the society as a whole has largely given into the call of their blood. The underworks of Dera where they live is a harsh environment where only the strongest are permitted to survive.\n\n","traits":[{"name":"Speed","description":"Your base walking speed is 9m. You also have a flying speed of 9m."},{"name":"Fey Ancestry","description":"You have advantage on saving throws against being charmed, and magic can't put you to sleep."},{"name":"Trance","description":"Fey'ri don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."}],"averageheight":65,"baseheight":54,"heightroll":"2d10","averageweight":130,"baseweight":100,"weightroll":"1d4","speed":[9,9,0,0,0]},{"id":"deviltiefling","name":"Human Devil Tiefling","singular":"Human Devil Tiefling","description":"The most rare of the tieflings are those born of devils. Unlike demons these unions are typically at least nominally consensual, with the human parent often trading sex for something else. Some of the these are the children of incubi and sucubi, where the parent has traded their soul for carnal pleasures, while others are the children of other devils who have given some other material benefit to the human parent in trade for their own pleasure. Nevertheless, the children are still rarely wanted, and just as reviled in the community as other tieflings.","traits":[{"name":"Devil's Tongue","description":"You know the vicious mockery cantrip. When you reach 3rd level, you can cast the charm person spell as a 2nd-level spell once with this trait. When you reach 5th level , you can cast the enthrall spell once with this trait. You must finish a long rest to cast these spells once again with this trait. Intelligence is your spellcasting ability for them."}],"averageheight":66,"baseheight":57,"heightroll":"2d8","averageweight":155,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]},{"id":"tanarukk","name":"Tanarukk","singular":"Tanarukk","image":"https://elthelas-images.herokuapp.com/races/tanarukk.jpg","description":"Among the orcs it is considered an honor to be chosen by a fiend for breeding purposes. The children of these unions are the wild and unruly Tanarukk. Their fiendish blood accentuates their already aggressive nature, making them unpredictable but powerful weapons of war, but even in orc society they are treated as creatures to be feared rather than helped.","traits":[{"name":"Menacing","description":"You gain proficiency in the intimidation skill."},{"name":"Aggressive","description":"As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started."}],"averageheight":78,"baseheight":65,"heightroll":"2d12","averageweight":290,"baseweight":200,"weightroll":"2d6","speed":[9,0,0,0,0]}]},{"id":"tortle","name":"Tortles","singular":"Tortle","description":"The simple, peaceful, half-turtle Tortle people live in small cities along the coasts of Asura. They are the most welcoming of outsiders of all of the beast races of Asura, willingly accepting traders into their ports, though there are not many.","traits":[{"name":"Size","description":"Tortle adults stand 5 to 6 feet tall and average 450 pounds. Their shells account for roughly one-third of their weight. Your size is Medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Claws","description":"Your claws are natural weapons, which you can use to make unarmed strikes. They have the light and finesse properties, and deal 1d6 slashing damage."},{"name":"Hold Breath","description":"You can hold your breath for up to 1 hour at a time. Tortles aren't natural swimmers, but they can remain underwater for some time before needing to come up for air."},{"name":"Natural Armor","description":"Due to your shell and the shape of your body, you are ill-suited to wearing armor. Your shell provides ample protection, however; it gives you a base AC of 17 (your Dexterity modifier doesn't affect this number). You gain no benefit from wearing armor, but if you are using a shield, you can apply the shield's bonus as normal."},{"name":"Shell Defense","description":"You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to AC, and have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell."},{"name":"Survival Instinct","description":"You gain proficiency in the Survival skill. Tortles have finely honed survival instincts."}],"agepoints":{"puberty":10,"sexualmaturity":12,"mentalmaturity":15,"middleage":25,"oldage":35,"averagelifespan":50,"maxage":70},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/tortle.jpg","description":"","traits":[],"averageheight":66,"baseheight":57,"heightroll":"2d8","averageweight":450,"baseweight":335,"weightroll":"2d12","speed":[9,0,0,0,0]}]},{"id":"trollkin","name":"Trollkin","singular":"Trollkin","description":"\n\nOft described by those who meet them as 'damn ugly, but damn efficient killers', trollkin are gangly, thick chested humanoids with disgustingly angular faces, long pointed noses, and grey-green to brown skin. Strong and hardy, they are somewhat larger than an orc, and have clawed hands.\n\nThe trollkin were originally created during the dawning years of the world as a magical experiment in interracial breeding. The end result was something akin to a fast maturing, highly stunted troll, and was cast out by its Sorceron creators as a failure and released into the wild. Yet the trollkin's improved intellect in comparison to their troll progenitors, ability to breed quickly, and fit into other societies (with a bit of care and luck), enabled the Trollkin to thrive where trolls were hunted and killed. During the God's War, the trollkin were conscripted as foot soldiers into the armies of every side, and by the end of the war, only a few hundred remained alive. Nevertheless, these few hundred managed to find a land of their own on a large island that they named Degak'Ta, and from there they have spread out to various lands once again.\n\nThe trollkin, unlike every other major race on Elthelas, are naturally antitheistic. They generally feel the Gods betrayed their people in the God's War, using them as pawns, sending them to their deaths, and in the end, providing no reward. Politically, they tend to discount charisma as useless, rewarding strength and cunning. In their homeland of Degak'Ta they are ruled by the military, lead by the Grand Marshal, who gains office through contests of strength and tactics. In foreign affairs they are generally aloof, not taking sides in conflicts as a people, and instead hire out individually or in small groups as mercenaries to either or any side, and they are highly valued as such.\n\n","traits":[{"name":"Size","description":"Trollkin range from 7 feet to 8.5 feet tall, and typically weigh between 250 and 350 lbs. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Hard to Kill","description":"You have advantage on death saves."},{"name":"Face of a Troll","description":"Trollkin have disadvantage on any charisma check except intimidation checks made to influence an NPC who is not a Trollkin or Troll."},{"name":"Claws","description":"Your claws are natural weapons, which you can use to make unarmed strikes. They have the light and finesse properties, and deal 1d6 slashing damage."},{"name":"Brute","description":"A melee weapon deals one extra die of its damage when the trollkin hits with it."}],"agepoints":{"puberty":21,"sexualmaturity":26,"mentalmaturity":45,"middleage":70,"oldage":95,"averagelifespan":130,"maxage":165},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/trollkin.png","description":"","traits":[],"averageheight":84,"baseheight":73,"heightroll":"2d10","averageweight":275,"baseweight":220,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"yuantipureblood","name":"Yuan-ti Pureblood","singular":"Yuan-ti Pureblood","description":"From the jungles of Ssitsu occasionally emerges one of the Yuan-ti's spies. The Purebloods sit on the bottom of Yuan-ti society, but are useful for their ability to appear human. These spies spread out throughout Elthelas, sending information back to Ssitsu to further the interests of the Yuan-ti.","traits":[{"name":"Size","description":"Purebloods match humans in average size and weight. Your size is medium."},{"name":"Speed","description":"Your base walking speed is 9m."},{"name":"Darkvision","description":"You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."},{"name":"Innate Spellcasting","description":"You know the poison spray cantrip. You can cast animal friendship an unlimited number of times with this trait, but you can only target snakes with it. Starting at 3rd level, you can also cast suggestion with this trait. Once you cast it, you can't do so again until you finish a long rest. Charisma is your spellcasting ability for these spells."},{"name":"Magic Resistance","description":"You have advantage on saving throws against spells and other magical effects."},{"name":"Poison Immunity","description":"You are immune to poison damage and the poisoned condition."}],"agepoints":{"puberty":9,"sexualmaturity":12,"mentalmaturity":14,"middleage":35,"oldage":60,"averagelifespan":80,"maxage":120},"subraces":[{"id":"default","name":"","image":"https://elthelas-images.herokuapp.com/races/yuan-ti-pureblood.png","description":"","traits":[],"averageheight":69,"baseheight":56,"heightroll":"2d12","averageweight":175,"baseweight":110,"weightroll":"2d4","speed":[9,0,0,0,0]}]},{"id":"custom","name":"Custom","singular":"Custom","description":"This is here in case your DM allows you to play a custom race or subrace or one from a sourcebook that is not by default included in the setting. Add your own features.","traits":[],"agepoints":{"puberty":0,"sexualmaturity":0,"mentalmaturity":0,"middleage":0,"oldage":0,"averagelifespan":0,"maxage":0},"subraces":[{"id":"default","name":"","image":"","description":"","traits":[],"averageheight":0,"baseheight":0,"heightroll":"1d4","averageweight":0,"baseweight":0,"weightroll":"1d4","speed":[0,0,0,0,0]}]}]}