{"model":"BackgroundV2","documents":[{"name":"Acolyte","description":"You have spent your life in the service o f a temple to a specific god or pantheon o f gods. You act as an intermediary between the realm o f the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence o f the divine. You are not necessarily a cleric-performing sacred rites is not the same thing as channeling divine power.\n\nChoose a god, a pantheon of gods, or some other quasi-divine being, and work with your DM to detail the nature o f your religious service. Were you a lesser functionary in a temple, raised from childhood to assist the priests in the sacred rites? Or were you a high priest who suddenly experienced a call to serve your god in a different way? Perhaps you were the leader o f a small cult outside of any established temple structure, or even an occult group that served a fiendish master that you now deny.","skills":["Insight","Religion"],"tools":["Calligrapher's supplies"],"languages":1,"equipment":"Book (Prayers), Calligrapher's supplies, holy symbol, parchment (10 sheets) robe, 3 gp","equipmentItems":[],"feature":"Magic Initiate"},{"name":"Artisan","description":"You apprenticed to a skilled artisan as a child.","skills":["Insight","Persuasion"],"tools":["One type of artisan's tools"],"languages":1,"equipment":"Abacus, A set of artisan’s tools (one of your choice), merchant's scales, 2 pouches, a set of traveler’s clothes, 25 gp","feature":"Crafter"},{"name":"Charlatan","description":"You have always had a way with people. You know what makes them tick, you can tease out their hearts' desires after a few minutes o f conversation, and with a few leading questions you can read them like they were children's books. It’s a useful talent, and one that you’re perfectly willing to use for your advantage.\n\nYou know what people want and you deliver, or rather, you promise to deliver. Common sense should steer people away from things that sound too good to be true, but common sense seems to be in short supply when you’re around. The bottle o f pink-colored liquid will surely cure that unseemly rash, this ointment—nothing more than a bit of fat with a sprinkle of silver dust—can restore youth and vigor, and there’s a bridge in the city that just happens to be for sale. These marvels sound implausible, but you make them sound like the real deal.","skills":["Deception","Slight of Hand"],"tools":["Forgery Kit"],"languages":1,"equipment":"Costume, Fine Clothes, Forgery Kit, 15 gp","feature":"Skilled"},{"name":"Courtier","description":"In your earlier days, you were a personage of some significance in a noble court or a bureaucratic organization. You might or might not come from an upper-class family; your talents, rather than the circumstances of your birth, could have secured you this position.","skills":["Insight","Persuasion"],"tools":["One musical instrument"],"languages":1,"equipment":"Fine clothes, musical instrument, perfume, steel mirror, 18 gp","feature":"Musician"},{"name":"Criminal","description":"You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You’re far closer than most people to the world o f murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations o f society.","skills":["Deception","Stealth"],"tools":["thieves' tools"],"languages":1,"equipment":"A crowbar, dagger (2), pouch (2), thieves' tools, traveler's clothes, 16 gp","feature":"Alert"},{"name":"Cultist","description":"You scarcely recall what drove you into the service of the otherworldly being. Those memories were blotted out long ago by recurrent dreams of midnight gatherings round the obsidian pillar in the glade. By the light of each waning moon, the hierophants instructed you in the being's creed nad the rudiments of the arcane arts. When you came of age, you were ordered to blend in among the nonbelievers and await whatever mission the Great One has in store for you.","skills":["Arcana","Religion"],"tools":["Disguise Kit"],"languages":1,"equipment":"Bell, lamp, common clothes, robe, dagger, disguise kit, 19 gp","feature":"Magic Initiate"},{"name":"Custom Background","description":"Customize a background to fit your character.","skills":["Any two skills of your choice"],"tools":["One set of tools, a musical instrument, or a gaming set"],"languages":1,"equipment":"50 gp worth of starting equipment","feature":"One feat available to 1st level characters for which you qualify."},{"name":"Entertainer","description":"You thrive in front of an audience. You know how to entrance them, entertain them, and even inspire them. Your poetics can stir the hearts o f those who hear you, awakening grief or joy, laughter or anger. Your music raises their spirits or captures their sorrow. Your dance steps captivate, your humor cuts to the quick. Whatever techniques you use, your art is your life.","skills":["Acrobatics","Performance"],"tools":["one type of musical instrument"],"languages":1,"equipment":"2 Costumes, Musical Instrument, Perfume, Steel Mirror, Traveler's Clothes, 8 gp.","feature":"Musician"},{"name":"Farmer","description":"You grew up close to the land. Years tending animals and cultivating the earth rewarded you with patience and good health. You have a keen appreciation for nature's bounty alongside a healthy respect for nature's wrath.","skills":["Animal Handling","Nature"],"tools":["Carpenter's tools"],"languages":1,"equipment":"Carpenter's tools, sickle, healer's kit, traveler's clothes, iron pot, shovel, 23 gp","feature":"Hardy"},{"name":"Gladiator","description":"A gladiator is as much an entertainer as any minstrel or circus performer, trained to make the arts of combat into a spectacle the crowd can enjoy. This kind of flashy combat is your entertainer routine, though you might also have some skills as a tumbler or actor. Using your By Popular Demand feature, you can find a place to perform in any place that features combat for entertainment—perhaps a gladiatorial arena or secret pit fighting club. You can replace the musical instrument in your equipment package with an inexpensive but unusual weapon, such as a trident or net.","skills":["Athletics","Performance"],"tools":["Smith's tools"],"languages":1,"equipment":"Chain, Smith's tools, costume, traveler's clothes, healer's kit, 6 javelins, 15 gp","feature":"Savage Attacker"},{"name":"Guard","description":"You have served the community where you grew up, standing as its first line of defense against crime. You aren't a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe.\n\nEven if you're not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own constables and police forces, and even smaller communities have sheriffs and bailiffs who stand ready to protect their community.","skills":["Athletics","Insight"],"tools":["Gaming Set of your choice"],"languages":1,"equipment":"20 Crossbow bolts, gaming set, hooded lantern, light crossbow, manacles, quiver, spear, traveler's clothes, 12 gp","feature":"Alert"},{"name":"Guide","description":"You came of age in the outdoors, far from settled lands. Your home? Anywhere you chose to unfurl your bedroll. There are wonders on the frontier-strange monsters, prestine forests, and winding rivers-and you learned to fend for yourself as you explored them.","skills":["Stealth","Survival"],"tools":["Cartographer's tools"],"languages":1,"equipment":"Arrow (20), bedroll, cartographer's tools, fishing tackle, quiver, shortbow, tent, traveler's clothes, 2 gp.","feature":"Alert"},{"name":"Hermit","description":"You lived in seclusion—either in a sheltered community such as a monastery, or entirely alone—for a formative part of your life. In your time apart from the clamor of society, you found quiet, solitude, and perhaps some of the answers you were looking for.","skills":["Medicine","Religion"],"tools":["Herbalism Kit"],"languages":1,"equipment":"Bedroll, Book (Philosophy), Fishing Tackle, Herbalism Kit, Lamp, Oil (3 flasks), Quarterstaff, Traveler's Clothes, 15 gp","feature":"Healer"},{"name":"Investigator","description":"You have served the community where you grew up, standing as its first line of defense against crime. You aren't a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe.\n\nEven if you're not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own constables and police forces, and even smaller communities have sheriffs and bailiffs who stand ready to protect their community.\n\nRarer than watch or patrol members are a community's investigators, who are responsible for solving crimes after the fact. Though such folk are seldom found in rural areas, nearly every settlement of decent size has at least one or two watch members who have the skill to investigate crime scenes and track down criminals.","skills":["Investigation","Insight"],"tools":["Gaming Set"],"languages":1,"equipment":"20 Crossbow bolts, gaming set, hooded lantern, light crossbow, manacles, quiver, spear, traveler's clothes, 12 gp","feature":"Alert"},{"name":"Knight","description":"You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and w ields significant political influence. You might be a pampered aristocrat unfamiliar with work or discomfort, a former merchant just elevated to the nobility, or a disinherited scoundrel with a disproportionate sense of entitlement. Or you could be an honest, hard-working landowner who cares deeply about the people who live and work on your land, keenly aware of your responsibility to them.\n\nWork with your DM to come up with an appropriate title and determine how much authority that title carries. A noble title doesn’t stand on its own—it’s connected to an entire family, and whatever title you hold, you will pass it down to your own children. Not only do you need to determine your noble title, but you should also work with the DM to describe your family and their influence on you.\n\nIs your family old and established, or was your title only recently bestowed? How much influence do they wield, and over what area? What kind of reputation does your family have among the other aristocrats of the region? How do the common people regard them? What’s your position in the family? Are you the heir to the head o f the family? Have you already inherited the title? How do you feel about that responsibility? Or are you so far down the line of inheritance that no one cares what you do, as long as you don’t embarrass the family? How does the head of your family feel about your adventuring career? Are you in your family’s good graces, or shunned by the rest of your family?\n\nDoes your family have a coat of arms? An insignia you might wear on a signet ring? Particular colors you wear all the time? An animal you regard as a symbol of your line or even a spiritual member of the family?\n\nThese details help establish your family and your title as features of the world of the campaign.","skills":["History","Persuasion"],"tools":["One type of gaming set"],"languages":1,"equipment":"Fine Clothes, Signet Ring, Gaming Set, 24 GP, Perfume","feature":"Savage Attacker"},{"name":"Laborer","description":"You have worked the mines since puberty.","skills":["Athletics","Survival"],"tools":["Gaming Set"],"languages":1,"equipment":"Bullseye Lantern, Mess Kit, Common Clothes, Oil (1 flask), Handaxe, shovel, Light Hammer, Waterskin, Gaming Set, 15 gp","feature":"Tough"},{"name":"Merchant","description":"Instead of an artisans’ guild, you might belong to a guild o f traders, caravan masters, or shopkeepers. You don’t craft items yourself but earn a living by buying and selling the works o f others (or the raw materials artisans need to practice their craft). Your guild might be a large merchant consortium (or family) with interests across the region. Perhaps you transported goods from one place to another, by ship, wagon, or caravan, or bought them from traveling traders and sold them in your own little shop. In some ways, the traveling merchant’s life lends itself to adventure far more than the life of an artisan.","skills":["Insight","Persuasion"],"tools":["Caligrapher's Supplies"],"languages":1,"equipment":"Abacus, A gaming set, merchant's scales, 2 pouches, a set of traveler’s clothes, 25 gp","feature":"Lucky"},{"name":"Noble","description":"You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and w ields significant political influence. You might be a pampered aristocrat unfamiliar with work or discomfort, a former merchant just elevated to the nobility, or a disinherited scoundrel with a disproportionate sense of entitlement. Or you could be an honest, hard-working landowner who cares deeply about the people who live and work on your land, keenly aware of your responsibility to them.\n\nWork with your DM to come up with an appropriate title and determine how much authority that title carries. A noble title doesn’t stand on its own—it’s connected to an entire family, and whatever title you hold, you will pass it down to your own children. Not only do you need to determine your noble title, but you should also work with the DM to describe your family and their influence on you.\n\nIs your family old and established, or was your title only recently bestowed? How much influence do they wield, and over what area? What kind of reputation does your family have among the other aristocrats of the region? How do the common people regard them? What’s your position in the family? Are you the heir to the head o f the family? Have you already inherited the title? How do you feel about that responsibility? Or are you so far down the line of inheritance that no one cares what you do, as long as you don’t embarrass the family? How does the head of your family feel about your adventuring career? Are you in your family’s good graces, or shunned by the rest of your family?\n\nDoes your family have a coat of arms? An insignia you might wear on a signet ring? Particular colors you wear all the time? An animal you regard as a symbol of your line or even a spiritual member of the family?\n\nThese details help establish your family and your title as features of the world of the campaign.","skills":["History","Persuasion"],"tools":["One type of gaming set"],"languages":1,"equipment":"Fine Clothes, Signet Ring, Gaming Set, 24 GP, Perfume","feature":"Skilled"},{"name":"Pilgrim","description":"You and a group of like-minded believers once endeavored to walk a thousand miles of road to reach a faraway shrine.","skills":["Religion","Survival"],"tools":["Musical instument"],"languages":1,"equipment":"Bedroll, Healer's kit, Holy Symbol, Musical Instrument, Rations (2 days), Traveler's Clothes, 16 gp","feature":"Healer"},{"name":"Pirate","description":"You sailed on a seagoing vessel for years. In that time, you faced down mighty storms, monsters of the deep, and those who wanted to sink your craft to the bottomless depths. Your first love is the distant line of the horizon, but the time has come to try your hand at something new.\n\nDiscuss the nature o f the ship you previously sailed with your Dungeon Master. Was it a merchant ship, a naval vessel, a ship of discovery, or a pirate ship? How famous (or infamous) is it? Is it widely traveled? Is it still sailing, or is it missing and presumed lost with all hands?\n\nWhat were your duties on board—boatswain, captain, navigator, cook, or some other position? Who were the captain and first mate? Did you leave your ship on good terms with your fellows, or on the run?","skills":["Athletics","Perception"],"tools":["Navigator's tools"],"languages":1,"equipment":"Dagger, Fishing Tackle, Navigator's Tools, Silk Rope (50 ft), Traveler's Clothes, 10 gp","feature":"Tavern Brawler"},{"name":"Sage","description":"You spent years learning the lore of the multiverse. You scoured manuscripts, studied scrolls, and listened to the greatest experts on the subjects that interest you. Your efforts have made you a master in your fields of study.","skills":["Arcana","History"],"tools":["Calligrapher's Supplies"],"languages":1,"equipment":"Book (History), Calligrapher's Supplies, Parchment (8 sheets), Quarterstaff, Robe, 8 gp","feature":"Magic Initiate"},{"name":"Sailor","description":"You sailed on a seagoing vessel for years. In that time, you faced down mighty storms, monsters of the deep, and those who wanted to sink your craft to the bottomless depths. Your first love is the distant line of the horizon, but the time has come to try your hand at something new.\n\nDiscuss the nature o f the ship you previously sailed with your Dungeon Master. Was it a merchant ship, a naval vessel, a ship of discovery, or a pirate ship? How famous (or infamous) is it? Is it widely traveled? Is it still sailing, or is it missing and presumed lost with all hands?\n\nWhat were your duties on board—boatswain, captain, navigator, cook, or some other position? Who were the captain and first mate? Did you leave your ship on good terms with your fellows, or on the run?","skills":["Acrobatics","Perception"],"tools":["Navigator's tools"],"languages":1,"equipment":"Dagger, Fishing Tackle, Navigator's Tools, Silk Rope (50 ft), Traveler's Clothes, 10 gp","feature":"Tavern Brawler"},{"name":"Scholar","description":"As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Elthelas's great institutes of learning, where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home-not to abandon it, but to quest for new lore to add to its storehouse of knowledge.","skills":["History","Choose one from among Arcana, Nature, and Religion"],"tools":["Calligrapher's supplies"],"languages":1,"equipment":"Book (History), Quarterstaff, Calligrapher's Supplies, Robe, Parchment (8 sheets), 8 gp","feature":"Skilled"},{"name":"Soldier","description":"War has been your life for as long as you care to remember. You trained as a youth, studied the use of weapons and armor, learned basic survival techniques, including how to stay alive on the battlefield. You might have been part o f a standing national army or a mercenary company, or perhaps a member of a local militia who rose to prominence during a recent war.\n\nWhen you choose this background, work with your DM to determine which military organization you were a part of, how far through its ranks you progressed, and what kind of experiences you had during your military career. Was it a standing army, a town guard, or a village militia? Or it might have been a noble’s or merchant’s private army, or a mercenary company.","skills":["Athletics","Intimidation"],"tools":["One type of gaming set"],"languages":1,"equipment":"Arrow (20), Gaming Set, Healer's Kit, Quiver, Shortbow, Spear, Traveler's Clothes, 14 gp","feature":"Savage Attacker"},{"name":"Spy","description":"Although your capabilities are not much different from those o f a burglar or smuggler, you learned and practiced them in a very different context: as an espionage agent. You might have been an officially sanctioned agent o f the crown, or perhaps you sold the secrets you uncovered to the highest bidder.","skills":["Deception","Stealth"],"tools":["Disguise kit"],"languages":1,"equipment":"A crowbar, dagger (2), pouch (2), disguise kit, traveler's clothes, 16 gp","feature":"Alert"},{"name":"Urchin","description":"You grew up on the streets alone, orphaned, and poor. You had no one to watch over you or to provide for you, so you learned to provide for yourself. You fought fiercely over food and kept a constant watch out for other desperate souls w ho might steal from you. You slept on rooftops and in alleyways, exposed to the elements, and endured sickness without the advantage of medicine or a place to recuperate. You’ve survived despite all odds, and did so through cunning, strength, speed, or some combination of each.\n\nYou begin your adventuring career with enough money to live modestly but securely for at least ten days. How did you come by that money? What allowed you to break free of your desperate circumstances and embark on a better life?","skills":["Sleight of Hand","Stealth"],"tools":["Thieves' Tools"],"languages":1,"equipment":"Bedroll, Common Clothes, Dagger (2), Gaming Set, Pouch, Thieves' Tools, 18 gp","feature":"Lucky"}]}