{"model":"God","documents":[{"id":"adonna","name":"Adonna","holysymbol":"","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Lawful Good","domains":"Goddess of Beauty and Art","domains5":"Peace, Twilight","worshippers":"","weapon":"","enemy":"","appearance":"","home":"Gallaria Perfectum","tenets":[],"holiday":"","parents":"3rd Generation, born of Molton and Nera","lore":"","level1":"","level10":""},{"id":"agrios","name":"Agrios","holysymbol":"A 7-pointed star with each point a different color","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/agriosholysymbol.png","alignment":"Chaotic Good","domains":"Goddess of the Feywind, Wild places, freedom, and raw emotion.","domains5":"Life, Nature","worshippers":"Fey creatures and many elves, particularly wild elves.","weapon":"Claws","enemy":"Ptoma","appearance":"Agrios appears as a fairy, constantly in motion, with rainbow hair and a dress that is constantly changing colors.","home":"The Feywild","tenets":["There is a healing power to laughter","Jealously guard your freedom, it is worth more than your life","The wild places are holy, they reflect the truths of the world","Always be sure to do more good than harm","Do not hide your emotions, be honest with others in how you feel"],"holiday":"","parents":"3rd Generation, born of Sylvan and Gaian","lore":"Agrios, as the child of the two elder nature Gods, has followed in their footsteps. Yet where Gaian is the high lord of the material plane, representative of the natural order, and Sylvan is the God of winds and animals, and nature in service of man, Agrios represents nature gone wild, the world overgrown, and emotions unchecked.","level1":"","level10":""},{"id":"alidal","name":"Alidal","holysymbol":"A crescent moon with an arrow through it.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Neutral","domains":"Goddess of the Hunt","domains5":"Nature, Twilight","worshippers":"Hunters, witches, hags","weapon":"Bow and Arrow","enemy":"","appearance":"Alidal appears as a lithe woman with skin and hair the color of the moon, covered in constantly shifting tattoos, wearing clothing made of furs.","home":"Lucusectus","tenets":["Use every piece of your kills.","The hunt is the true expression of the self.","Self-sufficiency is an ideal to be strived for.","Do not allow others to define or control you."],"holiday":"","parents":"3rd Generation, born of Mat'raktha and Gaian","lore":"","level1":"","level10":""},{"id":"alitheia","name":"Alitheia","holysymbol":"An eyeball in a triangle","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/alitheiaholysymbol.png","alignment":"Lawful Good","domains":"Goddess of Truth, Sight, and Divination","domains5":"Light, Arcana, Knowledge, Order","worshippers":"Divination wizards. Seekers of Truth. Investigators","weapon":"Mace","enemy":"Mystikinae, God of Secrets","appearance":"A large woman in a white dress with a gold headband covering her eyes.","home":"Mirrodeum","tenets":["Always tell the truth.","root out lies and corruption wherever it is found.","Always strive to be your best possible self."],"holiday":"","parents":"3rd Generation, born of Fanome and Nera","lore":"None can lie within her presence. She isn’t very powerful on her own, but is able to exploit any weakness you have, and foil any schemes you attempt to create. She is able to conjure alternate versions of people to have them fight better versions of themselves.","level1":"","level10":""},{"id":"alohim","name":"Alohim","holysymbol":"A Yellow Rising Sun on a White Background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/alohim-symbol.png","alignment":"Lawful Good","domains":"Light, Rulership, the Divine Right of Kings","domains5":"Light, War","worshippers":"Alohim is worshiped mostly by nobles, particularly those who believe in a divine right to rule, and the nobility of strength.\n\nThe Clergy of Alohim tend to be wealthy, as they receive large donations from the nobility whom they support. They tend to support good order in a country through the strict separation of nobility and serf.","weapon":"Lance","enemy":"Mat'raktha","appearance":"Alohim has shoulder length golden brown hair, often tied back and golden brown eyes.  He either dresses in rich noble clothing with plenty of gold trim and purple or golden armor and well-made boots of leather.  He has a long face with large features.","home":"Celestia","tenets":["I must above all, safeguard the lives of those who depend on me.","I must recognize the divine right to command granted to Kings and their vassals.","I must pray each day at dawn, celebrating the coming of the light.","I must never show cowardice in the face of my enemies","I must keep myself pure both in appearance and soul"],"holiday":"Alohiman 22, The Dominion of the Sun. On the longest day of the year people celebrate with dancing in public squares and other outdoor spaces. Great tables are set up and it is encumbant on the local lord to host a great breakfast feast for the whole town at dawn. It is also the traditional day for oaths of fealty. In the southern hemisphere this is instead celebrated on Amatherin 26, the longest day of the year in that hemisphere.","parents":"2nd Generation, Born of Nera","lore":"Alohim, the eldest child of Nera, is considered among good aligned nations to be the father of the Gods, which makes sense given that his 3 daughters are 3 of the most revered in such places, Amathera, Sara, and Cora. He and his daughters are said to have worked cooperatively to create humans, and until Dorman's ascension he was considered a patron God of all humanity. In the Gods War it was Alohim and Mat'raktha's argument over who should have dominion over Kings and Nations that quickly descended into argument and war. The clergy of Alohim acknowledge this, claiming the dominion of rulership was granted to Alohim at his creation. The sun is considered to be a manifestation of Alohim's power.","level1":"**Light of Dawn.** You know the light cantrip and can cast it at will.","level10":"**Cleansing Light of Alohim.** You can cast the daylight spell as a 3rd level spell 1/day without using a spellslot."},{"id":"amathera","name":"Amathera","holysymbol":"A sheaf of grain over a kite shield","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/amathera.jpg","alignment":"Neutral Good","domains":"Safety, Family, Community, Peace, and Protection","domains5":"Arcana, Knowledge, Life, Peace","worshippers":"The poor, the weak, and those in need of protection from greater foes all pray to Amathera. The nation of Zelfir worships Amathera exclusively, as she aided them in their liberation from the Sorceron now imprisoned in the Sorcerer's Prison.\n\nThe clergy of Amathera receive little to no recognition (at least outside of Zelfir) and live as humbly as those they administer to, usually having cells within the poor houses they operate. They must be blessed with robust health by Amathera for they often work in the dirtiest and most dangerous areas, yet they rarely suffer from disease or attack. Indeed, only the most wretchedly depraved would attack a cleric of Amathera while he was undertaking his duty, for all are welcome to the protection of the Goddess.","weapon":"Spear, Shield(shield bash)","enemy":"Malik","appearance":"Amathera appears as a tall, slender, well muscled woman with dark hair and brown eyes.  Typically dressed in a simple white dress or robe and carrying a large shield. She wears a crown of olive leaves","home":"Celestia","tenets":["All people of means should give of what they have to the poor.","Knowledge is a safeguard against the evils of war. Learning is the pathway to peace.","Love for your neighbor is the paramount good","I must never force another to my will. Rather I must sit with my enemies and teach them, that they might be edified and learn a better way."],"holiday":"Amatherin 30, the Festival of the Lowly. Each year on the shortest day of the year Amathera's priests hold the feast of the lowly where the poorest in the community are honored guests and all must bring offerings of their best to grace them.","parents":"3rd generation, born of Alohim and Nera","lore":"Amathera is mentioned little in the ancient texts, besides that she is the daughter of Alohim and Nera. The greatest single work she is known for is the freeing of the Hisru peoples from their Sorceron master. She is not prone to great works, grand proclomations, or righteous war. Rather she slowly builds up the world through acts of kindness. Rescuing refugees, feeding the poor, and building homes for the homeless.","level1":"","level10":""},{"id":"annam","name":"Annam","holysymbol":"A giant holding up the world","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/annamholysymbol.png","alignment":"Lawful Evil","domains":"Father of Giants, God of Strength","domains5":"Order, Forge, War","worshippers":"Annam All-Father is universally revered by giants and also by many giant kin. Competitions of sport are considered an informal sort of worship for Annam.","weapon":"Lance","enemy":"Indra","appearance":"Annam appears as a 50 ft tall, white bearded, fair skinned giant.","home":"Nephelheim","tenets":["Bigger is better","Ones enemies should be defeated face to face","The strong owe nothing to the weak."],"holiday":"","parents":"2nd Generation, born of Area","lore":"In ancient days Annam held a much higher place. His Giants held dominion over large swaths of the world, and were in constant wars with the Dragons. But even before the time of the Gods War their dominion began to wane. Constant wars with the Dragons and the mortal races took their toll, and soon their were not enough giants to maintain their dominion. Annam created a homeland for the giants at the top of the world, cold and unforgiving, mirrored after his own home of Nephelheim. While small groups of giants still dot the world, most have retreated to this ancient home.","level1":"","level10":""},{"id":"area","name":"Area (pronounced ah-REE-ah)","holysymbol":"A field of grass","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Chaotic Evil","domains":"The inevitable end of times, revenge, space and distance","domains5":"Death, Twilight","worshippers":"Area does not have worshippers, as her lore has been all but forgotten in the modern era. The Gods long ago agreed to never speak of the 3rd Mother God, worried that should she return from her imprisonment, she would end all things. Nevertheless, there have long been whispers of those touched by a mad God with no memory who speaks to them, and some few others know the truth, that beyond the known planes there is a prison for a being that not even Nera could kill.","weapon":"unarmed strike","enemy":"Nera","appearance":"Area, when she takes a humanoid form, takes the appearance of a young girl child. Her innocent appearance belying her vengeful nature.","home":"Aitia, but currently confined in The Plane of ME, hidden within the Outer Realms","tenets":["The world is finite, and its end approaches","The Gods themselves have sinned. Their destruction is the only correct result.","One must take from ones enemies in equal measure to what is taken from you."],"holiday":"None","parents":"1st Generation","lore":"Area, the 3rd Mother Goddess, the Forgotten One, She who is without name. Area is the mother of 1/3 of the Gods, but is reviled by all. When the Gods War broke out, Area declared creation failed, and proposed that all of creation be destroyed so that the Mother Gods could start over. Her sisters rejected this plan, so Area attempted to disable them so she could do it herself. She struck down Gaian, putting her into a deep coma, before Nera tricked her into her current prison, her mind sealed behind walls that she cannot breach on her own. Most churches do not even acknowledge her existence except in the most hidden secret lore. It is rumored that certain arcanum crystals in the world serve as parts of the wall of her prison, and touching them can bring one into contact with a fragment of Area's mind. This fragment, known as ME because it cannot remember it's name, nor remember the concept of having one (I am ME, it often says when asked), blindly grasps at minds to attempt to find servants willing to free it, releasing some portion of Area's power back into the world. Some say it succeeded once, only to have its Avatar destroyed by Nera herself with the aid of a group of adventurers.","level1":"","level10":""},{"id":"arengesus","name":"Arengesus","holysymbol":"A pair of dice","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/arengesusdice.png","alignment":"Chaotic Neutral","domains":"God of Randomness and pure Chaos","domains5":"Trickery","worshippers":"Gamblers and the desperate\n\nHe has no clergy as he is not largely worshipped, which is not to say that he couldn't, just that he doesn't.","weapon":"Flail","enemy":"Tock","appearance":"Arengesus appearance is always random when he appears to his followers.  One day he could appear as a small child, and the next day as a talking sandwich.  His true form, if one exists, is known only to his most loyal followers.","home":"Temerus","tenets":["Your life is more fulfilling and entertaining when you throw off the boundaries of the normal schema of the world and behave in a manner that is random and unpredictable."],"holiday":"","parents":"Migrated from another multiverse, taking over the domain of the long deceased Tychaios, who was 3rd generation, born of Area and Fanome.","lore":"","level1":"","level10":""},{"id":"asmodeus","name":"Asmodeus","holysymbol":"A pentagram","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/asmodeuspentagram.jpg","alignment":"Lawful Evil","domains":"Lord of Devils, God of Pacts","domains5":"Fire, War, Death","worshippers":"","weapon":"Mace","enemy":"Ba'al","appearance":"Asmodeus appears to mortals as a thin, extremely tall, charismatic red-skinned humanoid with horns and glowing red eyes. However, it is believed that this appearance is a front. His true form is unknown.","home":"Nessus, the 9th Layer of Hell","tenets":[],"holiday":"","parents":"3rd generation, born of Mat'raktha and Nera","lore":"","level1":"","level10":""},{"id":"baal","name":"Ba'al","holysymbol":"A skull surrounded by drops of blood","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/baalskull.png","alignment":"Chaotic Evil","domains":"Lord of Demons, God of Destruction, Rape, Pillage, and Fear","domains5":"Fire, Death","worshippers":"Ba'al is not so much worshipped as feared. The demons fear his wrath. If the lesser Demon Lords felt they could challenge him and win, they probably would do so, but it speaks to Ba'al's power that until now none have. Mortals who pay homage to Ba'al usually are fools who think they can outsmart him as part of a deal. Few live through the experience, fewer still come out ahead.\n\nThe clergy of Ba'al tend to be hedonists who believe Ba'als promise of eternal domination of their peers.","weapon":"whip","enemy":"Asmodeus, Alohim","appearance":"Ba'al typically appears similar to the Balor's, but larger, as a massive 20 ft tall humanoid creature with red skin, wings, and horns. The fires of the abyss shine through his eyes and mouth, and the world morphs around him.","home":"The Abyss","tenets":["Loyalty is for the weak","The only true way to control others is through fear.","The multiverse by rights should belong to Ba'al as part of the abyss, subject to his will."],"holiday":"","parents":"3rd generation, born of Nera and Zhuul","lore":"","level1":"","level10":""},{"id":"bahamut","name":"Bahamut","holysymbol":"A platinum dragon on a blue background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/bahamutholysymbol.jpg","alignment":"Lawful Good","domains":"Lord of Metallic Dragons, God of Righteous Might","domains5":"Fire, Tempest, War","worshippers":"Bahamut is worshiped by the people of Dera'Dragorim for his rescue of their people as well as those who admire the strength, power, and goodness of metallic dragons, as well as good dragons themselves.\n\nThe priests of Bahamut are usually second or third sons of noble houses (at least those that are not dragons themselves). Their inheritance, such as it is, is usually donated to the church. In return they serve the dragons that serve as the protectors of Dera'Dragorim, and communicate to them the needs of the people.","weapon":"Heavy Pick or Bite","enemy":"Tiamat","appearance":"Bahamut appears as a colossal dragon with scales of silver, gold, copper and bronze that reflect the light in prismatic colors.","dogma":"","clergy":"","home":"Dracinium","church":"","tenets":["Show courage in the face of evil and protect the weak whenever possible."],"holiday":"","parents":"3rd generation, born of Indra and Nera","lore":"In Dera'Dragorim, the priests of Bahamut are responsible for watching over the clutches of dragon eggs until they hatch. When the first crack appears a celebration begins, and the mother is magically summoned so that imprinting can occur.","level1":"","level10":""},{"id":"bragi","name":"Bragi","holysymbol":"A quill on paper writing flourished words.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/bragiholysymbol.jpg","alignment":"Neutral Good","domains":"God of Poetry and Speech","domains5":"Trade, Peace, Knowledge","worshippers":"poets, bards, storytellers","weapon":"A Pen","enemy":"Factual knowledge, scholars","appearance":"Appears as a quill pen that writes in the air","home":"Poetica Melodium","tenets":["Dance with the truth, but never tell it outright.","Weave lies for entertainment and wonder, not to harm.","Glorify everything, heroes and villains alike.","Make the world awe in wonder at the world itself."],"holiday":"","parents":"3rd Generation, born of Dorun and Nera","lore":"For centuries, Bragi has been in love with Labious, and has attempted to woe her with poetry and wits. She is not amused.","level1":"","level10":""},{"id":"chronos","name":"Chronos","holysymbol":"An hourglass","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/chronosholysymbol.jpg","alignment":"Lawful Neutral","domains":"God of Time","domains5":"Order, Arcana","worshippers":"Chronos has almost no worshippers, rather as the master of one of the fundamental aspects of the universe","weapon":"time itself","enemy":"Arengesus","appearance":"Chronos appears as a vaguely humanoid shape in which one can see entire galaxies floating.","home":"Eternium","tenets":["The flow of time must not be circumvented"],"holiday":"","parents":"3rd Generation, born of Tock and Gaian","lore":"Chronos does not fight fair. There is an ancient story of a group of powerful wizards who attempted to confront him on Eternium. They sought to force him to grant them his boon, but they had barely issued their ultimatum when they found the world around them had stopped, unable to be affected by them. Chronos accelerated time in the space they were in so much that they died of old age in seconds.","level1":"","level10":""},{"id":"chthonis","name":"Chthonis","holysymbol":"A round stone disk, ideally basalt, with an iron bead tightly fit in the center.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/chthonisholysymbol.png","alignment":"True Neutral","domains":"God of the Deep Stone, Magma, and Earthquakes","domains5":"Earth, Nature","worshippers":"“true” earth elementals (i.e. not Dao--they hollow the earth and extract its riches, and are better suited to Dorun), some deep dwarf and stone giant druids.\n\nTerran is the holy language of Chthonis, but he has no official book or creed","weapon":"Hurled Boulder","enemy":"unknown","appearance":"He prefers to appear as a megalith of pure stone, perhaps found in a cave or near a mountaintop. A voice that is so deep you feel it in your stomach, rather than hear it in your ears, emanates from the stone itself. On the rare occasion he must take a more mobile form, he manifests as a truly colossal earth elemental, a veritable walking mountain, and does not bother to appear humanoid.![Chthonis Appearance](https://elthelas-images.herokuapp.com/holysymbol/chthonisappearance.jpg)","home":"Lapisio","tenets":["The plainest, quietest things are the noblest. Even the humble pebble was formed in the heart of the earth, or in the grating of mountains, or the draining of long-forgotten oceans. A single pebble has seen far more of history than scholars will ever know.","Everything man has ever known or done is just a coat of dust the surface of stone--inconsequential."],"holiday":"","parents":"3rd Generation, born of Dorun and Gaian","lore":"If Dorun is the god of caverns, echoes, rich veins of ore, and mighty dwarven holds, then Chthonis is his quiet opposite: the faceless walls of stone between Dorun’s vaulted chambers, the great sea of rock all the way to the center of the world. There is far more deep stone than anything else; the world as most know it is only a thin crust on the vast body of Chthonis. Time, as most know it, is also inconsequential to him: His movements are the rising of mountains and the drift of continents. Only Chronos knows longer aeons and Zhuul vaster space.\n\nChthonis’ sea of rock has many layers. First a mantle of solid stone on which the world dwells--the bed upon which Gaian’s life blooms. Then an ocean of magma that feeds Vulcan’s volcanos. Next a slurry of diamonds that feeds Dorun’s mines. Finally, at the very center is a vast iron crystal, Chthonis’ Heart.\n\nFew mortals worship him, and Chthonis does not involve himself often in mortal affairs. His influence is most perceivable when it comes in the form of earthquakes, but even these are inscrutable: Is it anger? Boredom? Or some unknowable whim?\n\nAfter the Gods War, Chthonis was devastated to be banished to Lapisio. His worshippers insist he is the literal physical manifestation of the planet Elthelas calls home; they say the World Crack was formed when he was wrenched from his place at the heart of the earth. They believe the world will slowly die without his presence: that it will stop shifting, then stop spinning, then go cold… just another soulless rock in the void. The truly devout seek to return Chthonis to Elthelas, perhaps as part of Gaian’s “Nature’s Retribution” when she reawakens.","level1":"","level10":""},{"id":"cora","name":"Cora","holysymbol":"A Flaming Banner","alignment":"Chaotic Good","domains":"Goddess of Righteous War, Lost Causes, and Heroes","domains5":"Life, War, Twilight","worshippers":"Cora is entreated by those who fear their cause is lost, but choose to persist regardless; soldiers of a Good persuasion; and a large part of the populations of Seran, Terron, and Shendarel, as Cora protected and aided them during the Nerim Cataclysm.\n\nThe Clergy of Cora travel the land seeking causes to aid for every cause turned from lost to success is an honor to their God. Others are embedded in military units, where they serve as clerical support, healers, and battle mages.","weapon":"Great Sword","enemy":"Malik","appearance":"Cora appears as a valkyrie-like blue eyed woman in shining full plate and wielding a great sword, with shoulder length hair typically tied back.","home":"Praetorium Eterni","tenets":["Trying to do the right thing is what matters, not whether others approve of it or how likely you are to succeed."],"holiday":"","parents":"3rd Generation, born of Alohim and Area","lore":"Cora is the defender of lost causes, the warrior of justice, the crusader. She honors those who seek to do right regardless of law or chance of success.","level1":"","level10":""},{"id":"dorman","name":"Dorman","holysymbol":"A white sword on a red background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/dormanholysymbol.jpg","alignment":"Lawful Neutral","domains":"God of Might and Rule by Strength","domains5":"Light, War","worshippers":"The worshipers of Dorman are typically those who wish to overcome their enemies, whether in noble battle or through manipulation of the law. Dorman is highly revered among the noble houses of Dormania, where his very existence proves to them their divine right to rule, as well as among generals and officers in various armies around the world.\n\nThe clergy of Dorman are often retired military officers and usually command a large force of citizen militia. They often ride out to war with the armies not as chaplains but as fellow warriors, committing themselves to where the battle is hottest to bring victory and conquest for their king and God.","weapon":"Long Sword","enemy":"Fanome","appearance":"Dorman appears as an older muscular man in armor, with a sword at his waist and a shield strapped to his back or arm.  His hair is dark with streaks of gray, and his eyes are blue.  He is built wide rather than tall, with a thick bull-like neck.","home":"Niktos, The Halls of Victory","tenets":["The victor writes the law, and the law decides the victor.","Justice is the acquisition of their due by the strong","The lower classes should be looked after, for the strength of the ruler is the sum of the strength of the ruled."],"holiday":"","parents":"Ascended Mortal, who took the place of Woden. Woden was 3rd Generation, born of Tock and Area.","lore":"","level1":"","level10":""},{"id":"dorun","name":"Dorun","holysymbol":"A black pick and hammer crossed over a silver background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/dorunholysymbol.png","alignment":"Lawful Neutral","domains":"God of Earth, Stone, and Music","domains5":"Earth, Forge","worshippers":"There is not a dwarf in the world who does not feel the call of the church of Dorun, whether they actively worship him or not, deep places resonate in their bones and the deep places resonate with the sound of His voice. Occasionally gnomes from Stagenheim who live deep within their caves will also take up the worship of Dorun, but for them it does not resonate quite so strongly.\n\nThe clergy of Dorun are often great singers or composers. They often dedicate new holds and caverns with their first songs personally. They also enforce the caste system of dwarven society, refusing to dedicate caverns that are to be the home of any who have lived on the surface, for to be separated from the song of Dorun is to be separated from God.","allowedalignments":"Neutral Good, Lawful Neutral, Neutral, Chaotic Neutral, Neutral Evil","weapon":"War hammer","enemy":"Sylvan","appearance":"Dorun appears as a middle-aged but still powerful looking dwarf, bald but with a long graying red braided beard.  He wears robes of black and gold studded with gemstones.","home":"Lapisio","tenets":["The song of Dorun should never be left to die"],"holiday":"","parents":"2nd Generation, born of Gaian","lore":"Dorun takes great pleasure in song, especially those that resonate throughout his caverns and caves. Even bar songs in the depths of the Dwarven holds contain complicated harmony and counterpoint that is only enhanced when heard from 20 or 30 miles away as it echoes through chamber after chamber. Hymns are even more complicated. He further encourages his followers to delve deeply into the earth in search of rare metals and new places to call home. Magic runes were a gift of Dorun to dwarven bards and wizards who were great composers. The deep resonant tones of the dwarven voice are most suited to His worship, but higher tones and instruments are not turned away.","level1":"","level10":""},{"id":"faatasi","name":"Fa'atasi","holysymbol":"A disc half white and half black, similar to Nera's but inverted, with the black on top.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/faatasiholysymbol.png","alignment":"Chaotic Evil","domains":"Madness, the Far Realm","domains5":"Trickery, Arcana","worshippers":"Fa'atasi has no dedicated worshipers, any creature that is afflicted with a madness of some kind is his worshiper but they are unaware that he is speaking to them. When they hear whispers or see something it is Fa`atasi. This is how he gets power. ","weapon":"The Mind Spike, a morning star mace with a brain on the end with a bunch of spikes coming out of it.","enemy":"Amathera","appearance":"He appears as whatever the being thinks about while under the madness, he has no physical form that anyone knows about. ","home":"The Far Realm","tenets":["The universe is not truly explainable by logic, mortals attempts to make sense of the universe are their pointless attempts at preventing their inevitable insanity."],"holiday":"","parents":"3rd generation, born of Zhuul and Area","lore":"He likes to spread madness to anything he can, in any realm that he can. He isn't out to destroy any worlds or to take over but just to spread madness. Creatures of the Far Realm are more akin to playthings for him. He will inflict madness upon anything to gain power and try to spread to all realms.","level1":"","level10":""},{"id":"fanome","name":"Fanome","holysymbol":"A coin with a grinning gnomish face.","alignment":"Chaotic Neutral","domains":"God of Tricksters and Illusions, patron of Gnomes","domains5":"Arcana, Trickery","worshippers":"Gnomes, practical jokers, illusionists\n\nFanome is widely worshipped among the Imperial Gnomes, and has a sizable following among the Stagen Gnomes as well.  Outside of the gnomes, his adherents are few and far between.","weapon":"Dagger","enemy":"Dorman","appearance":"Fanome's appearance varies greatly, although he typically favors that of a gnomish child.","home":"Temerus","tenets":["Guile and wit are the greatest of virtues","A trick in good fun is good for all."],"holiday":"","parents":"2nd generation, born of Area","lore":"Fanome teaches that guile and wit are the greatest of virtues.  Tales tell of the tricks he plays on his fellow gods, things such as stealing from Bahamut's hoard, and then tricking Tiamat into thinking she had perpetrated the theft, or tricking Molton into giving mortals the power to make fire without entreating him.","level1":"","level10":""},{"id":"funkus","name":"Funkus","holysymbol":"A pair of dancers","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/funkusholysymbol.jpg","alignment":"Chaotic Good","domains":"God of Dance/Celebration","domains5":"Trickery, Light","worshippers":"Anyone who is actively celebrating can be considered a \"Follower\" of Funkus. But more long-term followers include party organizers and party animals.","weapon":"Shoes, Dance Contests","enemy":"Boredom. Depression.","appearance":"Appears as an entire party, balloons, streamers, music. Funkus is the entire crowd of people partying.","home":"Discotechnus","tenets":["Indulge in the pleasures of life.","Find any excuse to celebrate","Revel in yours and others victories"],"holiday":"","parents":"3rd Generation, born of Annam and Gaian","lore":"Throws the best parties. His plane of existence is a massive never-ending party. Before the gods were banished, he would often join in the celebrations of mortals in disguise. Parties where Funkus attends are the stuff of legends.","level1":"","level10":""},{"id":"gaian","name":"Gaian","holysymbol":"An oak tree on a white background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/gaianholysymbol.jpg","alignment":"Neutral","domains":"Goddess of Nature and Creation","domains5":"Life, Nature, Peace, Twilight","worshippers":"Fey, elves, druids, barbarians, and other beings closely tied to nature worship Gaian.\n\nGaian has few priests, rather the druids serve as her clergy, administering to and protecting nature itself rather than men.","weapon":"Quarterstaff","enemy":"Area","appearance":"Gaian appears as an elf, but with skin like the bark of a tree with leaves and shoots sprouting from all over her body, such that she is clothed in vines.  Her eyes are black as the night sky.","home":"Elthelas, the Material Plane","tenets":[],"holiday":"","parents":"1st Generation","lore":"Gaian teaches balance with nature, and that sentient races should be part of nature rather than dominating it. The worship of the goddess of nature lends itself to a hunter gathering life more than a sedentary or agrarian lifestyle. Gaian's worshiper's festivals fall on the solstices and equinoxes to signify the change of seasons.","level1":"","level10":""},{"id":"ganarea","name":"Ganarea","holysymbol":"Bacteria","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/ganareaholysymbol.png","alignment":"Neutral Evil","domains":"Goddess of Pestilance and Disease","domains5":"Nature, Death, Air","worshippers":"Myconids and other fungus creatures. People who are diseased often beg Ganarea for mercy, offering her gifts and sacrifices.","weapon":"A cloud of noxious gas or spores","enemy":"Penicillin/ Labious","appearance":"A cloud of toxic fumes","home":"Morbustos","tenets":["Spread everywhere, leave nothing untouched. Infect everything."],"holiday":"","parents":"3rd Generation, born of Sylvan and Area","lore":"Allied themselves with Asmodeus and Malik during the gods war, wanted to leave all mortals infected with her presence.","level1":"","level10":""},{"id":"hije","name":"Hije","holysymbol":"A Black Cloak","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/hijeholysymbol.png","alignment":"Neutral Evil","domains":"Goddess of Shadow, Thieves, Master of the Shadowfell","domains5":"Arcana, Trickery","worshippers":"Creatures that live in the shadows, thieves","weapon":"Hije's personal weapon is a mutating mass of shadow, able to take any form he desires.","enemy":"Alohim, Alitheia","appearance":"When appearing to mortals, Hije typically takes the form of a humanoid in a cloak, however it is impossible to see his face. No matter what light you shine into the cloak, all one can see inside is darkness and shadow.","home":"The Shadowfell","tenets":["It is not a crime unless you are caught","Let the shadows be your armor","The light cannot exist without creating a shadow"],"holiday":"Amatherin 26, the darkest day of the year, called the Shadows Day. On this day people leave out offerings for Hije, in return for protection from his followers.","parents":"3rd Generation, born of Zhuul and Gaian","lore":"Hije was born in opposition to Alohim, but also as his inevitable partner. A source of light in a world full of things inevitably creates shadows. Shadows flee from the light, but are also created by it. Hije is the essence of this tendency throughout all things. He is the negative space of existence. As such he is the patron of outcasts throughout societies. The name The Black Sun, the international association of thieves guilds, takes its name as a reference to Hije and his existence as negative space.\n\nHije himself is without emotion. He does not favor followers, but makes business arrangements. He is often a patron of Hexblade's, the most powerful or favored of which he grants powerful weapons made of pure shadow. These weapons are shards of the Shadowfell itself.","level1":"Gain proficiency in the stealth skill. If you are already proficient you gain expertise instead.","level10":"You learn the spell Greater Invisibility and can cast it once without using a spell slot."},{"id":"indra","name":"Indra","holysymbol":"A gold dragon on a red background","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/indraholysymbol.jpg","alignment":"Neutral","domains":"Goddess of Greed and Individuality, Mother of Dragons","domains5":"Trade, Order, Peace","worshippers":"All dragons, chromatic or metalic, pay homage to Indra as their great mother. She is often also worshipped by unscrupulous merchants who would be shunned by Maris, and fanatic individualists.","weapon":"","enemy":"Annam","appearance":"Indra typically appears as a long, serpentine dragon, with each scale a different color, from silver to red.","home":"Dracinium","tenets":["Acquisition of wealth is a worthy goal in and of itself","The Dragons are the greatest of the races, each worthy of worship on their own.","Worship no God but the Dragon Gods. Indra first, Bahamut and Tiamat second."],"holiday":"","parents":"2nd Generation, born of Nera","lore":"Indra is a jealous God, and a God of her creations before others. She withdrew from the world long before the Gods War, after fighting her own jealous wars with Annam, God of the Giants. Her hatred for Annam and giant kind defies reason. While all Dragons worship her, it is the sort of worship that is second nature, most devote themselves much more fully to either Bahamut or Tiamat.","level1":"","level10":""},{"id":"interitus","name":"Interitus","holysymbol":"A domed and spotted mushroom cap sheltering the soil below. Potentially other smaller fungi are sheltering beneath the cap as well.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Chaotic Neutral, followers are typically TN or CN","domains":"Goddess of Decay, Fungus, and Soil","domains5":"Grave, Twilight","worshippers":"Myconids, some druids, occasional fanatics (found throughout civilization)\n\nSylvan is Interitus holy language but all are welcome. Many treatises have been written, including one by Autumn-Mother Choira that’s considered a must-read, but there are no officially-sanctioned texts. Myconids, Interitus’ largest group of followers, have no spoken or written language.","weapon":"Quarterstaff from an unrefined tree branch or sapling","enemy":"Undead","appearance":"An enormous regal myconid, which appears as non-threatening and dignified as possible. When she needs to pass as more humanoid, she appears as a decaying-but-not-repulsive man adorned in natural garb, as if a druid. She is fastidious about not appearing disgusting, unlike Ganarea and Ptoma. ![Interitus Appearance](https://elthelas-images.herokuapp.com/holysymbol/interitusappearance.png)","home":"Aposynthesi","tenets":["All return to the earth. Denying this cycle starves the next generation.","Decay is a noble part of nature."],"holiday":"Even non-followers still widely perform an annual ritual to her at harvest-time: They bury a symbolic portion of their harvest in a shallow layer of dirt in their field, in hopes of appeasing Interitus so the rest of their harvest will not rot, and in hopes of being blessed with rich soils next year. This shows they accept that some rot must occur to make next year’s crops healthy. In most communities, the “gift to the earth” is a solemn ritual that is performed as the opening ceremony of the harvest festivities, before anyone starts eating and enjoying themselves.","parents":"3rd Generation, born of Vrasja and Gaian","lore":"\"Most ‘civilized’ people revile a corpse, try to fend off rot, and work hard to preserve their harvests. The very core of ‘civilization’ is a desperate attempt to resist decay, to stave off ruin and decline... It’s ironic, then, that the very foundation of civilization is the fertile fields they sow nature’s gifts in. The precious black soil, filled with worms and fungus and rot, made rich by the very decay they loathe.\n\nThe wise see a corpse or spoilt food for what it is: A boutinful feast. A beginning, not an end. A delightful home for pallid fungus and speckled mould and delicate slime. Soon it shall bloom with autumn’s rainbow! The stomach bloats, the skin dries, the eyes sink. Do not shy away from Interitus’ handiwork, it is just as divine as Sara’s blossoms.\" - excerpt from sermon by Choira Hecatté, a halfling preacher of Interitus\n\nInteritus considers herself a very misunderstood and unfairly maligned god. How is her domain any less vital and beautiful than Sara’s or Sylvan’s or Labious’? People associate him with Serangga and Ganarea, even Ptoma. Why does every depiction of undead have to feature gratuitous use of rotting flesh? Don’t they know undead are unnaturally preserved against rot and should in fact be freed to return to the earth and nourish future generations? And why can’t people grasp that pestilence is the product of an imbalanced system, but decay is as much a part of nature as birth?\n\nInteritus has done as much as she can to distance herself from her mother Vrasja and her half-sibling Ptoma. But the destructive and angry impulses of Area still run through her: she hates those who deny her role as a respectable part of the cycle of nature. Corporeal undead are an affront to Interitus and her followers: Corpses should be allowed to return to the earth, naturally. She also spars with Sara’s when she helps her followers preserve the bounties of harvests--she’s a degenerate child of Gaian because she serves civilization above nature, and yet somehow she’s still so much more beloved than she...","level1":"","level10":""},{"id":"kamin","name":"Kamin","holysymbol":"Varies, For those studying religions, a simple drawing of a cookpot over fire within a hearth circle is considered to be his iconography. Bakers and others that follow him in a somewhat more organized way than simple household practice tend to carry talismans rather than symbols—piece of hearthstone from their home fires, chip from the wooden paddle used to make their first loaf of bread and so on.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Chaotic Good","domains":"Goddess of Fire in Service of Man, the Hearth, and Cooking","domains5":"Fire, Life","worshippers":"Bakers and cooks often have personal traditions or practices that honor Kamin. Many households also have practices to honor the household god of the hearth, though few have it as deliberate offering to Kamin and may make their offerings under other names or simply as old family tradition (the first or last bit of crust goes into the fire to keep it strong...ceremonies to welcome the family gods into a new home/hearth/oven...nearly ritualistic rules for when cleaning out the oven/hearth to preserve the flame, etc)","weapon":"Cast iron skillet","enemy":"Some feel that Kamin is intrinsically opposed to Ganarea, god of pestilence and disease, Frosti god of ice snow and winter, and Interitus god of decay, fungus and soil as the concept of hearthfires and good food are against cold, sickness and rot. However, others point out that fire is most welcome in the winter (and more dangerous in the dryness of summer), that gathering together to share in food and fire can lead to entire households being quarantined together instead of merely the sick individual and that much of what we cook comes from the soil, so to declare these things opposed to one another is foolish oversimplification and denies the interconnectedness of all the gods. This is generally reserved for theologians to debate.","appearance":"old woman with grey hair and flashing eyes, short and slightly round. Kind and smiling","home":"Domigarus","tenets":["Kamin is seen as a goddess of generosity. As she has given hearthstones to contain fire and taught the first people how to use fire to cook and bake, followers are to continue this tradition of sharing."],"holiday":"","parents":"3rd Generation, born of Molton and Area","lore":"Although scholars say that Kamin is born of Gaian and Molton, those more removed from formal religions and their practice instead claim that Kamin is the result of so many small gods being worshiped that eventually, a greater spirit was born to unite all of them, though without actually destroying their individuality. So the household spirit that lives in your fire and protects your family is separate and distinct from the household spirit that lives in my fire and protects my family. But both are linked to Kamin, are a piece of Kamin. One could make offerings to Kamin specifically or could make the offerings to Jeff (because that's what grandma said the fire spirit's name was and everyone in the family knows that you have to pour a spoonful of dough/batter into the fire before you bake or your biscuits will burn, so make the offering to Jeff and just shut up about this Kamin spirit already) and the household spirit/great god will receive it all the same. The practice is what matters, not the name. In this way, Kamin is in an odd position of being widely worshiped but little recognized.","level1":"","level10":""},{"id":"labious","name":"Labious","holysymbol":"A heart pierced by a heart-tipped, wheat-feathered arrow","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Neutral Good","domains":"Goddess of Fertility, Love, Luck, and animal husbandry","domains5":"Life, Nature, Peace, Twilight","worshippers":"Farmers, those deeply in love or those that hope to be in love.","weapon":"Shortbow","enemy":"Odio, God of Hatred","appearance":"An angelic figure with small pink wings. Holding a shortbow with heart-tipped arrows.","home":"Mercuria","tenets":["Love all sentient creatures"],"holiday":"","parents":"3rd Generation, born of Sylvan and Nera","lore":"","level1":"","level10":""},{"id":"leviathan","name":"Leviathan","holysymbol":"Stylized tentacles reaching upward from the depths","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/leviathanholysymbol.png","alignment":"Neutral","domains":"Lord of the Great Sea Creatures (dragon turtles, whales, aboleths, etc)","domains5":"Water","worshippers":"","weapon":"The whip, often with multiple tails","enemy":"Trimala","appearance":"A large, unarmored man with untamed long hair and beard. In depictions by mortals, his wild locks resemble tentacles.","home":"Monstrathelas","tenets":["Strength and actions are the true source of power, not feeble words."],"holiday":"","parents":"3rd Generation, born of Indra and Gaian","lore":"Leviathan typically keeps to the depths of the oceans, but at times will challenge the might of Trimala when he sends his forces from the depths to barrage hapless ships under Trimala's care. He often chooses to leave a handful of survivors, who often will turn away from her after seeing her blessing was insufficient to keep their comrades alive.","level1":"","level10":""},{"id":"magus","name":"Magus","holysymbol":"A wand with a trail of sparkles","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/magusholysymbol.png","alignment":"Lawful Neutral","domains":"God of Magic","domains5":"Arcana","worshippers":"Magical beings and creations, devote followers of magic, mages or aspiring mages. Sorcerer’s coming into their power.","weapon":"","enemy":"Any who would try to use magic to usurp him.","appearance":"Magus takes on the appearance of a Wizened Wizard, in a set of blue robes with arcane runes stitched in gold. His head is adorned with a matching pointed blue hat, and his grey beard nearly touches the floor.","home":"Arcanius","tenets":["Magic is an art, a method of self-expression and discovery. ","Magic in and of itself it neither good nor evil."],"holiday":"","parents":"3rd Generation, born of Tock and Gaian","lore":"There was a previous God of magic before the gods war. The previous god did not limit the scale of magic during their tenure, as a result magic could surpass the 9th level, and mortals were getting closer to matching gods power. That god was lost and forgotten during the conflict. Magus implemented more limits to the Power mortals could wield, but not the scope. ","level1":"","level10":""},{"id":"malik","name":"Malik","holysymbol":"8 arrows pointing outward from a single source","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/malikholysymbol.png","alignment":"Chaotic Evil","domains":"God of Destruction and Wars of Pillage","domains5":"Trickery, War","worshippers":"Malik is worshiped by those who seek chaos and anything that causes it, as well as those with few morals and a penchant for battle. He has many worshipers among the orcs and hobgoblins, and there is an underground cult of Malik among the trollkin as well.\n\nMalik's clergy rarely establish temples, rather they go out seeking to create chaos, often joining with armies. Military units that worship Malik tend to be disorganized irregulars that strike out at their enemies in unpredictable ways, and are granted powerful blessings and great strength in return.","weapon":"Halberd","enemy":"Cora","appearance":"","home":"Chaus Prima","tenets":[],"holiday":"","parents":"3rd Generation, born of Mat'raktha and Area","lore":"Malik is the embotiment of the chaos of the battlefield, the raw destruction of elemental energy, and the blood rage.","level1":"","level10":""},{"id":"maris","name":"Maris","holysymbol":"A ship at full sail","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/marisholysymbol.png","alignment":"Neutral","domains":"God of Travel, Trade, and Fair Deals","domains5":"Arcana, Trade, Peace","worshippers":"Merchants of all kinds worship Maris. Wherever you find coin exchanging hands there you will find his worshipers. He is also often worshiped by those undertaking long journeys or seeking knowledge of the future.\n\nMaris clergy typically possess a great deal of wealth, obtained through their own speculations, and the donations they require of their wealthy followers. They are often merchants in their own right as well as priests, trading in bulk goods, land, or other ventures that don't require a monopoly on their time.","weapon":"Short sword","enemy":"Hije","appearance":"Maris appears as a blind man with dark hair and a silken blindfold over his eyes.  He typically dresses in purple robes with gold scroll-work down the front and back.  He carries a golden scale around his neck and a silver rod with a crystal ball on top.","home":"The Astral Sea","tenets":[],"holiday":"","parents":"3rd Generation, born of Trimala and Nera","lore":"Maris favors fair trade of all kinds, although he certainly doesn't frown on his followers getting better than fair prices. He is the great speculator God, and his worshipers will often come to him to find how prices will change over time. Maris festivals coincide with the opening and closing of the summer markets.","level1":"","level10":""},{"id":"matraktha","name":"Mat'raktha","holysymbol":"A downward pointing spike","alignment":"Lawful Evil","domains":"God of Darkness and Tyranny. Patron of Orcs and Goblinoids","domains5":"Death","worshippers":"Mat'raktha is worshipped by evil people throughout the world, if in secret in most places.  He is the patron of Orcs and the orcish tribes of Malinval and Olda mostly worship him.\n\nWhere his worship is allowed Mat'raktha's clerics extract tribute from his worshippers in return for blessings against their enemies.  Internal politicking among the clergy is common and those who rise high are either highly skilled, or quickly dead.","weapon":"Greataxe","enemy":"Alohim","appearance":"Mat'raktha appears as an orc with very light olive green skin.  He has somewhat rough dark blonde hair precisely styled in neat dreads pulled back with a leather thong.  He is large and very muscled with sharp features and dark brown almost black eyes.  He is extremely well dressed, not necessarily expensive clothing but well-made, everything perfectly clean and neat.  Shoes and armor are always polished and there is never anything like worn cuffs or hanging threads. His Tusks are also always well-filed and polished.","home":"Skoteivas","tenets":["One must dominate their enemies through force."],"holiday":"","parents":"2nd Generation, born of Nera","lore":"His pride and hatred are what started the god War, and those who worship him are typically of the belief that the terms of the peace imposed at the end of the god War stripped Mat'raktha of what was rightfully his, domination over all the other god as King.","level1":"","level10":""},{"id":"moira","name":"Moira","holysymbol":"","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Lawful Neutral","domains":"Goddess of Fate","domains5":"Knowledge, Grave, Twilight","worshippers":"","weapon":"","enemy":"","appearance":"","home":"Chakaria","tenets":[],"holiday":"","parents":"3rd Generation, born of Annam and Nera","lore":"","level1":"","level10":""},{"id":"molton","name":"Molton","holysymbol":"flames","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/moltonholysymbol.png","alignment":"Chaotic Neutral","domains":"God of Fire, Fertility, and Lust","domains5":"Fire, Light","worshippers":"Molton has few worshippers, he offers little to mortal men. Those related to the plane of fire, such as fire mephlings, mephits, elementals, and genasi. He also finds some devotees among sorcerers and wizards who admire the power of fire.\n\nMolton's temples tend to be in remote locations near volcanoes and other places where the power of fire is apparent. For example, the elves have built a shrine to Molton at the top of the Glass Cliff. His priests keep great fires burning in the temples at all times, where clothing is shed in the warmth of the blaze and inhibitions lowered. Women who have had trouble conceiving often come to the temples of Molton to receive his blessing. Each year at midsummer the priests of Molton hold the rite of purification, in which the devout walk through fire. After doing so evil deeds are considered washed away.","weapon":"long sword or heavy crossbow","enemy":"Trimala","appearance":"Molton appears as a muscular and beautiful red haired man clothed completely in flames with bright blue eyes like blue fire.","home":"Ignisia","tenets":[],"holiday":"","parents":"2nd Generation, born of Gaian","lore":"","level1":"","level10":""},{"id":"mystikinae","name":"Mystikinae","holysymbol":"A finger held up to smiling lips","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Lawful Evil","domains":"Goddess of Secrets, Lies, and Forbidden Knowledge","domains5":"Knowledge, Trade, Trickery, Twilight","worshippers":"Those with dark secrets. Those in high ranking political positions that wish to keep power at any cost.","weapon":"A garrote","enemy":"Alitheia","appearance":"A cloaked figure that reveals no distinguishing features. A shadow on the wall.","home":"Etherium","tenets":["Hold your own secrets closely.","Keeping the secrets of others gives you power over them."],"holiday":"","parents":"3rd Generation, born of Fanome and Gaian","lore":"","level1":"","level10":""},{"id":"nera","name":"Nera","holysymbol":"A disc half white and half black","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/neraholysymbol.png","alignment":"Neutral Good and Neutral Evil","domains":"Goddess of Life, Birth, and Death","domains5":"Death, Life, Twilight","worshippers":"Nera's worshippers are rare and hunted in most countries in the modern era, as the common belief is that she is the God of Necromancers. She is worshipped as the one true great God in the country of Arad. Within Arad, her church acts as both ruler and church.","weapon":"Flail","enemy":"Area","appearance":"The mother of the gods (or so she claims) has a very curvy healthy figure.  Pale, glowing skin, blue-black long wavy hair, dresses in long white flowing clothing with bare feet.  She has a round face with a wide generous mouth large silver-grey eyes with a straight nose.","lore":"","home":"Logos","tenets":["All must eventually face the death of their mortal bodies. It is best to accept death with grace.","Bodies are but houses for the soul, once the soul has departed the body should be used to help the living."],"holiday":"","parents":"1st Generation","level1":"","level10":""},{"id":"odio","name":"Odio","holysymbol":"A burning shattered heart","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Chaotic Evil","domains":"Goddess of Hatred","domains5":"Death, Tempest","worshippers":"Any whose heart is filled with hate","weapon":"A spear, or devil's trident","enemy":"Labious","appearance":"A smoldering pile of black vitriol","home":"Sanguinus","tenets":["Hold on to your hate","Never forgive those that have wronged you, even if you have exacted revenge.","Hate makes you stronger and more focused."],"holiday":"","parents":"3rd Generation, born of Vrasja and Area","lore":"","level1":"","level10":""},{"id":"ptoma","name":"Ptoma","holysymbol":"A Red Skull on a Black Circle","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/ptomaholysymbol.png","alignment":"Neutral Evil","domains":"God of Undeath and the Undead","domains5":"Death","worshippers":"Necromancers, Sentient Undead (such as vampires), and those who serve them.","weapon":"A mace made from a femur and a skull","enemy":"Cora","appearance":"Ptoma takes the appearance of a lich.","home":"Necronus","tenets":["Do what is necessary to acheive greatness","The body is but flesh to be used","No life is more valuable than your own"],"holiday":"","parents":"3rd Generation, ascended to replace Mortudex, the Judge of the Dead, born of Vrasja and Nera","lore":"Ptoma is the youngest of the Gods. The first record of him interacting with the world comes from slightly after the Neran cataclysm. There are a number of theories of why that is. One is that the Lich King managed to kill Mortudex, leaving an opening for him to ascend to Godhood. Another possibility is that Mortudex died in some other way, some time before or shortly after the cataclysm, and that some other Sentient Undead managed to ascend later. Evidence points to the second possibility more than the first, as reports are that the Lich King was killed by the Champions of Cora, but either theory is still possible. It is also possible that Mortudex had been dead since the Gods war, and it was only the Neran Cataclysm that provided a strong enough focus of Necrotic energies enabling someone to ascend to fill the void he left behind. Whatever the case, Ptoma quickly shook up the pantheon, preventing the other Gods from destroying the masses of undead created by the cataclysm, and immediately providing a foil to Cora.","level1":"","level10":""},{"id":"sara","name":"Sara","holysymbol":"a cornucopia","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/saraholysymbol.jpg","alignment":"Neutral Good","domains":"Goddess of Growth and Harvest","domains5":"Life, Nature, Peace","worshippers":"farmers and agrarian communities\n\nClergy of Sara are typically humble men and women who live in small communities or wander from community to community spreading both the worship of Sara and planting fruit trees or other producing plants along the way from which everyone can benefit. Their dress is typically crude, often simple linen, cotton, or flaxen robes, but they never go hungry.","weapon":"Sickle or sling","enemy":"Trolka","appearance":"Sara appears as a halfling with short golden brown curly hair.  She wears simple brown dresses and garb with green embroidered runes a straw hat and a basket on her arm filled with the fruits of the harvest.","home":"Frugios","tenets":[],"holiday":"","parents":"3rd Generation, born of Alohim and Gaian","lore":"Any person who nurtures a plants growth is considered to be worshiping Sara. In the spring and in the fall the priests of Sara perform rituals to garner Sara's blessings on the planting and harvest in which the entire community usually participates. These rituals tend to be holidays for the entire community. Sara's blessings are usually subtle, such as more grain in the granary than was growing in the field, or plants that produce past the frost or more fruit than is typical. She rewards her most devout with an unusual knowledge of plants and how to achieve the best harvest possible.","level1":"","level10":""},{"id":"sedna","name":"Sedna","holysymbol":"A fish","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/sednaholysymbol.png","alignment":"True Neutral","domains":"Goddess of Fish and Sea Creatures","domains5":"Tempest, Nature, Water","worshippers":"fish, amphibians, mermaids, sirens","weapon":"A serrated sword, akin to a swordfish.","enemy":"Ganarea – god of Disease. He often uses sea creatures to develop new and more powerful diseases.","appearance":"A mermaid when appearing to surface dwellers, or a giant squid to sea creatures.","home":"Aquilos","tenets":["There is always a bigger fish"],"holiday":"","parents":"3rd Generation, born of Trimala and Gaian","lore":"Was greatly allied with Gaian until her fall. Teamed up with Leviathan to create an army of land fish warriors/ such as merfolk/lizardfolk to aid in the war.","level1":"","level10":""},{"id":"serangga","name":"Serangga","holysymbol":"A giant snake with insect legs in the shape of an \"S\" with 2 mandibles coming out the side of the mouth.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Neutral","domains":"Goddess of Insects, Snakes, and Crawling Things","domains5":"Earth, Nature","worshippers":"Ettercaps, Yuan-Ti","weapon":"","enemy":"Sedna","appearance":"Serangga appears as a 200 ft long snake black snake body with spider/centipede legs all down the torso. She has 4 Red eyes stacked on top of each other. When it opens its mouth 2 large barbed mandibles come out instead of teeth along with a forked tongue. The mandibles are venomous. She spends most of its time under the dirt.","home":"Palusectum","tenets":["The fittest survive","It is the kill that matters"],"holiday":"","parents":"3rd Generation, born of Dorun and Area","lore":"Serangga burrows under the ground and stays hidden most of the time, but when she is hungry she bursts from the ground to ambush her prey. The force of her sudden burst from the earth can cause earthquakes for miles around. Serangga is the embodiement of the principal Survial of the Fittest. She has no emotions as mortals typically consider them, considering only her own survival in her calculations.","level1":"","level10":""},{"id":"sneordra","name":"Sneordra","holysymbol":"Icicles","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/sneordinholysymbol.png","alignment":"Neutral","domains":"Goddess of Ice, Snow, and Winter","domains5":"Water, Nature","worshippers":"Yetis, Ice Mephits, those in cold climates often make offerings to request a gentle winter","weapon":"A scepter made of an icicle","enemy":"Molton","appearance":"A tall, white skinned, curvaceous woman with hair the color of icicles and a crystalline dress.","home":"Hiemsal","tenets":["Your desires are the enemy of your goals","A coldly logical mind is your best tool","Snow and ice can both protect and destroy, when used correctly"],"holiday":"The Snow Celebration, typically held on Neradan 20 in the northern hemisphere.","parents":"3rd Generation, born of Trimala and Area","lore":"The followers of Sneordra have a unique method of divining, reading messages from Sneordra in the patterns frost makes on things such as glass or the surfaces of ponds. Priests of Sneordra typically take a vow of chastity, puting aside their earthly desires.","level1":"","level10":""},{"id":"sylvan","name":"Sylvan","holysymbol":"a white cloud","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/sylvanholysymbol.png","alignment":"Chaotic Good","domains":"God of Air, Wind, and Animals. Patron of Elves","domains5":"Air, Nature, Trickery, Twilight","worshippers":"elves, rangers, and woodsmen.\n\nClergy of Sylvan are well regarded in elven society, although they are rare elsewhere.  Their ceremonial dress is robes made of pure spider silk that cling to the skin, and crowns of laurels or leaves.  Their work typically involves the nurturing of the great trees, huge and ancient, in whose branches many elven settlements are built.  A work they take very seriously. Sects outside of elven society usually focus on one of her other aspects, preaching of the fickle nature of existence and the need to help others while we can.","weapon":"longbow, longsword","enemy":"Dorun","appearance":"Sylvan appears as a tall elf, silver haired and blue eyed.  Sylvan does not have a set gender, and often appears as a man, a woman, or even a hermaphrodite.","home":"Caelum","tenets":[],"holiday":"","parents":"2nd Generation, born of Gaian","lore":"Sylvan is worshipped in the planting of trees, frolicking in the wind, and the caring of animals.  Sylvan differs from Gaian, however, in that its dogma focuses on the preservation of nature for the use of mortals and creatures, rather than as a foil to them.\n\nSylvan is also the God of exploration, discovery, granting her favor to those who explore distant shores and unseen wonders.  Some sects also play on her more chaotic nature, recognizing that deceit and trickery are sometimes necessary for the greater good.","level1":"","level10":""},{"id":"tiamat","name":"Tiamat","holysymbol":"5 dragon claws arranged into a five pointed star. Each in a color of one of the types of chromatic dragons.","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/tiamatholysymbol.png","alignment":"Lawful evil","domains":"Goddess of Chromatic Dragons, God of Plots","domains5":"Trickery","worshippers":"Tiamat is worshiped by evil dragons and those that serve and admire them.\n\nTiamat has few clerics, but those she has seek to extend the power of evil dragons.","weapon":"War Pick or Bite","enemy":"Bahamut","appearance":"Tiamat is a 5-headed dragon with one head each of a red dragon, black dragon, blue dragon, white dragon, and green dragon.","home":"Kolasdrag","tenets":[],"holiday":"","parents":"3rd Generation, born of Indra and Area","lore":"As the God of Evil Dragons Tiamat stands in opposition to Bahamut in all things. She concerns herself with spreading evil through conquest, destruction, and plots. She seeks to extend the powers of evil dragons throughout the land.","level1":"","level10":""},{"id":"tock","name":"Tock","holysymbol":"Two interlocking gears","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/tockholysymbol.png","alignment":"Lawful Neutral","domains":"God of Absolute Order, Writing, and Mechanical Things","domains5":"Arcana, Forge, Knowledge, Peace, Order","worshippers":"Tock is worshiped by craftsman and inventors, particularly among the gnomes of Stagenheim, whom he has blessed with great knowledge and skill with crafts.\n\nThe clergy of Tock are usually great craftsman in their own right, and his temple provides a bounty for particularly interesting ideas so that their inventors can build and test them.","weapon":"Light Hammer, Warhammer","enemy":"Arengesus","appearance":"Tock has the appearance of a living machine in the shape of a halfling or gnome.  He is studded with exposed gears and wires, and wears only a monacle.  He is typically seen carrying one or more thick tomes and is often writing furiously in one or more of them.","home":"Mechanus","tenets":["one should enrich oneself by taking advantage of the laws and forces of the universe to create new and interesting things.","Books are holy things, and should never be destroyed.","One should write a detailed record of all they learn for future generations"],"holiday":"","parents":"2nd Generation, born of Nera","lore":"Tock is the father of the Modrons, small mechanical beings that build things, as well as the Inevitables, a group of incredibly powerful constructs that enforce the order of the universe.","level1":"","level10":""},{"id":"trimala","name":"Trimala","holysymbol":"A Waterfall cascading over a cliff","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/trimalasymbol.png","alignment":"Neutral","domains":"Goddess of Sea and Storm","domains5":"Tempest, Water","worshippers":"Those who live off of the sea or rivers tend to pay tribute to Trimala, as well as lizardmen and other amphibious, reptilian, and fish creatures.\n\nTrimala's clergy intercede with her to seek her mercy on behalf of ship captains and crewmen before making journeys by sea, and on behalf of those who live near coasts to preserve them from the forces of the ocean. Inland they are often called upon in times of drought to pray for rain.","weapon":"Trident","enemy":"Molton","appearance":"Trimala appears in the shape of a woman, but entirely composed of water.  She can appear in any size, and often has sea creatures swimming around inside her form.","home":"Aquilos","tenets":["Only Trimala has the right to take a life upon the seas."],"holiday":"","parents":"2nd Generation, born of Gaian","lore":"Trimala is the goddess of water in all forms and places, from the icy glaciers to the oceans and rivers. She is also the patron goddess of creatures that depend on water, and the Lady of the Moons and Tides. She teaches respect for the sea and its creatures and that all are subject to forces greater than oneself.","level1":"","level10":""},{"id":"trolka","name":"Trolka","holysymbol":"A white haired green skinned grinning troll's face","alignment":"Chaotic Evil","domains":"God of Hunger, Gluttony, and Excess. Patron of Trolls and Hill Giants","domains5":"Death, War","worshippers":"Trolka the ever hungry is the God of giants and trolls, and almost all trolls and most giants worship them.","weapon":"Greatclub or Claw","enemy":"Sara","appearance":"Trolka appears as a massive and incredibly ugly troll with tusks and claws made of steel.  His skin is a ruddy-green color.","home":"Nephelheim","tenets":["You must multiply and consume the world."],"holiday":"","parents":"3rd Generation, born of Annam and Area","lore":"","level1":"","level10":""},{"id":"vrasja","name":"Vrasja","holysymbol":"A bloody dagger","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/vrasjaholysymbol.jpg","alignment":"Chaotic Evil","domains":"Goddess of Assassins, Murder, and Blood","domains5":"Trickery, Death, War","worshippers":"Those who practice the art of murder for hire, or just murder in general. Blood mages, and blood hunters.","weapon":"A serrated dagger that constantly drips blood","enemy":"Amathera","appearance":"Vrasja appears as a muscular woman, scarred from battle, with blond hair always in a long braid. She is always seen in her signature blood red leather armor and with her face hidden by a blood red cloak. Her eyes glow red from under the shadow of her cloak.","home":"Sanguinus","tenets":["Perform Blood Sacrifice in the name of Vrasja","Justice is a lie","Kill efficiently and without mercy","Prove your strength with the blood of your enemies"],"holiday":"","parents":"2nd Generation, born of Area","lore":"No one knows how many Gods of Murder there have been. All have taken the name Vrasja after ascending. All ascended by successfully murdering their predecessor. Scholars are only aware of the change by the occasional change in Vrasja's appearance, gender, and sometimes even minor changes to the tenets and demands made of her clerics.\n\nVrasja is a Goddess with ever shifting alliances. In the days of the Gods War she shifted sides constantly just to keep the war going, and the blood flowing. Where Nera represents natural death, reincarnation, and the normal order of things, Vrasja is the epitome of death by violence, gaining power with each mortal cut down in their prime.","level1":"","level10":""},{"id":"vulcan","name":"Vulcan","holysymbol":"A Smith's hammer made entirely out of lava","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/","alignment":"Chaotic Neutral","domains":"God of Volcanos, Fiery Destruction, and Smithing","domains5":"Fire, Forge","worshippers":"Blacksmith's, Salamanders, and some dwarves","weapon":"a warhammer. His personal weapon is a massive warhammer named Lava Forger.","enemy":"Frosti","appearance":"10 ft tall, tan skinned, shaved head with a beard of flowing lava.Wears a blacksmith apron with no undershirt. and black leather pants. His eyes are the red/orange of lava, just the iris.He has dwarvish features.","home":"Ignisia","tenets":["Keep the forge hot, and your soul hotter.","When smithing, be perfect. When in battle, rain down fiery destruction."],"holiday":"","parents":"3rd Generation, born of Molton and Gaian","lore":"The weapons and armor the Vulcan makes, are perfection. The gods themselves rarely get his weapons as he deems them too powerful. No mortal has ever had a weapon of his make. He has occasionally taught blacksmiths that will venture into the Plane of Fire.","level1":"","level10":""},{"id":"zhuul","name":"Zhuul","holysymbol":"A black skull and crossbones","symbolimage":"https://elthelas-images.herokuapp.com/holysymbol/zhuulholysymbol.png","alignment":"Neutral Evil","domains":"God of the Void","domains5":"Death, Knowledge","worshippers":"Zhuul, Lord of Decay, is worshipped by those whose hearts are twisted by hatred or jealousy.  He offers them revenge for perceived wrongs, binding the souls of his worshippers eternally to his service.  To others he offers forbidden or hidden knowledge.  He is a patron to evil wizards and pirates.\n\nZhuul's clergy come from every race and country, attaching themselves to evil aligned organizations or disguising themselves as clergy of other Gods or by holding other jobs or professions.","weapon":"Hand Crossbow","enemy":"Gaian","appearance":"Zhuul appears to others generally as an area of darkness through which no light can pass.","home":"The Nothingness Beyond","tenets":["All of creation will inevitably end, and at that point only Zhuul and his chosen will remain."],"holiday":"","parents":"2nd generation, born of Area","lore":"","level1":"","level10":""}]}