{"model":"Organization","documents":[{"id":"elathianrangers","title":"Elathian Rangers","description":"Reknowned explorers and adventurers, The Elathian Rangers are a loose organization dedicated to exploring unknown haunts.  They sponsor outfitters in cities close to remote locations that act as the gatekeepers to the organization.  These outfitters compile maps and information brought in by the rangers, creating guide books and outfitting kits.","nations":["eldoran","demalthor","gerasalim","morrindim","terron","dormania","kandor","curinor"],"cities":["seldan","dima","estapor","aridhem","eastguard","pelgan","morrind"],"rules":["To stay in one place is to fail to grow, I must always be finding new places","The frontiers are dangerous and I must always strive to make them safer for others","I must attempt to preserve natural beauty where I find it"],"ranks":[{"index":0,"name":"Hunter","minDisposition":1,"description":"Your wilderness skills are enough to get you some basic recognition from the local rangers."},{"index":1,"name":"Scout","minDisposition":3,"description":"You have ventured into the wilderness and come back alive and with tales to tell."},{"index":2,"name":"Explorer","minDisposition":5,"description":"You've been places no one else has ever been before, and been recognized for the effort."}],"features":[{"minrank":0,"name":"Hunter's Mark","description":"Add the spell hunter's mark to your spells known or spellbook.  You gain the ability to cast hunter's mark 1/day as a first level spell without expending a spell slot."},{"minrank":1,"name":"Favored Terrain","description":"You gain a favored terrain.  See the ranger feature by the same name, if you already have a favored terrain you may pick an additional one."},{"minrank":2,"name":"Master Hunter","description":"When you cast hunter's mark the spell no longer requires concentration."}]},{"id":"trollkinmercenarycorps","title":"Trollkin Mercenary Corps","description":"The Trollkin Mercenary Corps is the official diplomatic arm of Degak'Ta, but membership is not restricted to citizens of Degak'Ta or Trollkin.  They are an elite group of mercenaries who will sign up for any conflict for the right price, even different sides of the same conflict. Once contracted they are known to be extremely loyal and impartial, governed by the contract they are given until it expires.  Further they are known to be among the best warriors in the world, so being able to afford Trollkin Mercenaries is considered extremely prestigious.","nations":["degakta"],"cities":["sunra"],"rules":["My contract is law.  Failing to fulfill the contract I agree to is never acceptable for any reason.","Never work without payment.  We are not a charity organization","Avoid religious entanglements.  Many employers have particular religious beliefs, and one should avoid offending future employers.  I must never engage in public displays of religion or work directly for a religious organization."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"You are a new recruit. Execute your contracts with honor and they may just let you stay."},{"index":1,"name":"Bravo","minDisposition":2,"description":"You have been recognized as a skilled mercenary, and have been issued a letter of rank."},{"index":2,"name":"Veteran","minDisposition":4,"description":"You are known to be reliable and capable. Good work soldier."},{"index":3,"name":"Captain","minDisposition":6,"description":"Pips on the shoulder mark you out as someone who has been around the block more than once."},{"index":4,"name":"General","minDisposition":10,"description":"You are now in charge of an autonomous army that can accept contracts on its own terms. You report directly to the Grand Marshal, so don't screw it up."}],"features":[{"minrank":0,"name":"Equipped for Battle","description":"The corps is willing to take a risk on you and give you 100 gp worth of combat equipment."},{"minrank":1,"name":"Battle Master","description":"The advance training the Corps provides has paid off and you are able to do more damage with every swing of your sword or shot of your bow.  You get +1d4 damage on all weapon attack rolls."},{"minrank":2,"name":"Advance Payment","description":"People who give you contracted missions are willing to pay in advance whenever they are able.  The reputation of the Mercenary Corps preceeds you."},{"minrank":3,"name":"Command","description":"You have command of a squad of recruits and bravos who will help with missions."},{"minrank":4,"name":"High Command","description":"You have command of several squads, each commanded by a captain who execute your orders. Additionally, potential employers actively seek you out, and you are empowered to accept or deny contracts without cosulting higher ups. Just remember that you have to pay your troops."}]},{"id":"unionofwizardscolleges","title":"Union of Wizard's Colleges","description":"The Union of Wizard's Colleges is an international organization dedicated to the sharing of magical knowledge.  Unlike the Artificer's, who hoard artifacts and technical expertise, the Union is dedicated to training young wizards, sorcerers, bards, and others to use their magical abilities responsibly.  Founded first by the colleges in Zelfir's major cities as a way to prevent magical accidents and misuse of magic, the Union has since spread across the globe. It's members vow to always use magic responsibly, avoiding collateral damage, and educating the public on the benefits of accepting magic users into the community. The Union is involved in licensing users of arcane magic in several countries, including Zelfir, Kandor, Gerasalim, Eldoran, Dera'Dragorim, Staelia, and Dormania. Licensed wizard's do not need to be members of the Union, but the Union has contracts with governments to obtain special policing powers to police their own.","nations":["Dera'Dragorim","Dormania","Eldoran","Gerasalim","Kandor","Staelia","Zelfir"],"cities":["Zelfin","Mandon","Last Watch","Malidal","Desadorel","Kalland","Strovenguard","Loridesa","Instar","Milan","Estapor"],"rules":["Avoid hurting bystanders with magic or other collateral damage to your activities","Share your knowledge with others","Obey the laws around magic use in whatever country you are in","Enforce the laws around magic use when others break them"],"ranks":[{"index":0,"name":"Apprentice","minDisposition":0,"description":"You have joined a local wizards college as a new apprentice and have been assigned a mentor to learn from. Good luck!"},{"index":1,"name":"Adept","minDisposition":2,"description":"You have proven you are skilled enough to no longer need a mentor."},{"index":2,"name":"Magi","minDisposition":4,"description":"You have been recognized as a skilled mage and teacher."},{"index":3,"name":"High Magi","minDisposition":6,"description":"Your skill and dedication have been recognized by the college, and other Magi now regularly seek out your guidance and advice."},{"index":4,"name":"Dean","minDisposition":10,"description":"You have been named the Dean of a local college."}],"features":[{"minrank":0,"name":"Library Access","description":"You have been assigned to a local mage as an apprentice, and given access to the local magical library."},{"minrank":1,"name":"Practiced Spells","description":"Learn a cantrip from the wizard, sorcerer, bard, or warlock lists. The casting stat for that cantrips depends on the list you chose it from, intelligence for wizard, charisma for sorcerer, bard, or warlock."},{"minrank":2,"name":"Apprentice","description":"You have been assigned an apprentice who accompanies you and can perform simple tasks for you in return for education. This apprentice is a character who shares a spellcasting class with you, at least 4 levels lower than you are. For example, if you are a 7th level wizard, your apprentice is a wizard with a maximum level of 3."},{"minrank":3,"name":"Knowledge Exchange","description":"The Union shares knowledge with you regularly. Every ten days the union magically sends you a random spell scroll of a level you can cast (maximum 5th level) and on your classes spell list. Additionally you are recognized for your skill by most magi you encounter. Your Library Access feature now extends to any library owned or associated with the Union."},{"minrank":4,"name":"College","description":"The Union is prepared to fund a college under your leadership. This college provides  you with contacts and income, as well as magi that report directly to you for orders, as well as providing you with the results of their research."}]},{"id":"voidbringers","title":"Voidbringers","description":"The voidbringers are a collection of worshippers of Trolka, Malik, and various unspeakable evils from beyond the edge of existence who are dedicated to returning the world of Elthelas to the void.  The continued existence of the mortal plane is seen as an affrontory to the beauty of pure chaos, and so it must be brought to an end.","nations":[],"cities":[],"rules":["Governments and organized religions represent the natural order.  I must never work for them, and should try to undermine them where possible.","If I have multiple ways I could solve a problem, I should choose the most violent or destructive method"],"ranks":[{"index":0,"name":"Known","minDisposition":1,"description":"Your actions have marked you for consideration by the Voidbringers. They are watching you."},{"index":1,"name":"Initiate","minDisposition":3,"description":"You have been contacted by a Master Voidbringer. Now is your chance to prove yourself."},{"index":2,"name":"Touched","minDisposition":5,"description":"You have been touched by the void."},{"index":3,"name":"Master of Nothing","minDisposition":7,"description":"You have been called to lead a cell of voidbringers. For the Void!"},{"index":4,"name":"Weaver of Chaos","minDisposition":10,"description":"You are the ultimate enemy of order, you will bring the end. They will thank you for it in the end."}],"features":[{"minrank":1,"name":"Blood Sacrifice","description":"You can spend 1 hour performing unholy rights and sacrifice a living creature on an altar to your God, gaining a +1 bonus to all d20 rolls you make for the next 24 hours."},{"minrank":2,"name":"Insanity","description":"You have been touched by the eternal void, and your mind will never be the same again.  Your dedication to chaos gives you advantage on saves against charm and fear."},{"minrank":3,"name":"Extraplanar","description":"You are a senior agent of your God, and he speaks to you.  You can cast Contact Outer Plane once per day without using a spell slot so long as you use it to contact Trolka, Malik, or an outer evil whom you revere."},{"minrank":4,"name":"Blood of My Enemies","description":"When you reduce a creature within 5 feet of you to 0 hit points you can declare them a blood sacrifice, per the Blood Sacrifice feature, but without requiring an altar or an hour of rites."}]},{"id":"wildernessguards","title":"Wilderness Guards","description":"The Wilderness Guards are a mercenary group employed primarily by local governments on the borders of the Riftlan Wilds. They specialize in fighting the dangerous monstrosities and extraplanar entities that occasionally drift into the material plane in those areas, protecting local settlements from attack. Similarly they protect the creatures of the natural world from both habitat destruction by civilization, and the appetites of those same extraplanar entities. Rangers of all stripes, druids, oath of the watcher paladins, and many fighters get recruited by the Guards. The guards generally act as individuals or in small squads rather than as an organized military force.","nations":["zelfir","deradragorim"],"cities":["seldan","lastwatch","portsmith"],"rules":["I must protect civilization from the dangers of the frontier.","I must preserve the natural world from the worst exploitations of civilization and the extreme nature of extraplanar entities."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"As a new recruit you are assigned to a veteran guard for training."},{"index":1,"name":"Guard","minDisposition":2,"description":"Your wilderness skills are enough to get you some basic recognition from the locals."},{"index":2,"name":"Protector","minDisposition":4,"description":"You have ventured into the wilderness and come back alive and with tales to tell."},{"index":3,"name":"Guard Captain","minDisposition":6,"description":"You've been places no one else has ever been before, and been recognized for the effort."}],"features":[{"minrank":0,"name":"Equipped","description":"The Wilderness Guards are willing to help equip you and provide 100 gp worth of equipment."},{"minrank":1,"name":"Hunter's Mark","description":"Add the spell hunter's mark to your spells known or spellbook.  You gain the ability to cast hunter's mark 1/day as a first level spell without expending a spell slot."},{"minrank":2,"name":"Selfless Protector","description":"Your experience has taught you ways to protect others in battle. You gain the Protection fighting style. If you already have that fighting style choose another fighting style that you do not already have."},{"minrank":3,"name":"Squad","description":"You have been given leave to recruit a squad of Wilderness Guards from the local population that report to you."}]}]}