{
  "name": "Fighter",
  "level": 1,
  "hitdie": 10,
  "caststat": 3,
  "cantrips": 0,
  "cantriplevel": 1,
  "proficiencies": {
    "armor": ["light armor", "medium armor", "heavy armor", "shields"],
    "weapons": ["simple weapons", "martial weapons"],
    "tools": [],
    "saving throws": ["str", "con"],
    "numskills": 2,
    "skills": ["acrobatics", "animalhandling", "athletics", "history", "insight", "intimidation", "perception", "survival"]
  },
  "resources": [
    {
      "name": "Second Wind",
      "counttype": "prof",
      "count": 0,
      "minlevel": 1,
      "recovery": "longrest"
    },
    {
      "name": "Action Surge",
      "counttype": "fixed",
      "count": 1,
      "minlevel": 3,
      "recovery": "shortrest"
    }
  ],
  "features": [
    {
      "level": 1,
      "name": "Second Wind",
      "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you recover all expended uses when you complete a long rest."
    },
    {
      "level": 2,
      "name": "Fighting Style",
      "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\n\n#### Archery\n\nYou gain a +2 bonus to attack rolls you make with ranged weapons.\n\n#### Defense\n\nWhile you are wearing armor, you gain a +1 bonus to AC.\n\n#### Dueling\n\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n\n#### Great Weapon Fighting\n\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\n\n#### Protection\n\nWhen a creature you can see attacks a target other than you that is within your reach, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\n\n#### Two-Weapon Fighting\n\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\n\n#### Blind Fighting\n\nYou have blindsight with a range of 3m. Within that range, you can effectively see anything that isn't behind total cover, even if you are blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\n\n#### Interception\n\nWhen a creature you can see hits a target, other than you, within your reach with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simle or martial weapon to use this reaction.\n\n#### Superior Technique\n\nYou learn one maneuver of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n\nYou gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). The die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.\n\n#### Thrown Weapon Fighting\n\nYou can draw a weapon that has the thrown property as part of the attack you make with the weapon.\n\nIn addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll.\n\n#### Unarmed Fighting\n\nYour unarmed strikes can deal bludgeoning damage equal to 1d8 + your Strength modifier on a hit. If you aren't wielding any weapons or a shield when you make the attack roll, the d8 becomes a d10.\n\nAt the start of each of your turns you can deal 1d4 bludgeoning damage to one creature grappled by you."
    },
    {
      "level": 2,
      "name": "Martial Archetype",
      "description": "At 2nd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end o f the class description. The archetype you choose grants you features at 2nd level and again at 7th, 10th, 15th, and 18th level."
    },
    {
      "level": 3,
      "name": "Action Surge",
      "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 15th level, you can use it twice before a rest, but only once on the same turn."
    },
    {
      "level": 15,
      "name": "Action Surge (2nd Use)",
      "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 15th level, you can use it twice before a rest, but only once on the same turn."
    },
    {
      "level": 6,
      "name": "Martial Archetype Feature (6th)",
      "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end o f the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
    },
    {
      "level": 10,
      "name": "Martial Archetype Feature (10th)",
      "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end o f the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
    },
    {
      "level": 14,
      "name": "Martial Archetype Feature (14th)",
      "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end o f the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 6,
      "name": "Ability Score Improvement (6th)",
      "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 14,
      "name": "Ability Score Improvement (14th)",
      "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 4,
      "name": "Martial Versatility",
      "description": "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can do one of the following, as you shift the focus of your martial practice:\n\n* Replace a fighting style you know with another fighting style available to fighters.\n* If you know any maneuvers from the Battle Master archetype, you can replace one maneuver you know with a different maneuver."
    },
    {
      "level": 5,
      "name": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 17th level in this class."
    },
    {
      "level": 7,
      "name": "Impose Self",
      "description": "As a reaction when an ally within 1m of you takes damage, you can spend one of your hit dice to reduce the damage by the amount that you roll on that hit die plus your constitution modifier. This modification is applied after any resistances or other modifications to the damage roll."
    },
    {
      "level": 7,
      "name": "Weapon Mastery",
      "description": "You unlock the maximum potential of the weapons you wield. You gain access to the weapon mastery property of any weapon you wield."
    },
    {
      "level": 11,
      "name": "Extra Attack (3 attacks)",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 17th level in this class."
    },
    {
      "level": 17,
      "name": "Extra Attack (4 attacks)",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 17th level in this class."
    },
    {
      "level": 9,
      "name": "Indomitable",
      "description": "Beginning at 9th level, you can reroll a saving throw that you fail and add a bonus to the new roll equal to your proficiency bonus. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 18th level."
    },
    {
      "level": 13,
      "name": "Indomitable (two uses)",
      "description": "Beginning at 9th level, you can reroll a saving throw that you fail and add a bonus to the new roll equal to your proficiency bonus. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 18th level."
    },
    {
      "level": 18,
      "name": "Indomitable (three uses)",
      "description": "Beginning at 9th level, you can reroll a saving throw that you fail and add a bonus to the new roll equal to your proficiency bonus. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 18th level."
    },
    {
      "level": 20,
      "name": "Called Critical",
      "description": "You can declare a called critical before making a weapon attack. If the attack hits it is a critical hit, even if it would not otherwise be a critical hit. You can do this a number of times equal to your proficiency bonus, and recover all uses when you finish a long rest."
    }
  ],
  "subclass": [
   {
      "name": "Champion",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Improved Critical",
          "description": "Beginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20."
        },
        {
          "level": 2,
          "name": "Remarkable Athlete",
          "description": "You can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn’t already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of meters equal to 1/4 your Strength modifier."
        },
        {
          "level": 6,
          "name": "Enhanced Fighting Style",
          "description": "You improve the fighting style you chose at 2nd level. Replace your fighting style with one of the ones from the list below:\n#### Archery\n\nYou gain a +2 bonus to attack and damage rolls you make with ranged weapons.\n\n#### Defense\n\nWhile you are wearing armor, you gain a +2 bonus to AC.\n\n#### Dueling\n\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +4 bonus to damage rolls with that weapon.\n\n#### Great Weapon Fighting\n\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. Additionally, when you roll a critical hit with such a weapon you deal an additional 5 damage. The weapon must have the two-handed or versatile property for you to gain this benefit.\n\n#### Protection\n\nWhen a creature you can see attacks a target other than you that is within your reach, you can use your reaction to impose disadvantage on the attack roll. Additionally, any damage the attack does is reduced by 1d6. You must be wielding a shield.\n\n#### Two-Weapon Fighting\n\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack. Additionally, while wielding a one-handed weapon in each hand you gain a +1 bonus to your AC.\n\n#### Blind Fighting\n\nYou have blindsight with a range of 6m. Within that range, you can effectively see anything that isn't behind total cover, even if you are blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\n\n#### Interception\n\nWhen a creature you can see hits a target, other than you, within your reach with an attack, you can use your reaction to reduce the damage the target takes by 2d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction.\n\n#### Superior Technique\n\nYou learn two maneuvers of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n\nYou gain two superiority dice, which are d6s (this die is added to any superiority dice you have from another source). The die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.\n\n#### Thrown Weapon Fighting\n\nYou can draw a weapon that has the thrown property as part of the attack you make with the weapon.\n\nIn addition, when you hit with a ranged attack using a thrown weapon, you gain a +4 bonus to the damage roll.\n\n#### Unarmed Fighting\n\nYour unarmed strikes can deal bludgeoning damage equal to 1d10 + your Strength modifier on a hit. If you aren't wielding any weapons or a shield when you make the attack roll, the d10 becomes a d12.\n\nAt the start of each of your turns you can deal 1d6 bludgeoning damage to one creature grappled by you."
        },
        {
          "level": 10,
          "name": "Additional Fighting Style",
          "description": "You can choose a second option from the Fighting Style class feature."
        },
        {
          "level": 14,
          "name": "Superior Critical",
          "description": "Your weapon attacks score a critical hit on a roll of 18-20."
        },
        {
          "level": 14,
          "name": "Survivor",
          "description": "You attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don’t gain this benefit if you have 0 hit points."
        }
      ]
    },
    {
      "name": "Battle Master",
      "castermult": 0,
      "resources": [
        {
          "name": "Superiority Dice",
          "counttype": "table",
          "count": [[2,4],[7,5],[15,6]],
          "minlevel": 2,
          "recovery": "shortrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Combat Superiority",
          "description": "When you choose this archetype at 2nd level, you learn maneuvers that are fueled by special dice called superiority dice.\n\n**Maneuvers.** You learn three maneuvers of your choice, which are detailed under \"Maneuvers\" below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n\nYou learn two additional maneuvers of your choice at 6th, 10th, and 14th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n\n**Superiority Dice.** You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n\nYou gain another superiority die at 6th level and one more at 14th level.\n\n**Saving Throws.** Some of your maneuvers require your target to make a saving throw to resist the maneuver’s effects. The saving throw DC is calculated as follows:\n\nManeuver save DC = 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n\n#### Maneuvers\n\nThe maneuvers are presented in alphabetical order.\n\n**Commander’s Strike.** When you take the Attack action on your turn, you can forgo one of your attacks and use a bonus action to direct one of your companions to strike. When you do so, choose a friendly creature who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding the superiority die to the attack’s damage roll.\n\n**Disarming Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it’s holding. You add the superiority die to the attack’s damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. The object lands at its feet.\n\n**Distracting Strike.** When you hit a creature with a weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack’s damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn.\n\n**Evasive Footwork.** When you move, you can expend one superiority die, rolling the die and adding the number rolled to your AC until you stop moving.\n\n**Feinting Attack.** You can expend one superiority die and use a bonus action on your turn to feint, choosing one creature within your reach as your target. You have advantage on your next attack roll against that creature this turn. If that attack hits, add the superiority die to the attack’s damage roll.\n\n**Goading Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to attempt to goad the target into attacking you. You add the superiority die to the attack’s damage roll, and the target must make a Wisdom saving throw. On a failed save, the target has disadvantage on all attack rolls against targets other than you until the end of your next turn.\n\n**Lunging Attack.** When you make a melee weapon attack on your turn, you can expend one superiority die to increase your reach for that attack by 1m. If you hit, you add the superiority die to the attack’s damage roll.\n\n**Maneuvering Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to maneuver one of your comrades into a more advantageous position. You add the superiority die to the attack’s damage roll, and you choose a friendly creature who can see or hear you. That creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack. \n\n**Menacing Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to attempt to frighten the target. You add the superiority die to the attack’s damage roll, and the target must make a Wisdom saving throw. On a failed save, it is frightened of you until the end of your next turn.\n\n**Parry.** When another creature damages you with a melee attack, you can use your reaction and expend one superiority die to reduce the damage by the number you roll on your superiority die + your Dexterity modifier.\n\n**Precision Attack.** When you make a weapon attack roll against a creature, you can expend one superiority die to add it to the roll. You can use this maneuver before or after making the attack roll, but before any effects of the attack are applied.\n\n**Pushing Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to attempt to drive the target back. You add the superiority die to the attack's damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you push the target up to 4m away from you.\n\n**Rally.** On your turn, you can use a bonus action and expend one superiority die to bolster the resolve of one of your companions. When you do so, choose a friendly creature who can see or hear you. That creature gains temporary hit points equal to the superiority die roll + your Charisma modifier.\n\n**Riposte.** When a creature misses you with a melee attack, you can use your reaction and expend one superiority die to make a melee weapon attack against the creature. If you hit, you add the superiority die to the attack's damage roll.\n\n**Sweeping Attack.** When you hit a creature with a melee weapon attack, you can expend one superiority die to attempt to damage another creature with the same attack. Choose another creature within 2m of the original target and within your reach. If the original attack roll would hit the second creature, it takes damage equal to the number you roll on your superiority die. The damage is of the same type dealt by the original attack.\n\n**Trip Attack.** When you hit a creature with a weapon attack, you can expend one superiority die to attempt to knock the target down. You add the superiority die to the attack’s damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you knock the target prone.\n\n**Ambush.** When you make a Dexterity (Stealth) check or an initiative roll, you can expend on superioriy die and add the die to the roll, provided you aren't incapacitated.\n\n**Bait and Switch** When you're within 1m of a creature on your turn, you can expend one superiority die and switch places with that creature, provided you spend at least 1m of movement and the creature is willing and isn't incapacitated. This movement doesn't provoke opportunity attacks.\n\nRoll the superiority die. Until the start of your next turn, you or the other creature (your choice) gains a bonus to AC equal to the number rolled.\n\n**Brace** When a creature you can see moves into the reach you have with the melee weapon you're wielding, you can use your reaction to expend one superioriy die and make one attack against the creature, using that weapon. If the attack hits, add the superiority die to the weapon's damage roll.\n\n**Commanding Presence.** When you make a Charisma (Intimidation), a Charisma (Performance), or a Charisma (Persuasion) check, you can expend one superiority die and add the superiority die to the ability check.\n\n**Grappling Strike.** Immediately after you hit a creature with a melee attack on your turn, you can expend one superiority die and then try to grapple the target as a bonus action (see the Player's Handbook for rules on grappling). Add the superiority die to your Strength (Athletics) check.\n\n**Quick Toss.** As a bonus action, you can expend one superiority die and make a ranged attack with a weapon that has the thrown property. You can draw the weapon as part of making this attack. If you hit, add the superiority die to the weapon's damage roll.\n\n**Tactical Assessment.** When you make an Intelligence (Investigation), an Intelligence (History), or a Wisdom (Insight) check, you can expend one superiority die and add the superiority die to the ability check."
        },
        {
          "level": 2,
          "name": "Student of War",
          "description": "At 2nd level, you gain proficiency with one type of artisan’s tools of your choice."
        },
        {
          "level": 6,
          "name": "Know Your Enemy",
          "description": "Starting at 6th level, if you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own. The DM tells you if the creature is your equal, superior, or inferior in regard to two of the following characteristics of your choice:\n\n* Strength score\n* Dexterity score\n* Constitution score\n* Armor Class\n* Current hit points\n* Total class levels (if any)\n* Fighter class levels (if any)"
        },
        {
          "level": 10,
          "name": "Improved Combat Superiority",
          "description": "Your superiority dice turn into d10s."
        },
        {
          "level": 14,
          "name": "Relentless",
          "description": "When you roll initiative and have no superiority dice remaining, you regain 1 superiority die."
        },
        {
          "level": 14,
          "name": "Improved Combat Superiority",
          "description": "Your superiority dice turn into d12s."
        }
      ]
    },
    {
      "name": "Eldritch Knight",
      "castermult": 0.5,
      "resources": [
        {
          "name": "Spells Known",
          "counttype": "table",
          "count": [[2,2],[3,3],[5,4],[7,5],[9,6],[11,7],[13,8],[15,9],[17,10],[19,11]],
          "minlevel": 2,
          "addToTable": true,
          "recovery": "none"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Spellcasting",
          "description": "When you reach 2nd level, you augment your martial prowess with the ability to cast spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the wizard spell list.\n\n**Cantrips.** You learn two cantrips of your choice from the Eldritch Knight spell list. You learn an additional eldritch knight cantrip of your choice at 10th level and 14th level.\n\n**Spell Slots.** The Eldritch Knight Spellcasting table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell shield and have a 1st-level and a 2nd-level spell slot available, you can cast shield using either slot.\n\n**Spells Known of 1st-Level and Higher.** You know two 1st-level eldritch knight spells of your choice.\n\nThe Spells Known column of the Eldritch Knight Spellcasting table shows when you learn more eldritch knight spells of 1st level or higher. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 7th level in this class, you can learn one new spell of 1st or 2nd level.\n\nWhenever you gain a level in this class, you can replace one of the spells you know with another spell of your choice from the eldritch knight spell list. The new spell must be of a level for which you have spell slots\n\n**Spellcasting Ability.** Intelligence is your spellcasting ability for your eldritch knight spells, since you learn your spells through study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Intelligence modifier\n\nSpell attack modifier = your proficiency bonus + your Intelligence modifier\n##### Eldritch Knight Spellcasting Table\n<table class='table table-striped'><tr><th>Level</th><th>Cantrips</th><th>Spells Known</th><th>1st</th><th>2nd</th><th>3rd</th><th>4th</th><th>5th</th></tr><tr><td>2nd</<td><td>2</td><td>2</td><td>2</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>3rd</<td><td>2</td><td>3</td><td>3</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>4th</<td><td>2</td><td>3</td><td>3</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>5th</<td><td>2</td><td>4</td><td>4</td><td>2</td><td>-</td><td>-</td><td>-</td></tr><tr><td>6th</<td><td>2</td><td>4</td><td>4</td><td>2</td><td>-</td><td>-</td><td>-</td></tr><tr><td>7th</<td><td>2</td><td>5</td><td>4</td><td>3</td><td>-</td><td>-</td><td>-</td></tr><tr><td>8th</<td><td>2</td><td>5</td><td>4</td><td>3</td><td>-</td><td>-</td><td>-</td></tr><tr><td>9th</<td><td>2</td><td>6</td><td>4</td><td>3</td><td>2</td><td>-</td><td>-</td></tr><tr><td>10th</<td><td>3</td><td>6</td><td>4</td><td>3</td><td>2</td><td>-</td><td>-</td></tr><tr><td>11th</<td><td>3</td><td>7</td><td>4</td><td>3</td><td>3</td><td>-</td><td>-</td></tr><tr><td>12th</<td><td>3</td><td>7</td><td>4</td><td>3</td><td>3</td><td>-</td><td>-</td></tr><tr><td>13th</<td><td>3</td><td>8</td><td>4</td><td>3</td><td>3</td><td>1</td><td>-</td></tr><tr><td>14th</<td><td>4</td><td>8</td><td>4</td><td>3</td><td>3</td><td>1</td><td>-</td></tr><tr><td>15th</<td><td>4</td><td>9</td><td>4</td><td>3</td><td>3</td><td>2</td><td>-</td></tr><tr><td>16th</<td><td>4</td><td>9</td><td>4</td><td>3</td><td>3</td><td>2</td><td>-</td></tr><tr><td>17th</<td><td>4</td><td>10</td><td>4</td><td>3</td><td>3</td><td>3</td><td>1</td></tr><tr><td>18th</<td><td>4</td><td>10</td><td>4</td><td>3</td><td>3</td><td>3</td><td>1</td></tr><tr><td>19th</<td><td>4</td><td>11</td><td>4</td><td>3</td><td>3</td><td>3</td><td>2</td></tr><tr><td>20th</<td><td>4</td><td>11</td><td>4</td><td>3</td><td>3</td><td>3</td><td>2</td></tr></table>"
        },
        {
          "level": 2,
          "name": "Weapon Bond",
          "description": "At 2nd level, you learn a ritual that creates a magical bond between yourself and one weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. The weapon must be within your reach throughout the ritual, at the conclusion of which you touch the weapon and forge the bond.\n\nOnce you have bonded a weapon to yourself, you can’t be disarmed of that weapon unless you are incapacitated. If it is on the same plane of existence, you can summon that weapon as a bonus action on your turn, causing it to teleport instantly to your hand.\n\nYou can have up to two bonded weapons, but can summon only one at a time with your bonus action. If you attempt to bond with a third weapon, you must break the bond with one of the other two."
        },
        {
          "level": 2,
          "name": "Combat Caster",
          "description": "You can use a 1-handed weapon with which you are proficient as a spellcasting focus."
        },
        {
          "level": 6,
          "name": "War Magic",
          "description": "Beginning at 6th level, when you use the extra attack action, you can replace one of your weapon attacks with a cantrip you know."
        },
        {
          "level": 10,
          "name": "Eldritch Strike",
          "description": "At 10th level, you learn how to make your weapon strikes undercut a creature’s resistance to your spells. When you hit a creature with a weapon attack, that creature has disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn."
        },
        {
          "level": 14,
          "name": "Arcane Charge",
          "description": "At 14th level, you gain the ability to teleport up to 9m to an unoccupied space you can see when you use your Action Surge. You can teleport before or after the additional action."
        },
        {
          "level": 14,
          "name": "Improved War Magic",
          "description": "When you use your action to cast a spell, you can make one weapon attack as a bonus action."
        }
      ]
    },
    {
      "name": "Scourer",
      "castermult": 0,
      "resources": [
        {
          "name": "Counter Magic",
          "counttype": "fixed",
          "count": 2,
          "minlevel": 7,
          "recovery": "shortrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Slay Magic",
          "description": "At 2nd level when you take this Martial Archetype your skills reveal weak spots in spell casters that others miss. Gain an extra 1d8 damage against an enemy that you have seen casting a spell within the last minute. This damage increases to 2d8 at level 18."
        },
        {
          "level": 2,
          "name": "Bonus Proficiency",
          "description": "You gain proficiency in the arcana skill."
        },
        {
          "level": 6,
          "name": "Counter Magic",
          "description": "You have learned the inner working of spells and can inherently use the spell against itself. Twice per short rest, you can bend another’s spell to your will. To do this you must spend your reaction to negate or control another casters spell. 3rd level or lower spells are automatically affected while higher level spells require a charisma check with the DC being 10 + the spells level. If you succeed, you can choose to negate the spell entirely, or if the spell targets a single target other than the caster, you can choose a different target for the spell. If the spell is a concentration spell, you take over concentration for the spells duration if you choose to do so. You may only concentrate on one spell at a time."
        },
        {
          "level": 10,
          "name": "Capture Magic",
          "description": "You have learned how spell casters create and spin their magical effects, and have learned how to prevent it. When you successfully grapple a creature, the target becomes unable to cast spells that have verbal or semantic components as long as they are grappled."
        },
        {
          "level": 14,
          "name": "See Magic",
          "description": "At level 14, you have learned to see past the trickery magic can create. You have advantage on wisdom saves against spells and advantage on detecting illusions."
        }
      ]
    },
    {
      "name": "Arcane Archer",
      "castermult": 0,
      "resources": [
        {
          "name": "Arcane Shot",
          "counttype": "table",
          "count": [[2,4],[7,5],[15,6]],
          "minlevel": 2,
          "recovery": "shortrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Arcane Archer Lore",
          "description": "At 2nd level, you learn magical theory or some of the secrets of nature—typical for practitioners of this elven martial tradition. You choose to gain proficiency in either the Arcana or the Nature skill, and you choose to learn either the prestidigitation or the drufdcraft cantrip."
        },
        {
          "level": 2,
          "name": "Arcane Shot",
          "description": "At 2nd level, you learn to unleash special magical effects with some of your shots. When you gain this feature, you learn three Arcane Shot options of your choice (see “Arcane Shot Options” below).\n\nOnce per turn when you fire a magic arrow from a shortbow or longbow as part of the Attack action, you can apply one of your Arcane Shot options to that arrow. You decide to use the option when the arrow hits a creature, unless the option doesn’t involve an attack roll. You have four uses of this ability, and you regain all expended uses of it when you finish a short or long rest. You gain an additional use of this ability at 6th and 14th level.\n\nYou gain an additional Arcane Shot option of your choice when you reach certain levels in this class: 6th, 10th, and 14th. Each option also improves when you become an 14th—level fighter.\n##### Arcane Shot Options\n**Banishing Arrow.** You use abjuration magic to try to temporarily banish your target to a harmless location in the Feywild. The creature hit by the arrow must also succeed on a Charisma saving throw or be banished. While banished in this way, its speed is 0, and it is incapacitated. At the end of its next turn, the target reappears in the space it vacated or in the nearest unoccupied space if that space is occupied.\n\nAfter you reach 14th level in this class, a target also takes 2d6 force damage when the arrow hits it.\n\n**Beguiling Arrow.** Your enchantment magic causes this arrow to temporarily beguile its target. The creature hit by the arrow takes an extra 2d6 psychic damage, and choose one of your allies within 9m of the target. The target must succeed on a Wisdom saving throw, or it is charmed by the chosen ally until the start of your next turn. This effect ends early if the chosen ally attacks the charmed target, deals damage to it, or forces it to make a saving throw.\n\nThe psychic damage increases to 4d6 when you reach 14th level in this class.\n\n**Bursting Arrow.** You imbue your arrow with force energy drawn from the school of evocation. The arrow detonates after your attack. Immediately after the arrow hits the creature, the target and all other creatures within 3m of it take 2d6 force damage each.\n\nThe force damage increases to 4d6 when you reach 14th level in this class.\n\n**Enfeebling Arrow.** You weave necromantic magic into your arrow. The creature hit by the arrow takes an extra 2d6 necrotic damage. The target must also succeed on a Constitution saving throw, or the damage dealt by its weapon attacks is halved until the start of your next turn.\n\nThe necrotic damage increases to 4d6 when you reach 14th level in this class.\n\n**Grasping Arrow.** When this arrow strikes its target, conjuration magic creates grasping, poisonous brambles, which wrap around the target. The creature hit by the arrow takes an extra 2d6 poison damage, its speed is reduced by 3m, and it takes 2d6 slashing damage the first time on each turn it moves without teleporting. The target or any creature that can reach it can use its action to remove the brambles with a successful Strength (Athletics) check against your Arcane Shot save DC. Otherwise, the brambles last for 1 minute or until you use this option again.\n\nThe poison damage and slashing damage both increase to 4d6 when you reach 14th level in this class.\n\n**Piercing Arrow.** You use transmutation magic to give your arrow an ethereal quality. When you use this option, you don’t make an attack roll for the attack. Instead, the arrow fires forward in a line, which is 1 inch wide and 9m long, before disappearing. The arrow passes harmlessly through objects, ignoring cover. Each creature in that line must make a Dexterity saving throw. On a failed save, a creature takes damage as if it were hit by the arrow, plus an extra 1d6 piercing damage. On a successful save, a target takes half as much damage.\n\nThe piercing damage increases to 2d6 when you reach 14th level in this class.\n\n**Seeking Arrow.** Using divination magic, you grant your arrow the ability to seek out your target, allowing the arrow to curve and twist its path in search of its prey. When you use this option, you don’t make an attack roll for the attack. Instead, choose one creature you have seen in the past minute. The arrow flies toward that creature, moving around corners if necessary and ignoring three-quarters cover and half cover. If the target is within the weapon’s range and there is a path large enough for the arrow to travel to the target, the target must make a Dexterity saving throw. On a failed save, it takes damage as if it were hit by the arrow, plus an extra 1d6 force damage, and you learn the target’s current location. On a successful save, the target takes half as much damage, and you don’t learn its location.\n\nThe force damage increases to 2d6 when you reach 14th level in this class.\n\n**Shadow Arrow.** You weave illusion magic into your arrow, causing it to occlude your foe’s vision with shadows. The creature hit by the arrow takes an extra 2d6 psychic damage, and it must succeed on a Wisdom saving throw or be unable to see anything farther than 1m away until the start of your next turn.\n\nThe psychic damage increases to 4d6 when you reach 14th level in this class."
        },
        {
          "level": 6,
          "name": "Magic Arrow",
          "description": "You gain the ability to infuse arrows with magic. Whenever you fire a nonmagical arrow from a shortbow or longbow, you can make it magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. The magic fades from the arrow immediately after it hits or misses its target."
        },
        {
          "level": 6,
          "name": "Curving Shot",
          "description": "You learn how to direct an errant arrow toward a new target. When you make an attack roll with a magic arrow and miss, you can use a bonus action to reroll the attack roll against a different target within 18m of the original target."
        },
        {
          "level": 6,
          "name": "Additional Arcane Shot Options",
          "description": "You gain 2 additional Arcane Shot options."
        },
        {
          "level": 10,
          "name": "Additional Arcane Shot Options",
          "description": "You gain 2 additional Arcane Shot options."
        },
        {
          "level": 14,
          "name": "Ever-Ready Shot",
          "description": "Starting at 15th level, your magical archery is available whenever battle starts. If you roll initiative and have no uses of Arcane Shot remaining, you regain one use of it."
        },
        {
          "level": 14,
          "name": "Improved Arcane Shot",
          "description": "See Arcane Shot."
        }
      ]
    },
    {
      "name": "Cavalier",
      "castermult": 0,
      "resources": [
        {
          "name": "Unwavering Mark",
          "counttype": "STR1",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        },
        {
          "name": "Warding Maneuver",
          "counttype": "CON1",
          "count": 0,
          "minlevel": 7,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Bonus Proficiency",
          "description": "When you choose this archetype at 2nd level, you gain proficiency in one of the following skills of your choice: Animal Handling, History, Insight, Performance, or Persuasion. Alternatively, you learn one language of your choice."
        },
        {
          "level": 2,
          "name": "Born to the Saddle",
          "description": "Starting at 2nd level, your mastery as a rider becomes apparent. You have advantage on saving throws made to avoid falling off your mount. If you fall off your mount and descend no more than 3m, you can land on your feet if you’re not incapacitated.\n\nFinally, mounting or dismounting a creature costs you only 1m of movement, rather than half your speed."
        },
        {
          "level": 2,
          "name": "Unwavering Mark",
          "description": "Starting at 2nd level, you can menace your foes, foiling their attacks and punishing them for harming others. When you hit a creature with a melee weapon attack, you can mark the creature until the end of your next turn. This effect ends early if you are incapacitated or you die, or if someone else marks the creature.\n\nWhile it is within your reach, a creature marked by you has disadvantage on any attack roll that doesn’t target you.\n\nIn addition, if a creature marked by you deals damage to anyone other than you, you can make a special melee weapon attack against the marked creature as a bonus action on your next turn. You have advantage on the attack roll, and if it hits, the attacks weapon deals extra damage to the target equal to half your fighter level.\n\nRegardless of the number of creatures you mark, you can make this special attack a number of times equal to your Strength modifier (minimum of once), and you regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 6,
          "name": "Warding Maneuver",
          "description": "You learn to fend off strikes directed at you, your mount, or other creatures nearby. If you or a creature you can see within your reach is hit by an attack, you can roll 1d8 as a reaction if you’re wielding a melee weapon or a shield. Roll the die, and add the number rolled to the target’s AC against that attack. If the attack still hits, the target has resistance against the attack’s damage.\n\nYou can use this feature a number of times equal to your Constitution modifier (minimum of once), and you regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 10,
          "name": "Hold the Line",
          "description": "At 10th level, you become a master of locking down your enemies. Creatures provoke an opportunity attack from you when they move 1m or more while within your reach, and if you hit a creature with an opportunity attack, the target’s speed is reduced to 0 until the end of the current turn."
        },
        {
          "level": 14,
          "name": "Ferocious Charger",
          "description": "Starting at 14th level, you can run down your foes, whether you’re mounted or not. If you move at least 3m in a straight line right before attacking a creature and you hit it with the attack, that target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone. You can use this feature only once on each of your turns."
        },
        {
          "level": 14,
          "name": "Vigilant Defender",
          "description": "You respond to danger with extraordinary vigilance. In combat, you get a special reaction that you can take once on every creature’s turn, except your turn. You can use this special reaction only to make an opportunity attack, and you can’t use it on the same turn that you take your normal reaction."
        }
      ]
    },
    {
      "name": "Samurai",
      "castermult": 0,
      "resources": [
        {
          "name": "Fighting Spirit",
          "counttype": "fixed",
          "count": 3,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Bonus Proficiency",
          "description": "When you choose this archetype at 3rd level, you gain proficiency in one of the following skills of your choice: History, Insight, Performance, or Persuasion. Alternatively, you learn one language of your choice."
        },
        {
          "level": 2,
          "name": "Fighting Spirit",
          "description": "Starting at 3rd level, your intensity in battle can shield you and help you strike true. As a bonus action on your turn, you can give yourself advantage on weapon attack rolls until the end of the current turn. When you do so, you also gain 5 temporary hit points. The number of temporary hit points increases when you reach certain levels in this class, increasing to 10 at 10th level and 15 at 15th level.\n\nYou can use this feature three times, and you regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 6,
          "name": "Elegant Courtier",
          "description": "Your discipline and attention to detail allow you to excel in social situations. Whenever you make a Charisma (Persuasion) check, you gain a bonus to the check equal to your Wisdom modifier.\n\nYour self-control also causes you to gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
        },
        {
          "level": 10,
          "name": "Tireless Spirit",
          "description": "Starting at 10th level, when you roll initiative and have no uses of Fighting Spirit remaining, you regain one use."
        },
        {
          "level": 14,
          "name": "Rapid Strike",
          "description": "You learn to trade accuracy for swift strikes. If you take the Attack action on your turn and have advantage on an attack roll against one of the targets, you can forgo the advantage for that roll to make an additional weapon attack against that target, as part of the same action. You can do so no more than once per turn."
        },
        {
          "level": 14,
          "name": "Strength before Death",
          "description": "Your fighting spirit can delay the grasp of death. If you take damage that reduces you to 0 hit points and doesn’t kill you outright, you can use your reaction to delay falling unconscious, and you can immediately take an extra turn, interrupting the current turn. While you have 0 hit points during that extra turn, taking damage causes death saving throw failures as normal, and three death saving throw failures can still kill you. When the extra turn ends, you fall unconscious if you still have 0 hit points.\n\nOnce you use this feature, you can’t use it again until you finish a long rest."
        }
      ]
    },
    {
      "name": "Psi Warrior",
      "castermult": 0,
      "resources": [
        {
          "name": "Psionic Energy Dice",
          "counttype": "prof2",
          "count": 0,
          "minlevel": 3,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Psionic Power",
          "description": "You harbor a wellspring of psionic energy within yourself. This energy is represented by your psionic energy dice, which are each a d6. You have a number of these dice equal to twice your proficiency bonus, and they fuel various psionic powers you have, which are detailed below.\n\nSome of your powers expend the Psionic Energy die they use, as specified in a power's description, and you can't use a power if it requires you to use a die and your dice are all expended. You regain all your expended Psionic Energy dice when you finish a long rest. In addition, as a bonus action, you can regain one expended Psionic Energy die, but you can't do so again until you finish a long rest.\n\nWhen you reach certain levels in this class, the size of your Psionic Energy dice increases: at 5th level (d8), 11th level (d10) and 17th level (d12).\n\nThe powers below use your Psionic Energy dice.\n\n**Protective Field.** When you or another creature you can see within 9m of you takes damage, you can use your reaction to expend one Psionic Energy die, roll the die, and reduce the damage taken by the number rolled plus your Intelligence modifier (minimum reduction of 1), as you create a momentary shield of telekinetic force.\n\n**Psionic Strike.** You can propel your weapons with psionic force. Once on each of your turns, immediately afer you hit a target within 9m of you with an attack and deal damage to it with a weapon, you can expend one Psionic Energy die, rolling it and dealing force damage to the target equal to the number rolled plus your Intelligence modifier.\n\n**Telekinetic Movement.** You can move an object or a creature with your mind. As an action, you target one loose object that is Large or smaller or one willing creature, other than yourself. If you can see the target and it is within 9m of you, you can move it up to 9m to an unoccupied space you can see. Alternatively, if it is a Tiny object, you can move it to or from your hand. Either way, you can move the target horizontally, vertically, or both. Once you take this action, you can't do so again until you finish a short or long rest, unless you expend a Psionic Energy die to take it again."
        },
        {
          "level": 6,
          "name": "Telekinetic Adept",
          "description": "You have mastered new ways to use your telekinetic abilities, detailed below.\n\n**Psi-Powered Leap.** As a bonus action, you can propel your body with your mind. You gain a flying speed equal to twice your walking speed until the end of the current turn. Once you take this bonus action, you can't do so again until you finish a short or long rest, unless you expend a Psionic Energy die to take it again.\n\n**Telekinetic Thrust.** When you deal damage to a target with your Psionic Strike, you can force the target to make a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Intelligence modifier. If the save fails, you can knock the target prone or move it up to 3m in any direction horizontally."
        },
        {
          "level": 10,
          "name": "Guarded Mind",
          "description": "The psionic energy flowing through you has bolstered your mind. You have resistance to psychic damage. Moreover, if you start your turn charmed or frightened, you can expend a Psionic Energy die and end every effet on yourself subjecting you to those conditions."
        },
        {
          "level": 14,
          "name": "Bulwark of Force",
          "description": "You can shield yourself and others with telekinetic force. As a bonus action, you can choose creatures, which can include you, that you can see within 9m of you, up to a number of creatures equal to your intelligence modifier (minimum of 1 creature). Each of the chosen creatures is protected by half cover for 1 minute or until you're incapacitated.\n\nOnce you take this bonus action, you can't do so again until you finish a long rest, unless you expend a Psionic Energy die to cast it again."
        },
        {
          "level": 14,
          "name": "Telekinetic Master",
          "description": "Your ability to move creatures and objects with your mind is matched by few. You can cast the Telekinesis spell, requiring no components, and your spellcasting ability for the spell is Intelligence. On each of your turns while you concentrate on the spell, including the turn when you cast it, you can make one attack with a weapon as a bonus action.\n\nOnce you cast the spell with this feature, you can't do so again until you finish a long rest, unless you expend a Psionic Energy die to cast it again."
        }
      ]
    },
    {
      "name": "Rune Knight",
      "castermult": 0,
      "resources": [
        {
          "name": "Giant's Might",
          "counttype": "prof",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        },
        {
          "name": "Runic Shield",
          "counttype": "prof",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Bonus Proficiencies",
          "description": "You gain proficiency with smith's tools, and you learn to speak, read, and write Giant."
        },
        {
          "level": 2,
          "name": "Rune Carver",
          "description": "You can use magic runes to enhance your gear. You learn two runes of your choice, from among the runes described below, and each time you gain a level in this class, you can replace one rune you know with a different one from this feature. When you reach certain levels in this class, you learn additional runes, as shown in the Runes Known table.\n\n* 2nd - 2\n* 7th - 3\n* 10th - 4\n* 15th - 5\n\nWhenever you finish a long rest, you can touch a number of objects equal to the number of runes you know, and you inscribe a different rune onto each of the objects. To be eligible, an object must be a weapon, a suit of armor, a shield, a piece of jewelry, or something else you can wear or hold in a hand. Your rune remains on an object until you finish a long rest, and an object can bear only one of your runes at a time.\n\nThe following runes are available to you when you learn a rune. If a rune has a level requirement, you must be at least that level in this class to learn the rune. If a rune requires a saving throw your rune magic save DC equals 8 + your proficiency bonus + your Constitution modifier.\n\n**Cloud Rune.** This rune emulates the deceptive magic used by some cloud giants. While wearing or carrying an object inscribed with this rune, you have advantage on Dexterity (Slight of Hand) checks and Charisma (Deception) checks.\n\nIn addition when you or a creature you can see within 9m of you is hit by an attack roll, you can use your reaction to invoke the rune and choose a different creature within 9m of you, other than the attacker. The chosen creature becomes the target of the attack, using the same roll. This magic can transfer the attack's effects regardless of the attack's range. Once you invoke this rune, you can't do so again until you finish a short or long rest.\n\n**Fire Rune.** This rune's magic channels the masterful craftsmanship of great smiths. While wearing or carrying an object inscribed with this rune, your proficiency bonus is doubled for any ability check you make that uses your proficiency with a tool.\n\nIn addition, when you hit a creature with an attack using a weapon, you can invoke the rune to summon fiery shackles: the target takes an extra 2d6 fire damage, and it must succeed on a Strength saving throw or be restrained for 1 minute. While restrained by the shackles, the target takes 2d6 fire damageat the start of each of its turns. The target can repeat the saving throw at the end of each of its turns, banishing the shackles on a success. Once you invoke this rune, you can't do so again until you finish a short or long rest.\n\n**Frost Rune.** This rune's magic evokes the might of those who survive in the wintry wilderness, such as frost giants. While wearing or carrying an object inscribed with this rune, you have advantage on Wisdom (animal handling) checks and Chrisma (Intimidation) checks.\n\nIn addition, you can invoke the run as a bonus action to increase your sturdiness. For 10 minutes, you gain a +2 bonus to all ability checks and saving throws that use Strength or Constitution. Once you invoke this rune, you can't do so again until you finish a short or long rest.\n\n**Stone Rune.** This rune's magic channels the judiciousness associated with stone giants. While wearing or carrying an object inscribed with this rune, you have advantage on Wisdom (Insight) checks, and you have darkvision out to a range of 36m.\n\nIn addition, when a creature you can see ends its turn within 9m of you, you can use your raection to invoke the rune and force the creature to make a Wisdom saving throw. Unless the save succeeds, the creature is charmed by you for 1 minute. While charmed in this way, the creature has a speed of 0 and is incapacitated, descending into a dreamy stupor. The creature repeats the saving throw at the end of each of its turns, ending the effect on a success. Once you invoke this rune, you can't do so again until you finish a short or long rest.\n\n**Hill Rune (7th level or higher).** This rune's magic bestows a resilience reminiscent of a hill giant. While wearing or carrying an object that bears this rune, you have advantage on saving throws against being poisoned, and you have resistance against poison damage.\n\nIn addition, you can invoke the rune as a bonus action, gaining resistance to bludgeoning, piercing, and slashing damage for 1 minute. Once you invoke this rune, you can't do so again until you finish a short or long rest.\n\n**Storm Rune (7th level or higher).** Using this rune, you can glimpse the future like a storm giant seer. While wearing or carrying an object inscribed with this rune, you have advantage on Intelligence (Arcana) checks, and you can't be surprised as long as you aren't incapacitated.\n\nIn addition, you can invoke the rune as a bonus action to enter a prophetic state for 1 minute, or until you're incapacitated. Until this state ends, when you or another creature you can see within 18m of you makes an attack roll, a saving throw, or an ability check, you can use your reaction to cause the roll to have advantage or disadvantage. Once you invoke this rune, you can't do so again until you finish a short or long rest."
        },
        {
          "level": 2,
          "name": "Giant's Might",
          "description": "You have learned how to imbue yourself with the might of giants. As a bonus action, you magically gain the following benefits, which last for 1 minute:\n\n* If you are smaller than Large, you become Large, along with anything you are wearing. If you lack the room to become Large, your size doesn't change.\n* You have advantage on Strength checks and Strength saving throws.\n* Once on each of your turns, one of your attacks with a weapon or an unarmed strikecan deal an extra 1d6 damage to a target on a hit.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 6,
          "name": "Runic Shield",
          "description": "You learn to invoke your rune magic to protect your allies. When another creature you can see within 18m of you is hit by an attack roll, you can use your reaction to force the attacker to reroll the d20 and use the new roll.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        },
        {
          "level": 10,
          "name": "Great Stature",
          "description": "The magic of your runes permanently alters you. When you gain this feature, roll 3d4. You grow a number of inches in height equal to the roll.\n\nMoreover the extra damage you deal with your Giant's Might features increases by 1d8."
        },
        {
          "level": 14,
          "name": "Master of Runes",
          "description": "You can invoke each rune you know from your Rune Carver feature twice, rather than once, and you regain all expended uses when you finish a short or long rest."
        },
        {
          "level": 14,
          "name": "Runic Juggernaut",
          "description": "You learn how to amplify your rune-powered transformation. As a result, the extra damage you deal with the Giants Might feature increases to 1d10. Moreover, when you use that feature, your size can increase to Huge, and while you are that size, your reach increases by 1m."
        }
      ]
    }
  ]
}