{
  "name": "Monk",
  "level": 1,
  "hitdie": 10,
  "caststat": 4,
  "cantrips": 0,
  "cantriplevel": 1,
  "proficiencies": {
    "armor": [],
    "weapons": ["simple weapons", "martial weapons"],
    "tools": ["one type of artisans tools or musical instrument"],
    "saving throws": ["str", "dex"],
    "numskills": 2
  },
  "resources": [
    {
      "name": "ki",
      "counttype": "table",
      "count": [[1,5],[2,6],[3,7],[4,8],[5,8],[6,9],[7,10],[8,11],[9,11],[10,12],[11,13],[12,14],[13,14],[14,15],[15,16],[16,17],[17,17],[18,18],[19,19],[20,20]],
      "minlevel": 2,
      "addToTable": true,
      "recovery": "shortrest"
    },
    {
      "name": "Martial Arts",
      "counttype": "table",
      "count": [[1, "1d6"],[5,"1d8"],[11,"1d10"],[17,"1d12"]],
      "minlevel": 1,
      "addToTable": true,
      "tableOnly": true,
      "recovery": "none"
    },
    {
      "name": "Unarmored Movement",
      "counttype": "table",
      "count": [[2, "+3m"],[6,"+4m"],[10,"+6m"],[14,"+7m"],[18,"+9m"]],
      "minlevel": 1,
      "addToTable": true,
      "tableOnly": true,
      "recovery": "none"
    }
  ],
  "features": [
    {
      "level": 1,
      "name": "Unarmored Defense",
      "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier and you gain protection points equal to your wisdom modifier times your level."
    },
    {
      "level": 1,
      "name": "Martial Arts",
      "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two-handed or heavy property.\n\nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield:\n\n* You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\n* You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\n* When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\n\nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon in chapter 5."
    },
    {
      "level": 2,
      "name": "Ki",
      "description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class. \n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nSome of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows:\n\nKi save DC = 8 + your proficiency bonus + your Wisdom modifier\n\n#### Flurry of Blows\n\nImmediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\n\n#### Patient Defense\n\nYou can spend 1 ki point to take the Dodge action as a bonus action on your turn.\n\n#### Step of the Wind\n\nYou can spend 1 ki point to take the Disengage and Dash actions as a bonus action on your turn, and your jump distance is doubled for the turn."
    },
    {
      "level": 2,
      "name": "Unarmored Movement",
      "description": "Starting at 2nd level, your speed increases by 2m while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
    },
    {
      "level": 9,
      "name": "Unarmored Movement Improvement",
      "description": "Starting at 2nd level, your speed increases by 2m while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
    },
    {
      "level": 2,
      "name": "Dedicated Weapon",
      "description": "You train yourself to use a variety of weapons as monk weapons, not just simple melee weapons. Whenever you finish a short or long rest, you can touch one weapon, focus your ki on it, and then count that weapon as a monk weapon until you use this feature again.\n\nThe chosen weapon must meet these criteria:\n\n* The weapon must be a simple or martial weapon.\n* You must be proficient with it.\n* It must lack the heavy and special properties."
    },
    {
      "level": 3,
      "name": "Ki-Fueled Attack",
      "description": "If you spend 1 ki point or more as part of your action on your turn, you can make one attack with an unarmed strike or a monk weapon as a bonus action before the end of the turn."
    },
    {
      "level": 2,
      "name": "Monastic Tradition",
      "description": "When you reach 2nd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 2nd level and again at 6th, 11th, and 17th level."
    },
    {
      "level": 6,
      "name": "Monastic Tradition Feature (6th)",
      "description": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
    },
    {
      "level": 10,
      "name": "Monastic Tradition Feature (10th)",
      "description": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
    },
    {
      "level": 14,
      "name": "Monastic Tradition Feature (14th)",
      "description": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
    },
    {
      "level": 3,
      "name": "Deflect Missiles",
      "description": "Starting at 3rd level, you can deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can use your reaction to catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 4,
      "name": "Quickened Healing",
      "description": "As an action, you can spend 2 ki points and roll a martial arts die. You regain a number of hit points equal to the number rolled plus your proficiency bonus."
    },
    {
      "level": 4,
      "name": "Slow Fall",
      "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
    },
    {
      "level": 4,
      "name": "Weapon Mastery",
      "description": "You unlock the maximum potential of the weapons you wield. You gain access to the weapon mastery property of any weapon you wield that you are proficient with. Additionally, your unarmed strikes gain the Sap property."
    },
    {
      "level": 5,
      "name": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
      "level": 5,
      "name": "Focused Aim",
      "description": "When you miss with an attack roll, you can spend 1 to 3 ki points to increase your attack roll by 2 for each of these ki points you spend, potentially turning the miss into a hit."
    },
    {
      "level": 5,
      "name": "Stunning Strike",
      "description": "Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
    },
    {
      "level": 5,
      "name": "Weapon Mastery",
      "description": "You unlock the maximum potential of the weapons you wield. You gain access to the weapon mastery property of any weapon you wield that you are proficient with. Additionally, your unarmed strikes gain the Sap property."
    },
    {
      "level": 6,
      "name": "Ki-Empowered Strikes",
      "description": "Starting at 6th level, your unarmed strikes gain a +1 bonus to attack and damage rolls."
    },
    {
      "level": 6,
      "name": "Improved Unarmored Defense",
      "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 11 + your Dexterity modifier + your Wisdom modifier."
    },
    {
      "level": 7,
      "name": "Evasion",
      "description": "At 7th level, your instinctive agility lets you dodge out of the way o f certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
    },
    {
      "level": 7,
      "name": "Stillness of Mind",
      "description": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."
    },
    {
      "level": 11,
      "name": "Purity of Body",
      "description": "At 11th level, your mastery of the ki flowing through you makes you immune to disease and poison."
    },
    {
      "level": 12,
      "name": "Superior Unarmored Defense",
      "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 12 + your Dexterity modifier + your Wisdom modifier."
    },
    {
      "level": 13,
      "name": "Tongue of the Sun and Moon",
      "description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
    },
    {
      "level": 15,
      "name": "Diamond Soul",
      "description": "Beginning at 15th level, your mastery of ki grants you proficiency in all saving throws.\n\nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
    },
    {
      "level": 17,
      "name": "Timeless Body",
      "description": "At 17th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water."
    },
    {
      "level": 18,
      "name": "Empty Body",
      "description": "Beginning at 18th level, you can use your bonus action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n\nAdditionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you."
    },
    {
      "level": 20,
      "name": "Perfect Self",
      "description": "At 20th level, when you roll for initiative you regain 4 ki points."
    }
  ],
  "subclass": [
    {
      "name": "Way of the Open Hand",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Open Hand Technique",
          "description": "Starting when you choose this tradition at 3rd level, you can manipulate your enemy’s ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target:\n\n* It is knocked prone.\n* You can push it up to 3m away from you.\n* It can’t take reactions until the end of your next turn."
        },
        {
          "level": 6,
          "name": "Wholeness of Body",
          "description": "At 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again."
        },
        {
          "level": 10,
          "name": "Tranquility",
          "description": "Beginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus."
        },
        {
          "level": 14,
          "name": "Quivering Palm",
          "description": "At 17th level, you gain the ability to set up lethal vibrations in someone’s body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage. You can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action."
        }
      ]
    },
    {
      "name": "Way of Shadow",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Shadow Arts",
          "description": "Starting when you choose this tradition at 3rd level, you can use your ki to duplicate the effects of certain spells. As an action, you can spend 2 ki points to cast darkness, darkvision, pass without trace, or silence, without providing material components. Additionally, you gain the minor illusion cantrip if you don’t already know it. When you cast the darkness spell with this feature, you can designate up to three willing creatures, these creatures gain the ability to see through the darkness you created. When you cast the darkvision spell with this feature, the target gains the ability to see through magical darkness for the duration of the spell."
        },
        {
          "level": 2,
          "name": "Darkvision",
          "description": "You gain the ability to see through magical darkness up to 12m."
        },
        {
          "level": 6,
          "name": "Shadow Step",
          "description": "At 6th level, you gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action you can teleport up to 12m to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end of the turn."
        },
        {
          "level": 10,
          "name": "Cloak of Shadows",
          "description": "By 10th level, you have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light."
        },
        {
          "level": 14,
          "name": "Opportunist",
          "description": "At 14th level, you can exploit a creature's momentary distraction when it is hit by an attack. Whenever a creature within your reach is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature."
        }
      ]
    },
    {
      "name": "Way of the Four Elements",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Disciple of the Elements",
          "description": "When you choose this tradition at 3rd level, you learn magical disciplines that harness the power of the four elements. A discipline requires you to spend ki points each time you use it.\n\nYou know the Elemental Attunement discipline and one other elemental discipline of your choice, which are detailed in the \"Elemental Disciplines\" section below. You learn an additional elemental discipline at each odd number monk level after this one (3rd, 5th, 7th, 9th, 11th, 13th, 15th, 17th, and 19th). Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.\n\n**Casting Elemental Spells.** Some elemental disciplines allow you to cast spells. See chapter 10 for the general rules of spellcasting. To cast one of these spells, you use its casting time and other rules, but you don’t need to provide material components for it.\n\nOnce you reach 5th level in this class, you can spend additional ki points to increase the level of an elemental discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as burning hands does. The spell's level increases by 1 for each additional ki point you spend. For example, if you are a 5th-level monk and use Sweeping Cinder Strike to cast burning hands, you can spend 2 ki points to cast it as a 2nd-level spell (the discipline’s base cost of 1 ki point plus 1).\n\nThe maximum number of ki points you can spend to cast a spell in this way (including its base ki point cost and any additional ki points you spend to increase its level) is equal to 1/4 of your monk level (rounded up).\n\n#### Elemental Disciplines\n\nThe elemental disciplines are presented in alphabetical order. If a discipline requires a level, you must be that level in this class to learn the discipline.\n\n**Breath of Winter (17th Level Required).** You can spend 5 ki points to cast cone of cold.\n\n**Clench of the North Wind (5th Level Required).** You can spend 2 ki points to cast hold person.\n\n**Elemental Attunement.** You can use your action to briefly control elemental forces within 6m of you, causing one of the following effects of your choice:\n\n* Create a harmless, instantaneous sensory effect related to air, earth, fire, or water, such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone.\n* Instantaneously light or snuff out a candle, a torch, or a small campfire.\n* Chill or warm up to 1 pound of nonliving material for up to 1 hour.\n* Cause earth, fire, water, or mist that can fit within a 1-foot cube to shape itself into a crude form you designate for 1 minute.\n\n**Eternal Mountain Defense (13th Level Required).** You can spend 4 ki points to cast stoneskin, targeting yourself.\n\n**Fangs of the Fire Snake.** When you use the Attack action on your turn, you can spend 1 ki point to cause tendrils of flame to stretch out from your fists and feet.\n\nYour reach with your unarmed strikes increases by 2m for that action, as well as the rest of the turn. A hit with such an attack deals fire damage instead of bludgeoning damage, and if the attack hits, it also deals an extra 1d10 fire damage.\n\n**Fist of Four Thunders.** You can spend 1 ki points to cast thunderwave.\n\n**Fist of Unbroken Air.** You can create a blast of compressed air that strikes like a mighty fist. As an action, you can spend 1 ki points and choose a creature within 6m of you. That creature must make a Strength saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can push the creature up to 4m away from you and knock it prone. On a successful save, the creature takes half as much damage, and you don’t push it or knock it prone.\n\n**Flames of the Phoenix (9th Level Required).** You can spend 3 ki points to cast fireball.\n\n**Gong of the Summit (5th Level Required). You can spend 2 ki points to cast shatter.\n\n**Mist Stance (9th Level Required).** You can spend 3 ki points to cast gaseous form, targeting yourself.\n\n**Ride the Wind (9th Level Required).** You can spend 3 ki points to cast fly, targeting yourself.\n\n**River of Hungry Flame (13th Level Required). You can spend 4 ki points to cast wall of fire.\n\n**Rush of the Gale Spirits.** You can spend 1 ki points to cast gust of wind.\n\n**Shape the Flowing River.** As an action, you can spend 1 ki point to choose an area of ice or water no larger than 6m on a side within 36m of you. You can change water to ice within the area and vice versa, and you can reshape ice in the area in any manner you choose. You can raise or lower the ice’s elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can’t exceed half the area’s largest dimension. For example, if you affect a 6m square, you can create a pillar up to 3m high, raise or lower the square’s elevation by up to 3m, dig a trench up to 3m deep, and so on. You can’t shape the ice to trap or injure a creature in the area.\n\n**Sweeping Cinder Strike.** You can spend 1 ki points to cast burning hands.\n\n**Water Whip.** You can spend 1 ki points as an action to create a whip of water that shoves and pulls a creature to unbalance it. A creature that you can see that is within 6m of you must make a Dexterity saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can either knock it prone or pull it up to 7m closer to you. On a successful save, the creature takes half as much damage, and you don’t pull it or knock it prone.\n\n**Wave of Rolling Earth (17th Level Required).** You can spend 5 ki points to cast wall of stone."
        }
      ]
    },
    {
      "name": "Way of the Long Death",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Touch of Death",
          "description": "Starting when you choose this tradition at 3rd level, your study of death allows you to extract vitality from another creature as it nears its demise. When you reduce a creature within your reach to 0 hit points, you gain temporary hit points equal to your Wisdom modifier + your monk level (minimum of 1 temporary hit point)."
        },
        {
          "level": 6,
          "name": "Hour of Reaping",
          "description": "At 6th level, you gain the ability to unsettle or terrify those around you as an action, for your soul has been touched by the shadow of death. When you take this action, each creature within 6m of you that can see you must succeed on a Wisdom saving throw or be frightened of you until the end of your next turn."
        },
        {
          "level": 10,
          "name": "Mastery of Death",
          "description": "Beginning at 10th level, you use your familiarity with death to escape its grasp. When you are reduced to 0 hit points, you can expend 1 ki point (no action required) to have 1 hit point instead."
        },
        {
          "level": 14,
          "name": "Touch of the Long Death",
          "description": "Starting at 14th level, your touch can channel the energy of death into a creature. As an action, you touch one creature within 1m of you, and you expend 1 to 10 ki points. The target must make a Constitution saving throw, and it takes 2d10 necrotic damage per ki point spent on a failed save, or half as much damage on a successful one."
        }
      ]
    },
    {
      "name": "Way of the Sun Soul",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Radiant Sun Bolt",
          "description": "Starting when you choose this tradition at 2nd level, you can hurl searing bolts of magical radiance.\n\nYou gain a ranged spell attack that you can use with the Attack action. The attack has a range of 6m. You are proficient with it, and you add your Dexterity modifier to its attack and damage rolls. Its damage is radiant, and its damage die is a d4. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\n\nWhen you use the Attack action on your turn to use this special attack, you can spend 1 ki point to make two additional attacks with it as a bonus action."
        },
        {
          "level": 6,
          "name": "Searing Arc Strike",
          "description": "At 6th level, you gain the ability to channel your ki into searing waves of energy. Immediately after you take the Attack action on your turn, you can spend 2 ki points to cast the 1st-level spell burning hands as a bonus action. You can spend additional ki points to cast burning hands as a higher level spell. Each additional ki point you spend increases the spell's level by 1. The maximum number of ki points (2 plus any additional points) that you can spend on the spell equals half your monk level (round down)."
        },
        {
          "level": 10,
          "name": "Searing Sunburst",
          "description": "At 10th level, you gain the ability to create an orb of light that erupts into a devastating explosion. As an action, you create an orb and hurl it at a point you choose within 30m, where it erupts into a sphere of radiant light for a brief but deadly instant.\n\nEach creature in that 4m radius sphere must succeed on a Constitution saving throw or take 2d6 radiant damage. A creature doesn't need to make the save if the creature is behind total cover that is opaque.\n\nYou can increase the sphere's damage by spending ki points. Each point you spend, up to a maximum of 3, increases the damage by 2d6."
        },
        {
          "level": 14,
          "name": "Sun Shield",
          "description": "At 14th level, you become wreathed in a luminous aura. You shed bright light in a 6m radius and dim light for an additional 6m. You can extinguish or restore the light as a bonus action.\n\nIf a creature hits you with a melee attack while this light shines, you can use your reaction to deal radiant damage to the creature. The radiant damage equals 5 + your Wisdom modifier."
        }
      ]
    },
    {
      "name": "Way of the Drunken Master",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Bonus Proficiencies",
          "description": "When you choose this tradition at 2nd level, you gain proficiency in the Performance skill if you don’t already have it. Your martial arts technique mixes combat training with the precision of a dancer and the antics of a jester. You also gain proficiency with brewer’s supplies if you don’t already have it."
        },
        {
          "level": 2,
          "name": "Drunken Technique",
          "description": "At 2nd level, you learn how to twist and turn quickly as part of your Flurry of Blows. Whenever you use Flurry of Blows, you gain the benefit of the Disengage action, and your walking speed increases by 2m until the end of the current turn."
        },
        {
          "level": 6,
          "name": "Tipsy Sway",
          "description": "Starting at 6th level, you can move in sudden, swaying ways. You gain the following benefits.\n\n**Leap to Your Feet.** When you’re prone, you can stand up by spending 1m of movement, rather than half your speed.\n\n**Redirect Attack.** When a creature misses you with a melee attack roll, you can spend 1 ki point as a reaction to cause that attack to hit one creature of your choice, other than the attacker, that you can see within 2m of you."
        },
        {
          "level": 10,
          "name": "Drunkard's Luck",
          "description": "Starting at l0th level, you always seem to get a lucky bounce at the right moment. When you make an ability check, an attack roll, or a saving throw and have disadvantage on the roll, you can spend 2 ki points to cancel the disadvantage for that roll."
        },
        {
          "level": 14,
          "name": "Intoxicated Frenzy",
          "description": "At 14th level, you gain the ability to make an overwhelming number of attacks against a group of enemies. When you use your Flurry of Blows, you can make up to three additional attacks with it (up to a total of five Flurry of Blows attacks), provided that each Flurry of Blows attack targets a different creature this turn."
        }
      ]
    },
    {
      "name": "Way of the Kensai",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Path of the Kensai",
          "description": "When you choose this tradition at 2nd level, your special martial arts training leads you to master the use of certain weapons. This path also includes instruction in the deft strokes of calligraphy or painting. You gain the following benefits.\n\n**Kensei Weapons.** Choose two types of weapons to be your kensei weapons: one melee weapon and one ranged weapon. Each of these weapons can be any simple or martial weapon that lacks the heavy and special properties. The longbow is also a valid choice. You gain proficiency with these weapons if you don’t already have it. Weapons of the chosen types are monk weapons for you. Many of this tradition’s features work only with your kensei weapons. When you reach 6th, 11th, and 17th level in this class. you can choose another type of weapon—either melee or ranged—to be a kensei weapon for you. following the criteria above.\n\n**Agile Parry.** If you make an unarmed strike as part of the Attack action on your turn and are holding a kensei weapon, you can use it to defend yourself if it is a melee weapon. You gain a +2 bonus to AC until the start of your next turn, while the weapon is in your hand and you aren't incapacitated.\n\n**Kensei’s Shot.** You can use a bonus action on your turn to make your ranged attacks with a kensei weapon more deadly. When you do so, any target you hit with a ranged attack using a kensei weapon takes an extra 1d4 damage of the weapons type. You retain this benefit until the end of the current turn.\n\n**Way of the Brush.** You gain proficiency with your choice of calligrapher's supplies or painter's supplies."
        },
        {
          "level": 6,
          "name": "One with the Blade",
          "description": "At 6th level, you extend your ki into your kensei weapons, granting you the following benefits.\n\n**Magic Kensei Weapons.** Your attacks with your kensei weapons gain a +1 bonus to attack and damage rolls unless they already have an equal or better bonus.\n\n**Deft Strike.** When you hit a target with a kensei weapon, you can spend 1 ki point to cause the weapon to deal extra damage to the target equal to your Martial Arts die. You can use this feature only once on each of your turns."
        },
        {
          "level": 10,
          "name": "Sharpen the Blade",
          "description": "At 10th level, you gain the ability to augment your weapons further with your ki. As a bonus action, you can expend up to 3 ki points to grant one kensei weapon you touch a bonus to attack and damage rolls when you attack with it. The bonus equals the number of ki points you spent. This bonus lasts for 1 minute or until you use this feature again. This feature has no effect on a magic weapon that already has a bonus to attack and damage rolls."
        },
        {
          "level": 14,
          "name": "Unerring Accuracy",
          "description": "At 14th level, your mastery of weapons grants you extraordinary accuracy. If you miss with an attack roll using a monk weapon on your turn, you can reroll it. You can use this feature only once on each of your turns."
        }
      ]
    },
    {
      "name": "Way of Mercy",
      "castermult": 0,
      "resources": [
        {
          "name": "Hand of Ultimate Mercy",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 14,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Implements of Mercy",
          "description": "You gain proficiency in the Insight and Medicine skills, and you gain proficiency with the herbalism kit.\n\nYou also gain a special mask, which you often wear when using the features of this subclass. You determine its appearance, or generate it randomly by rolling on the Merciful Mask table."
        },
        {
          "level": 2,
          "name": "Hand of Healing",
          "description": "Your mystical touch can mend wounds. As an action, you can spend 1 ki point to touch a creature and restore a number of hit points equal to a roll of your Martial Arts die + your Wisdom modifier.\n\nWhen you use your Flurry of Blows, you can replace one of the unarmed strikes with a use of this feature without spending a ki point for the healing."
        },
        {
          "level": 2,
          "name": "Hand of Harm",
          "description": "You use your ki to inflict wounds. When you hit a creature with an unarmed strike, you can spend 1 ki point to deal extra necrotic damage equal to one roll of your Martial Arts die + your Wisdom modifier. You can use this feature only once per turn."
        },
        {
          "level": 6,
          "name": "Physician's Touch",
          "description": "You can administer even greater cures with a touch, and if you feel its necessary, you can use your knowledge to cause harm.\n\nWhen you use Hand of Healing on a creature, you can also end one disease or one of the following conditions affecting the creature: blinded, deafened, paralyzed, poisoned, or stunned.\n\nWhen you use Hand of Harm on a creature, you can subject the creature to the poisoned condition until the end of your next turn."
        },
        {
          "level": 10,
          "name": "Flurry of Healing and Harm",
          "description": "You can now mete out a flurry of comfort and hurt. When you use Flurry of Blows, you can now replace each of the unarmed strikes with a use of your Hand of Healing, without spending ki points for the healing.\n\nIn addition, when you make an unarmed strike with Flurry of Blows, you can use Hand of Harm with that strike without spending the ki point for Hand of Harm. You can still use Hand of Harm only once per turn."
        },
        {
          "level": 14,
          "name": "Hand of Ultimate Mercy",
          "description": "Your mastery of life energy opens the door to the ultimate mercy. As an action, you can touch the corpse of a creature that died within the past 24 hours and expend 5 ki points. The creature then returns to life, regaining a number of hit points equal to 4d10 + your Wisdom modifier. If the creature died while subject to any of the following conditions, it revives with them removed: blinded, deafened, paralyzed, poisoned, and stunned.\n\nOnce you use this feature, you can't use it again until you finish a long rest."
        }
      ]
    },
    {
      "name": "Way of the Astral Self",
      "castermult": 0,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Arms of the Astral Self",
          "description": "Your mastery of your ki allows you to summon a portion of your astral self. As a bonus action, you can spend 1 ki point to summon the arms of your astral self. When you do so, each creature of your choice that you can see within 2m of you must succeed on a Dexterity saving throw or take force damage equal to two rolls of your Martial Arts die.\n\nFor 10 minutes, these spectral arms hover near your shoulders or surround your arms (your choice). You determine the arms' appearance, and they vanish early if you are incapacitated or die.\n\nWhile the spectral arms are present, you gain the following benefits:\n\n* You can use your Wisdom modifier in place of your Strength modifier when making Strength checks and Strength saving throws.\n* You can use the spectral arms to make unarmed strikes\n* When you make an unarmed strike with the arms on your turn, your reach for it is 2m greater than normal.\n* The unarmed strikes you make with the arms can use your Wisdom modifier in place of your Strength or Dexterity modifier for the attack and damage rolls, and their damage type is force."
        },
        {
          "level": 6,
          "name": "Visage of the Astral Self",
          "description": "You can summon the visage of  your astral self. As a bonus action, or as part of the bonus action you take to activate Arms of the Astral Self, you can spend 1 ki point to summon this visage for 10 minutes. It vanishes early if you are incapacitated or die.\n\nThe spectral visage covers your face like a helmet or mask. You determine its appearance.\n\nWhile the spectral visage is present, you gain the following benefits.\n\n**Astral Sight.** You can see normally in darkness, both magical and nonmagical, to a distance of 36m.\n\n**Wisdom of the Spirit.** You have advantage on Wisdom (Insight) and Charisma (Intimidation) checks.\n\n**Word of the Spirit.** When you speak, you can direct your words to a creature of your choice that you can see within 12m of you, making it so only that creature can hear you. Alternatively, you can amplify your voice so that all creatures within 180m can hear you."
        },
        {
          "level": 10,
          "name": "Body of the Astral Self",
          "description": "When you have both your astral arms and visage summoned, you can cause the body of your astral self to appear (no action required). This spectral body covers your physical form like a suit of armor, connecting with the arms and visage. You determine its appearance.\n\nWhile the spectral body is present, you gain the following benefits.\n\n**Deflect Energy.** When you take acid, cold, fire, force, lightning, or thunder damage, you can use your reaction to deflect it. When you do so, the damage you take is reduced by 1d10 + your Wisdom modifier (minimum reduction of 1).\n\n**Empowered Arms.** Once on each of your turns when you hit a target with the Arms of the Astral Self, you can deal extra damage to the target equal to your Martial Arts die."
        },
        {
          "level": 14,
          "name": "Awakened Astral Self",
          "description": "Your connection to your astral self is complete, allowing you to unleash its full potential. As a bonus action, you can spend 5 ki points to summon the arms, visage, and body of your astral self and awaken it for 10 minutes. This awakening ends early if you are incapacitated or die.\n\nWhile your astral self is awakened, you gain the following benefits.\n\n**Armor of the Spirit.** You gain a +2 bonus to Armor Class.\n\n**Astral Barrage.** Whenever you use the Extra Attack feature to attack twice, you can instead attack three times if all the attacks are made with your astral arms."
        }
      ]
    }
  ]
}