{
  "name": "Ranger",
  "level": 1,
  "hitdie": 10,
  "caststat": 4,
  "cantrips": 0,
  "cantriplevel": 1,
  "proficiencies": {
    "armor": ["light armor", "medium armor", "shields"],
    "weapons": ["simple weapons", "martial weapons"],
    "tools": [],
    "saving throws": ["str", "dex"],
    "numskills": 3
  },
  "equipment": [],
  "resources": [
    {
      "name": "Spells Known",
      "counttype": "table",
      "count": [[2, 3],[3,4],[5,5],[7,6],[9,7],[11,8],[13,9],[15,10],[17,11],[19,12]],
      "minlevel": 2,
      "addToTable": true,
      "recovery": "none"
    },
    {
      "name": "Nature's Veil",
      "counttype": "prof",
      "count": 0,
      "minlevel": 13,
      "recovery": "longrest"
    }
  ],
  "features": [
    {
      "level": 1,
      "name": "Fighting Style",
      "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\n\n#### Archery\n\nYou gain a +2 bonus to attack rolls you make with ranged weapons.\n\n#### Defense\n\nWhile you are wearing armor, you gain a +1 bonus to AC\n\n#### Dueling\n\nWhen you are weilding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n\n#### Two-Weapon Fighting\n\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\n\n#### Blind Fighting\n\nYou have blindsight with a range of 3m. Within that range you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\n\n#### Druidic Warrior\n\nYou learn two cantrips of your choice from the druid spell list. They count as ranger spells for you, and Wisdom is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the druid spell list.\n\n#### Thrown Weapon Fighting\n\nYou can draw a weapon that has the thrown property as part of the attack you make with the weapon.\n\nIn addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll."
    },
    {
      "level": 2,
      "name": "Combat Caster",
      "description": "You can use a 1-handed weapon with which you are proficient as a spellcasting focus."
    },
    {
      "level": 2,
      "name": "Spellcasting",
      "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.\n\n#### Spell Slots\n\nThe Ranger table shows how many spell slots you have to cast your ranger spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell animal friendship and have a 1st-level and a 2nd-level spell slot available, you can cast animal friendship using either slot.\n\n#### Spells Known of 1st Level and Higher\n\nYou know the hunter's mark spell and two 1st-level spells of your choice from the ranger spell list.\n\nThe Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nSpell attack modifier = your proficiency bonus + your Wisdom modifier."
    },
    {
      "level": 2,
      "name": "Spellcasting Focus",
      "description": "You can use a druidic focus as a spellcasting focus for your ranger spells. A druidic focus might be a sprig of mistletoe or holly, a wand or rod mode of yew or another special wood, a staff drawn whole from a living tree, or an object incorporating feathers, fur, bones, and teeth from sacred animals."
    },
    {
      "level": 2,
      "name": "Ranger Archetype",
      "description": "At 2nd level, you choose an archetype that you strive to emulate: Hunter or Beast Master, both detailed at the end o f the class description. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."
    },
    {
      "level": 3,
      "name": "Expertise",
      "description": "You gain expertise in two skills with which you are proficient."
    },
    {
      "level": 6,
      "name": "Ranger Archetype Feature",
      "description": "6th level ranger archetype feature."
    },
    {
      "level": 10,
      "name": "Ranger Archetype Feature",
      "description": "10th level ranger archetype feature."
    },
    {
      "level": 14,
      "name": "Ranger Archetype Feature",
      "description": "14th level ranger archetype feature."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 4,
      "name": "Weapon Mastery",
      "description": "You unlock the maximum potential of the weapons you wield. You gain access to the weapon mastery property of any weapon you wield."
    },
    {
      "level": 4,
      "name": "Martial Versatility",
      "description": "Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can replace a fighting style you know with another fighting style available to rangers. This replacement represents a shift of focus in your martial practice."
    },
    {
      "level": 4,
      "name": "Weapon Mastery",
      "description": "You unlock the maximum potential of the weapons you wield. You gain access to the weapon mastery property of any weapon you wield that you are proficient with. Additionally, your unarmed strikes gain the Sap property."
    },
    {
      "level": 5,
      "name": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
      "level": 7,
      "name": "Roving",
      "description": "Your speed increases by 3m so long as you aren't wearing heavy armor. You also have a climb speed and a swim speed equal to your speed."
    },
    {
      "level": 8,
      "name": "Land's Stride",
      "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
    },
    {
      "level": 9,
      "name": "Expertise",
      "description": "You gain expertise in two of your skill proficiencies of your choice."
    },
    {
      "level": 11,
      "name": "Tireless",
      "description": "Primal forces now help fuel you on your journeys, granting you the following benefits:\n\n* Whenever you finish a short or long rest you can give yourself temporary hit points equal to your ranger level.\n* If you are exhausted when you finish a short rest, your level of exhaustion decreases by 1."
    },
    {
      "level": 13,
      "name": "Nature's Veil",
      "description": "You draw on the powers of nature to hide yourself from view briefly. As a bonus action, you can magically become invisible, along with any equipment you are wearing or carrying until the  start of your next turn.\n\nYou can use this feature a number of time equal to your proficiency bonus and you regain all expended uses when you finish a long rest."
    },
    {
      "level": 15,
      "name": "Feral Senses",
      "description": "Your connection to the forces of nature grants you blindsight with a range of 9m."
    },
    {
      "level": 18,
      "name": "Foe Slayer",
      "description": "At 18th level, your hunter's mark spell improves, granting you 1d10 additional damage instead of 1d6 and you can cast it without requiring concentration."
    },
    {
      "level": 20,
      "name": "Unfettered",
      "description": "You cannot be held down. You can take the disengage action as a bonus action. Additonally when you take the disengage action you immediately end the grappled and restrained conditions on yourself."
    }
  ],
  "subclass": [
    {
      "name": "Beast Master",
      "castermult": 0.5,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Beast Master Magic",
          "description": "You learn additional spells when you reach certain levels in this class. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n* 2nd - Beast Bond\n* 5th - Summon Beast\n* 9th - Conjure Animals\n* 13th - Giant Insect\n* 17th - Commune with Nature"
        },
        {
          "level": 2,
          "name": "Animal Companion",
          "description": "At 3rd level, you gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a beast that is no larger than Medium and that has a challenge rating of 1/4 or lower. Add your proficiency bonus to the beast’s AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. Its hit point maximum equals its normal maximum or four times your ranger level, whichever is higher. The beast obeys your commands as best as it can. It takes its turn immediately after you, though it doesn’t take an action unless you command it to. On your turn, you can verbally command the beast where to move and to command it to take one of the Attack, Dash, Disengage, Dodge, or Help action (no action required by you). If the beast dies, you can obtain another one by spending 8 hours magically bonding with another beast that isn’t hostile to you, either the same type of beast as before or a different one."
        },
        {
          "level": 6,
          "name": "Beast's Defense",
          "description": "While your companion can see you, it has advantage on all saving throws."
        },
        {
          "level": 10,
          "name": "Storm of Claws and Fangs",
          "description": "Your companion can use its action to make a melee attack against each creature of its choice within its reach, with a separate attack roll for each target."
        },
        {
          "level": 14,
          "name": "Superior Beast's Defense",
          "description": "Whenever an attacker that your companion can see hits it with an attack, it can use its reaction to halve the attack’s damage against it."
        }
      ]
    },
    {
      "name": "Hunter Conclave",
      "castermult": 0.5,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Hunter's Magic",
          "description": "You learn additional spells when you reach certain levels in this class, as shown on the Hunter Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n* 2nd - Ensnaring Strike\n* 5th - Melf's Acid Arrow\n* 9th - Conjure Barrage\n* 13th - Guardian of Nature\n* 17th - Wrath of Nature"
        },
        {
          "level": 2,
          "name": "Hunter's Prey",
          "description": "You gain the following features, but can only use one of them each round.\n\n**Colossus Slayer.** Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage. You can deal this extra damage only once per turn.\n\n**Giant Killer.\n\n When a Large or larger creature within your reach hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.\n\n**Horde Breaker.** Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 2m of the original target and within range of your weapon."
        },
        {
          "level": 6,
          "name": "Evasion",
          "description": "When you are subjected to an effect that lets you make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving thrwo and only half damage if you fail. You can't use this feature if you have the incapacitated condition."
        },
        {
          "level": 10,
          "name": "Multiattack",
          "description": "You gain one of the following features of your choice.\n\n**Volley.** You can use your action to make a ranged attack against any number of creatures within 3m of a point you can see within your weapons range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target.\n\n**Whirlwind Attack.** You can use your action to make melee attacks against any number of creatures within your reach, with a separate attack roll for each target."
        },
        {
          "level": 14,
          "name": "Stand Against the Tide",
          "description": "When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice."
        }
      ]
    },
    {
      "name": "Gloom Stalker",
      "castermult": 0.5,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Gloom Stalker Magic",
          "description": "You learn an additional spell when you reach certain levels in this class, as shown in the Gloom Stalker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n* 2nd - disguise self\n* 5th - rope trick\n* 9th - fear\n* 13th - greater invisibility\n* 17th - seeming"
        },
        {
          "level": 2,
          "name": "Dread Ambusher",
          "description": "You master the art of the ambush. You can give yourself a bonus to your initiative rolls equal to your Wisdom modifier.\n\nAt the start of your first turn of each combat, your walking speed increases by 3m, which lasts until the end of that turn. Once per turn when you attack a creature and hit it with a weapon, you can deal an extra 1d8 psychic damage to the target. At 11th level in the class the extra damage increases to 2d8."
        },
        {
          "level": 6,
          "name": "Iron Mind",
          "description": "You have honed your ability to resist the mind—altering powers of your prey. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
        },
        {
          "level": 10,
          "name": "Stalker's Flurry",
          "description": "You learn to attack with such unexpected speed that you can turn a miss into another strike. Once on each of your turns when you miss with a weapon attack, you can make another weapon attack as part of the same action."
        },
        {
          "level": 14,
          "name": "Shadowy Dodge",
          "description": "You can dodge in unforeseen ways, with wisps of supernatural shadow around you. Whenever a creature makes an attack roll against you and doesn’t have advantage on the roll, you can use your reaction to impose disadvantage on it. You must use this feature before you know the outcome of the attack roll."
        }
      ]
    },
    {
      "name": "Horizon Walker",
      "castermult": 0.5,
      "resources": [
        {
          "name": "Ethereal Step",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 6,
          "recovery": "shortrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Horizon Walker Magic",
          "description": "You learn an additional spell when you reach certain levels in this class, as shown in the Horizon Walker Spells table. The spell counts as a ranger spell for you, but it doesn’t count against the number of ranger spells you know.\n\n* 2nd - protection from evil and good\n* 5th - misty step\n* 9th - haste\n* 13th - banishment\n* 17th - teleportation circle"
        },
        {
          "level": 2,
          "name": "Detect Portal",
          "description": "You gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\nSee the “Planar Travel” section in chapter 2 of the Dungeon Master’s Guide for examples of planar portals."
        },
        {
          "level": 2,
          "name": "Planar Warrior",
          "description": "You learn to draw on the energy of the multiverse to augment your attacks.\n\nOnce per turn, when you hit a creature with a weapon attack, you can choose to have all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage from the attack. When you reach 11th level in this class, the extra damage increases to 2d8."
        },
        {
          "level": 6,
          "name": "Ethereal Step",
          "description": "You learn to step through the Ethereal Plane. As a bonus action, you can cast the etherealness spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
        },
        {
          "level": 10,
          "name": "Distant Strike",
          "description": "You gain the ability to pass between the planes in the blink of an eye. When you take the Attack action, you can teleport up to 3m before each attack to an unoccupied space you can see.\n\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature."
        },
        {
          "level": 14,
          "name": "Spectral Defense",
          "description": "Your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack’s damage on this turn."
        }
      ]
    },
    {
      "name": "Monster Slayer",
      "castermult": 0.5,
      "resources": [
        {
          "name": "Hunter's Sense",
          "counttype": "WIS1",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Monster Slayer Magic",
          "description": "You learn an additional spell when you reach certain levels in this class, as shown in the Monster Slayer Spells table. The spell counts as a ranger spell for you, but it doesn’t count against the number of ranger spells you know.\n\n* 2nd - protection from evil and good\n* 5th - zone of truth\n* 9th - magic circle\n* 13th - banishment\n* 17th - hold monster"
        },
        {
          "level": 2,
          "name": "Hunter's Sense",
          "description": "You gain the ability to peer at a creature and magically discern how best to hurt it. As an action, choose one creature you can see within 18m of you. You immediately learn whether the creature has any damage immunities, resistances, or vulnerabilities and what they are. If the creature is hidden from divination magic, you sense that it has no damage immunities, resistances, or vulnerabilities.\n\nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Slayer's Prey",
          "description": "You can focus your ire on one foe, increasing the harm you inflict on it. Once per turn when you hit a creature with a weapon attack, you can deal an extra 1d8 damage of the weapon's damage type. When you reach 11th level in this class the extra damage increases to 2d8."
        },
        {
          "level": 6,
          "name": "Supernatural Defense",
          "description": "You gain extra resilience against your prey’s assaults on your mind and body. Whenever the target of your Slayer’s Prey forces you to make a saving throw and whenever you make an ability check to escape that targets grapple, add 1d6 to your roll."
        },
        {
          "level": 10,
          "name": "Magic-User's Nemesis",
          "description": "You gain the ability to thwart someone else’s magic. When you see a creature casting a spell or teleporting within 18m of you, you can use your reaction to try to magically foil it. The creature must succeed on a Wisdom saving throw against your spell save DC, or its spell or teleport fails and is wasted.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
        },
        {
          "level": 14,
          "name": "Slayer's Counter",
          "description": "You gain the ability to counterattack when your prey tries to sabotage you. If the target of your Slayer’s Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds, in addition to the attack’s normal effects."
        }
      ]
    },
    {
      "name": "Fey Wanderer",
      "castermult": "0.5",
      "resources": [
        {
          "name": "Misty Wanderer",
          "counttype": "WIS1",
          "count": 0,
          "minlevel": 14,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Dreadful Strikes",
          "description": "You can augment your weapon strikes with mind-scarring magic, drawn from the gloomy hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra 1d8 psychic damage to the target, which can take this extra damage only once per turn.\n\nThe extra damage increases to 2d8 when you reach 11th level in this class."
        },
        {
          "level": 2,
          "name": "Fey Wanderer Magic",
          "description": "You learn an additional spell when you reach certain levels in this class, as shown in the Fey Wanderer Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n* 2nd - Charm Person\n* 5th - misty step\n* 9th - dispel magic\n* 13th - dimension door\n* 17th - mislead\n\nYou also possess a preturnatural blessing from a fey ally or a place of fey power. Choose your blessing from the Feywild Gifts below or determine it randomly.\n\n1. Illusory butterflies flutter around you while you take a short or long rest.\n2. Fresh, seasonal flowers sprout from your hair each dawn.\n3. You faintly smell of cinnamon, lavender, nutmeg, or another comforting herb or spice.\n4. Your shadow dances while no one is looking directly at it.\n5. Horns or antlers sprout from your head.\n6. Your skin and hair change color to match the season at each dawn."
        },
        {
          "level": 2,
          "name": "Otherworldly Glamour",
          "description": "Your fey qualities gives you a supernatural charm. As a result, whenever you make a Charisma check, you gain a bonus to the check equal to your Wisdom modifier (minimum of +1).\n\nIn addition, you gain proficiency in one of the following skills of your choice: Deception, Performance, or Persuasion."
        },
        {
          "level": 6,
          "name": "Beguiling Twist",
          "description": "The magic of the Feywild guards your mind. You have advantage on saving throws against being charmed or frightened.\n\nIn addition, whenever you or a creature you can see within 36m of you succeeds on a saving throw against being charmed or frightened, you can use your reaction to force a different creature you can see within 36m of you to make a Wisdom saving throw against your spell save DC. If the save fails, the target is charmed or frightened by you (your choice) for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a successful save."
        },
        {
          "level": 10,
          "name": "Fey Reinforcements",
          "description": "The royal courts of the Feywild have blessed you with the assistance of fey beings: you know *summon fey*. It doesn't count against the number of ranger spells you know, and you can cast it without a material component. You can also cast it once as a 3rd level spell without a spell slot, and you regain the ability to do so when you finish a long rest.\n\nWhenever you start casting the spell, you can modify it so that it doesn't require concentration. If you do so, the spell's duration becomes 1 minute for that casting."
        },
        {
          "level": 14,
          "name": "Misty Wanderer",
          "description": "You can slip in and out of the Feywild to move in a blink of an eye: you can cast misty step without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a long rest.\n\nIn addition, whenever you cast misty step, you can bring along one willing creature you can see within 1m of you. That creature teleports to an unoccupied space of your choice within 1m of your destination space."
        }
      ]
    },
    {
      "name": "Swarmkeeper",
      "castermult": 0.5,
      "resources": [
        {
          "name": "Writhing Tide",
          "counttype": "prof",
          "count": 0,
          "minlevel": 6,
          "recovery": "longrest"
        },
        {
          "name": "Swarming Dispersal",
          "counttype": "prof",
          "count": 0,
          "minlevel": 14,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Gathered Swarm",
          "description": "A swarm of intangible nature spirits has bonded itself to you and can assist you in battle. Until you die, the swarm remains in your space, crawling on you or flying and skittering around you within your space. You determine its appearance, or you generate its appearance by rolling on the Swarm Appearance table.\n\nOnce on each of your turns, you can cause the swarm to assist you in one of the following ways, immediately after you hit a creature with an attack:\n\n* The attack's target takes 1d8 piercing damage from the swarm.\n* The attack's target must succeed on a Strength saving throw against your spell save DC or be moved by the swarm up to 4m horizontally in a direction of your choice.\n* You are moved by the swarm 2m horizontally in a direction of your choice."
        },
        {
          "level": 2,
          "name": "Swarmkeeper Magic",
          "description": "You learn the mage hand cantrip if you don't already know it. When you cast it, the hand takes the form of your swarming nature spirits.\n\nYou also learn an additional spell of 1st level or higher when you reach certain levels in this class, as shown in the Swarmkeeper Spells table. Each spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.\n\n* 2nd - faerie fire, mage hand\n* 5th - web\n* 9th - gaseous form\n* 13th - arcane eye\n* 17th - insect plague"
        },
        {
          "level": 6,
          "name": "Writhing Tide",
          "description": "You can condense part of your swarm into a focused mass that lifts you up. As a bonus action, you gain a flying speed of 3m and can hover. This effect lasts for 1 minute or until you are incapacitated.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        },
        {
          "level": 10,
          "name": "Mighty Swarm",
          "description": "Your Gathered Swarm grows mightier in the following ways.\n\n* The damage of Gather Swarm increases to 1d8.\n* If a creature fails its saving throw against being moved by Gathered Swarm, you can also cause the swarm to knock the creature prone.\n* When you are moved by Gathered Swarm, it gives you half cover until the start of your next turn."
        },
        {
          "level": 14,
          "name": "Swarming Dispersal",
          "description": "You can discorporate into your swarm, avoiding danger. When you take damage, you can use your reaction to give yourself resistance to that damage. You vanish into your swarm and then teleport to an unoccupied space that you can see within 9m of you, where you reappear with the swarm.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        }
      ]
    }
  ]
}