{
  "name": "Wizard",
  "level": 1,
  "hitdie": 6,
  "caststat": 3,
  "cantrips": 3,
  "cantriplevel": 1,
  "proficiencies": {
    "armor": [],
    "weapons": ["simple weapons"],
    "tools": [],
    "saving throws": ["intelligence", "wisdom"],
    "numskills": 2
  },
  "equipment": [
    "Spellbook"
  ],
  "resources": [
    {
      "name": "Arcane Recovery",
      "counttype": "fixed",
      "count": 1,
      "minlevel": 2,
      "recovery": "longrest"
    }
  ],
  "features": [
    {
      "level": 1,
      "name": "Spellcasting",
      "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. See chapter 10 for the general rules of spellcasting and chapter 11  for the wizard spell list.\n\n#### Cantrips\n\nAt 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table.\n\n#### Spellbook\n\nAt 1st level, you have a spellbook containing Scribe Spell as well as six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind.\n\n####Preparing and Casting Spells\n\nThe Wizard table shows how many spell slots you have to cast your wizard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of wizard spells that are available for you to cast. To do so. choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the  1st-level spell magic missile, you can cast it using a  1st-level or a 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least  1  minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability.In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Intelligence modifier\n\nSpell attack modifier = your proficiency bonus + your intelligence modifier\n\n#### Ritual Casting\n\nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared.\n\n#### Spellcasting Focus\n\nYou can use an arcane focus (found in chapter 5) as a spellcasting focus for your wizard spells.\n\n#### Learning Spells of 1st Level and Higher\n\nEach time you gain a wizard level, you can add two wizard spells of your choice to your spellbook. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see the “Your Spellbook” sidebar)."
    },
    {
      "level": 1,
      "name": "Arcane Recovery",
      "description": "You have learned to regain som e of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two  1st-level spell slots."
    },
    {
      "level": 1,
      "name": "Spellbook",
      "description": "Your Wizardly apprenticeship culminated in the creation of a unique book: your spellbook. It is a Tiny object that weighs 3 pounds, and it contains 100 pages, each of which can hold a spell. This magic book holds the wizardly spells you know, and it is a repository for your arcane findings. Writing in a magical cipher using the spell Scribe Spell, you have ensured that no one else can read the book without magic.\n\nThe book is vital to your Spellcasting feature, as explained there.\n\nOn your adventures you might find other spells that you can add to your spellbook using Scribe Spell. You can have more than one spellbook. You can create another one-perhaps as a backup or replacement-by casting Scribe Spell on a blank book. Doing so adds a spell as normal and makes the book your spellbook."
    },
    {
      "level": 2,
      "name": "Arcane Tradition",
      "description": "You choose an arcane tradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed at the end of the class description.\n\nYour choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
    },
    {
      "level": 6,
      "name": "Arcane Tradition Feature (6th)",
      "description": ""
    },
    {
      "level": 10,
      "name": "Arcane Tradition Feature (10th)",
      "description": ""
    },
    {
      "level": 14,
      "name": "Arcane Tradition Feature (14th)",
      "description": ""
    },
    {
      "level": 3,
      "name": "Cantrip Formulas",
      "description": "You have scribed a set of arcane formulas in your spellbook that you can use to formulate a cantrip in your mind. Whenever you finish a long rest and consult those formulas in your spellbook, you can replace one wizard cantrip you know with another cantrip from the wizard spell list."
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th,  12th,  16th, and  19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "level": 18,
      "name": "Spell Mastery",
      "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal.\n\nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
    },
    {
      "level": 20,
      "name": "Signature Spells",
      "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can’t do so again until you finish a short or long rest.\n\nIf you want to cast either spell at a higher level, you must expend a spell slot as normal."
    }
  ],
  "subclass": [
    {
      "name": "School of Necromancy",
      "castermult": 1,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Necromancy Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a necromancy spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Necromancy. As part of your studies you have memorized certain necromancy spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - False Life\n* 3rd - Ray of Enfeeblement\n* 5th - Summon Undead\n* 7th - Blight\n* 9th - Negative Energy Flood"
        },
        {
          "level": 2,
          "name": "Grim Harvest",
          "description": "At 2nd level, you gain the ability to reap life energy from creatures you damage with your spells. Once per turn when you damage one or more creatures with a spell of 1st level or higher, you regain hit points equal to twice the spell’s level, or three times its level if the spell belongs to the School of Necromancy. You don’t gain this benefit for killing constructs or undead."
        },
        {
          "level": 6,
          "name": "Undead Thralls",
          "description": "At 6th level, you add the animate dead spell to your spellbook if it is not there already. W hen you cast animate dead, you can target one additional corpse or pile of bones, creating another zombie or skeleton, as appropriate. Whenever you create or summon undead using a spell, it has additional benefits:\n\n* The creature’s hit point maximum is increased by an amount equal to your wizard level.\n* The creature adds your proficiency bonus to its weapon damage rolls."
        },
        {
          "level": 10,
          "name": "Inured to Undeath",
          "description": "Beginning at 10th level, you have resistance to necrotic damage, and your hit point maximum can't be reduced. You have spent so much time dealing with undead and the forces that animate them that you have becom e inured to som e of their worst effects."
        },
        {
          "level": 14,
          "name": "Command Undead",
          "description": "Starting at 14th level, you can use magic to bring undead under your control, even those created by other wizards. As an action, you can choose one undead that you can see within 12m of you. That creature must make a Charisma saving throw against your wizard spell save DC. If it succeeds, you can’t use this feature on it again. If it fails, it becomes friendly to you and obeys your commands until you use this feature again.Intelligent undead are harder to control in this way.\n\nIf the target has an Intelligence of 8 or higher, it has advantage on the saving throw. If it fails the saving throw and has an Intelligence of 12 or higher, it can repeat the saving throw at the end of every hour until it succeeds and breaks free."
        }
      ]
    },
    {
      "name": "School of Abjuration",
      "castermult": 1,
      "resources": [
        {
          "name": "Arcane Ward",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Abjuration Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an abjuration spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Arcane Ward",
          "description": "Starting at 2nd level, you can weave magic around yourself for protection. When you cast an abjuration spell of 1st level or higher, you can simultaneously use a strand of the spell’s magic to create a magical ward on yourself that lasts until you finish a long rest. The ward has hit points equal to twice your wizard level + your Intelligence modifier. Whenever you take damage, the ward takes the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage.\n\nWhile the ward has 0 hit points, it can’t absorb damage, but its magic remains. Whenever you cast an abjuration spell of 1st level or higher, the ward regains a number of hit points equal to twice the level of the spell. Once you create the ward, you can't create it again until you finish a long rest."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Abjuration. As part of your studies you have memorized certain abjuration spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Mage Armor\n* 3rd - Protection from Poison\n* 5th - Magic Circle\n* 7th - Freedom of Movement\n* 9th - Dispel Evil and Good"
        },
        {
          "level": 6,
          "name": "Projected Ward",
          "description": "Starting at 6th level, when a creature that you can see within 6m of you takes damage, you can use your reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the ward to 0 hit points, the warded creature takes any remaining damage."
        },
        {
          "level": 10,
          "name": "Improved Abjuration",
          "description": "Beginning at 10th level, when you cast an abjuration spell that requires you to make an ability check as a part of casting that spell (as in counterspell and dispel magic), you add your proficiency bonus to that ability check."
        },
        {
          "level": 14,
          "name": "Spell Resistance",
          "description": "Starting at 14th level, you have advantage on saving throws against spells.\n\nFurthermore, you have resistance against the damage of spells."
        }
      ]
    },
    {
      "name": "School of Conjuration",
      "castermult": 1,
      "resources": [
        {
          "name": "Benign Transposition",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 6,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Conjuration Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a conjuration spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Minor Conjuration",
          "description": "Starting at 2nd level when you select this school, you can use your action to conjure up an inanimate object in your hand or on the ground in an unoccupied space that you can see within 2m of you. This object can be no larger than 1m on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object that you have seen. The object is visibly magical, radiating dim light out to 2m.\n\nThe object disappears after 1 hour, when you use this feature again, or if it takes or deals any damage."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Conjuration. As part of your studies you have memorized certain conjuration spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Grease\n* 3rd - Misty Step\n* 5th - Summon Shadowspawn\n* 7th - Dimension Door\n* 9th - Cloudkill"
        },
        {
          "level": 6,
          "name": "Benign Transposition",
          "description": "Starting at 6th level, you can use your action to teleport up to 6m to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places.\n\nOnce you use this feature, you can’t use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher."
        },
        {
          "level": 10,
          "name": "Focused Conjuration",
          "description": "Beginning at 10th level, while you are concentrating on a conjuration spell, your concentration can’t be broken as a result of taking damage."
        },
        {
          "level": 14,
          "name": "Durable Summons",
          "description": "Starting at 14th level, any creature that you summon or create with a conjuration spell has 30 temporary hit points."
        }
      ]
    },
    {
      "name": "School of Diviniation",
      "castermult": 1,
      "resources": [
        {
          "name": "Portent",
          "counttype": "table",
          "count": [[2,2],[14,3]],
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Divination Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a divination spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Portent",
          "description": "Starting at 2nd level when you choose this school, glimpses of the future begin to press in on your awareness. When you finish a long rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.\n\nEach foretelling roll can be used only once. When you finish a long rest, you lose any unused foretelling rolls."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Divination. As part of your studies you have memorized certain divination spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Detect Magic\n* 3rd - See Invisibility\n* 5th - Tongues\n* 7th - Locate Creature\n* 9th - Legend Lore"
        },
        {
          "level": 6,
          "name": "Expert Divination",
          "description": "Beginning at 6th level, casting divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can’t be higher than 5th level."
        },
        {
          "level": 10,
          "name": "The Third Eye",
          "description": "Starting at 10th level, you can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can’t use the feature again until you finish a rest.\n\n**Darkvision.** You gain darkvision out to a range of 12m, as described in chapter 8.\n\n**Ethereal Sight.** You can see into the Ethereal Plane within 12m of you.\n\n**Greater Comprehension.** You can read any language.\n\n**See Invisibility.** You can see invisible creatures and objects within 2m of you that are within line of sight."
        },
        {
          "level": 14,
          "name": "Greater Portent",
          "description": "Starting at 14th level, the visions in your dreams intensify and paint a more accurate picture in your mind of what is to come. You roll three d20s for your Portent feature, rather than two."
        }
      ]
    },
    {
      "name": "School of Enchantment",
      "castermult": 1,
      "resources": [],
      "features": [
        {
          "level": 2,
          "name": "Enchantment Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an enchantment spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Hypnotic Gaze",
          "description": "Starting at 2nd level when you choose this school, your soft words and enchanting gaze can magically enthrall another creature. As an action, choose one creature that you can see within 2m of you. If the target can see or hear you, it must succeed on a Wisdom saving throw against your wizard spell save DC or be charmed by you until the end of your next turn. The charmed creature’s speed drops to 0, and the creature is incapacitated and visibly dazed.\n\nOn subsequent turns, you can use your action to maintain this effect, extending its duration until the end of your next turn. However, the effect ends if you move more than 2m away from the creature, if the creature can neither see nor hear you, or if the creature takes damage.\n\nOnce the effect ends, or if the creature succeeds on its initial saving throw against this effect, you can’t use this feature on that creature again until you finish a long rest."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Enchantment. As part of your studies you have memorized certain enchantment spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Command\n* 3rd - Calm Emotions\n* 5th - Enemies Abound\n* 7th - Dominate Beast\n* 9th - Hold Monster"
        },
        {
          "level": 6,
          "name": "Instinctive Charm",
          "description": "Beginning at 6th level, when a creature you can see within 6m of you makes an attack roll against you, you can use your reaction to divert the attack, provided that another creature is within the attack’s range. The attacker must make a Wisdom saving throw against your wizard spell save DC. On a failed save, the attacker must target the creature that is closest to it, not including you or itself. If multiple creatures are closest, the attacker chooses which one to target. On a successful save, you can’t use this feature on the attacker again until you finish a long rest.\n\nYou must choose to use this feature before knowing whether the attack hits or misses. Creatures that can’t be charmed are immune to this effect."
        },
        {
          "level": 10,
          "name": "Split Enchantment",
          "description": "Starting at 10th level, when you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature."
        },
        {
          "level": 14,
          "name": "Alter Memories",
          "description": "At 14th level, you gain the ability to make a creature unaware of your magical influence on it. When you cast an enchantment spell to charm one or more creatures, you can alter one creature’s understanding so that it remains unaware of being charmed.\n\nAdditionally, once before the spell expires, you can use your action to try to make the chosen creature forget some of the time it spent charmed. The creature must succeed on an Intelligence saving throw against your wizard spell save DC or lose a number of hours of its memories equal to 1 + your Charisma modifier (minimum 1). You can make the creature forget less time, and the amount of time can’t exceed the duration of your enchantment spell."
        }
      ]
    },
    {
      "name": "School of Evocation",
      "castermult": 1,
      "resources": [
        {
          "name": "Overchannel",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 14,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Evocation Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Sculpt Spells",
          "description": "Beginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell’s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Evocation. As part of your studies you have memorized certain evocation spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Chromatic Orb\n* 3rd - Shatter\n* 5th - Melf's Minute Meteors\n* 7th - Ice Storm\n* 9th - Wall of Stone"
        },
        {
          "level": 6,
          "name": "Potent Cantrip",
          "description": "Starting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip’s damage (if any) but suffers no additional effect from the cantrip. Additionally, when you deal damage with an evocation cantrip you can add your intelligence modifier to one damage roll of the spell."
        },
        {
          "level": 10,
          "name": "Empowered Evocation",
          "description": "Beginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast."
        },
        {
          "level": 14,
          "name": "Overchannel",
          "description": "Starting at 14th level, you can increase the power of your simpler spells. ���When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell.\n\nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity."
        }
      ]
    },
    {
      "name": "School of Illusion",
      "castermult": 1,
      "resources": [
        {
          "name": "Illusory Self",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 10,
          "recovery": "shortrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Illusion Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an illusion spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Improved Minor Illusion",
          "description": "When you choose this school at 2nd level, you learn the minor illusion cantrip. If you already know this cantrip, you learn a different wizard cantrip of your choice. The cantrip doesn’t count against your number of cantrips known.\n\nWhen you cast minor illusion, you can create both a sound and an image with a single casting of the spell."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Illusion. As part of your studies you have memorized certain illusion spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Silent Image\n* 3rd - Invisibility\n* 5th - Fear\n* 7th - Hallucinatory Terrain\n* 9th - Mislead"
        },
        {
          "level": 2,
          "name": "Malleable Illusions",
          "description": "When you cast an illusion spell that has a duration of 1 minute or longer, you can use your action to change the nature of that illusion (using the spell’s normal parameters for the illusion), provided that you can see the illusion."
        },
        {
          "level": 6,
          "name": "Illusory Self",
          "description": "You can create an illusory duplicate of yourself as an instant, almost instinctual reaction to danger. When a creature makes an attack roll against you, you can use your reaction to interpose the illusory duplicate between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest."
        },
        {
          "level": 10,
          "name": "Potent Illusions",
          "description": "You can give your illusions extra potency. As a reaction, when a creature makes a saving throw against an illusion spell you cast, or attempts an investigation or perception check to see through an illusion you created you can impose disadvantage on that check."
        },
        {
          "level": 14,
          "name": "Illusory Reality",
          "description": "By 14th level, you have learned the secret of weaving shadow magic into your illusions to give them a semireality. When you cast an illusion spell of 1st level or higher, you can choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as a bonus action while the spell is ongoing. The object remains real for 1 minute. For example, you can create an illusion of a bridge over a chasm and then make it real long enough for your allies to cross.\n\nThe object can’t deal damage or otherwise directly harm anyone."
        }
      ]
    },
    {
      "name": "School of Transmutation",
      "castermult": 1,
      "resources": [
        {
          "name": "Shapechanger",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 10,
          "recovery":"longrest"
        },
        {
          "name": "Master Transmuter",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 14,
          "recovery":"longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Transmutation Savant",
          "description": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a transmutation spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Minor Alchemy",
          "description": "Starting at 2nd level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot o f material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Transmutation. As part of your studies you have memorized certain transmutation spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Feather Fall\n* 3rd - Enhance Ability\n* 5th - Fly\n* 7th - Polymorph\n* 9th - Transmute Rock"
        },
        {
          "level": 6,
          "name": "Transmuter's Stone",
          "description": "Starting at 6th level, you can spend 8 hours creating a transmuter’s stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature’s possession. When you create the stone, choose the benefit from the following options:\n\n* Darkvision out to a range of 12m, as described in chapter 8\n* An increase to speed of 2m while the creature is unencumbered\n* Proficiency in Constitution saving throws\n* Resistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit)\n\nEach time you cast a transmutation spell of 1st level or higher, you can change the effect of your stone if the stone is on your person.\n\nIf you create a new transmuter’s stone, the previous one ceases to function."
        },
        {
          "level": 10,
          "name": "Shapechanger",
          "description": "At 10th level, you add the polymorph spell to your spellbook, if it is not there already. You can cast polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower.\n\nOnce you cast polymorph in this way, you can’t do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot."
        },
        {
          "level": 14,
          "name": "Master Transmuter",
          "description": "Starting at 14th level, you can use your action to consume the reserve of transmutation magic stored within your transmuter’s stone in a single burst. When you do so, choose one of the following effects. Your transmuter’s stone is destroyed and can’t be remade until you finish a long rest.\n\n**Major Transformation.** You can transmute one nonmagical object—no larger than a 5-foot cube—into another nonmagical object of similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n\n**Panacea.** You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter’s stone. The creature also regains all its hit points.\n\n**Restore Life.** You cast the heal spell on a creature you touch with the transmuter’s stone, without expending a spell slot or needing to have the spell in your spellbook.\n\n**Restore Youth.** You touch the transmuter’s stone to a willing creature, and that creature’s apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn’t extend the creature’s lifespan."
        }
      ]
    },
    {
      "name": "College of Bladesingers",
      "castermult": 1,
      "resources": [
        {
          "name": "Bladesong",
          "counttype": "prof",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Training in War and Song",
          "description": "When you adopt this tradition at 2nd level, you gain proficiency with light armor, and you gain proficiency with one type of one-handed melee weapon of your choice.\n\nYou also gain proficiency in the Performance skill if you don't already have it."
        },
        {
          "level": 2,
          "name": "Combat Caster",
          "description": "You can use a 1-handed weapon with which you are proficient as a spellcasting focus."
        },
        {
          "level": 2,
          "name": "Bladesong",
          "description": "You can invoke a secret elven magic called the Bladesong, provided that you aren't wearing medium or heavy armor. It graces you with supernatural speed, agility, and focus.\n\nYou can use a bonus action to start the Bladesong, which lasts for 1 minute. It ends early if you are incapacitated, if you don medium or heavy armor, or if you use two hands to make an attack with a weapon. You can also dismiss the Bladesong at any time you choose (no action required).\n\nWhile your Bladesong is active, you gain the following benefits:\n\n* you add your Intelligence modifier (minimum of +1) to the damage of your melee weapon attacks.\n* Your walking speed increases by 2m.\n* You have advantage on Dexterity (Acrobatics) checks.\n* You gain a bonus to any Constitution saving throw you make to maintain your concentration on a spell. The bonus equals your Intelligence modifier (minimum of +l).\n* You gain temporary hitpoints equal to twice your wizard level.\n\nYou can use this feature a number of times equal to your proficiency bonus, You regain all expended uses of it when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of weaving magic to enhance your combat prowess. As part of your studies you have memorized certain spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Longstrider\n* 3rd - Shadow Blade\n* 5th - Haste\n* 7th - Stoneskin\n* 9th - Steel Wind Strike"
        },
        {
          "level": 6,
          "name": "Extra Attack",
          "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn. Moreover, you can cast one of your cantrips in place of one of those attacks."
        },
        {
          "level": 10,
          "name": "Song of Victory",
          "description": "When you hit with a melee weapon attack while your bladesong is active you deal an additional 1d8 force damage."
        },
        {
          "level": 14,
          "name": "Song of Defense",
          "description": "When you reduce a creature to 0 hit points with a melee weapon attack while your bladaesong is active you gain an additional 5 temporary hit points, this stacks with the temporary hitpoints already granted by bladesong."
        }
      ]
    },
    {
      "name": "College of War Magic",
      "castermult": 1,
      "resources": [
        {
          "name": "Arcane Deflection",
          "counttype": "prof",
          "count": 0,
          "minlevel": 2,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Arcane Deflection",
          "description": "At 2nd level, you have learned to weave your magic to fortify yourself against harm. When you are hit by an attack or you fail a saving throw, you can use your reaction to gain a +2 bonus to your AC against that attack or a +4 bonus to that saving throw.\n\nYou can use this feature a number of times equal to your proficiency bonus and recover all expended uses when you finish a long rest."
        },
        {
          "level": 2,
          "name": "Tactical Wit",
          "description": "Starting at 2nd level, your keen ability to assess tactical situations allows you to act quickly in battle. You can give yourself a bonus to your initiative rolls equal to your Intelligence modifier."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Combat Magic. As part of your studies you have memorized certain combat spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - Magic Missile\n* 3rd - Flaming Sphere\n* 5th - Counterspell\n* 7th - Storm Sphere\n* 9th - Dawn"
        },
        {
          "level": 6,
          "name": "Power Surge",
          "description": "When you deal damage with a wizard cantrip you can add your intelligence modifier to the damage of the spell."
        },
        {
          "level": 10,
          "name": "Durable Magic",
          "description": "Beginning at 10th level, the magic you channel helps ward off harm. While you maintain concentration on a spell, you have a +2 bonus to AC and all saving throws."
        },
        {
          "level": 14,
          "name": "Deflecting Shroud",
          "description": "At 14th level, your Arcane Deflection becomes infused with deadly magic. When you use your Arcane Deflection feature, you can cause magical energy to arc from you. Up to three creatures of your choice that you can see within 12m of you each take force damage equal to half your wizard level."
        }
      ]
    },
    {
      "name": "Order of Scribes",
      "castermult": 1,
      "resources": [
        {
          "name": "Manifest Mind",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 6,
          "recovery": "longrest"
        },
        {
          "name": "One with the Word",
          "counttype": "fixed",
          "count": 1,
          "minlevel": 14,
          "recovery": "longrest"
        }
      ],
      "features": [
        {
          "level": 2,
          "name": "Wizardly Quill",
          "description": "As a bonus action, you can magically create a Tiny quill in your free hand. The magic quill has the following properties:\n\n* The quill doesn't require ink. When you write with it, it produces ink in a color of your choice on the writing surface.\n* The time you must spend to copy a spell into your spellbook equals 2 minutes per spell level if you use the quill for the transcription.\n* You can erase anything you write with the quill if you wave the feather over the text as a bonus action, provided the text is within 1m of you.\n\nThis quill disappears if you create another one or if you die."
        },
        {
          "level": 2,
          "name": "Awakened Spellbook",
          "description": "Using specially prepared inks and ancient incantations passed down by your wizardly order, you have awakened an arcane sentience within your spellbook.\n\nWhile you are holding the book, it grants you the following benefits:\n\n* You can use the book as a spellcasting focus for your wizard spells.\n* When you cast a wizard spell with a spell slot, you can temporarily replace its damage type with a type that appears in another spell in your spellbook, which magically alters the spell's formula for this casting only. The latter spell must be of the same level as the spell slot you expend.\n* When you cast a wizard spell as a ritual, you can use the spell's normal casting time, rather than adding 10 minutes to it. Once you use this benefit, you can't do so again until you finish a long rest.\n\nIf necessary, you can replace the book over the course of a short rest by using your Wizardly Quill to write arcane sigils in a blank book or a magic spellbook to which you're attuned. At the end of the rest, your spellbook's consciousness is summoned into the new book, which the consciousness transforms into your spellbook, along with all its spells. If the previous book still existed somewhere, all the spells vanish from its pages."
        },
        {
          "level": 2,
          "name": "Expanded Spellbook",
          "description": "You are studied in the art of Lore magic. As part of your studies you have memorized certain lore spells. Add the following spells to your spellbook at the level listed. Once you have added one of these spells to your spellbook, you always have it prepared, and it does not count against your maximum prepared spells.\n\n* 2nd - illusory script\n* 3rd - augury\n* 5th - glyph of warding\n* 7th - arcane eye\n* 9th - modify memory"
        },
        {
          "level": 6,
          "name": "Manifest Mind",
          "description": "You can conjure forth the mind of your Awakened Spellbook. As a bonus action while the book is on your person, you can cause the mind to manifest as a Tiny spectral object, hovering in an unoccupied space of your choice within 12m of you. The spectral mind is intangible and doesn't occupy its space, and it sheds dim light in a 10-foot radius. It looks like a ghostly tome, a cascade of text, or a scholar from the past (your choice).\n\nWhile manifested, the spectral mind can hear and see, and it has darkvision with a range of 12m. The mind can telepathically share with you what it sees and hears (no action required).\n\nWhenever you cast a wizard spell on your turn, you can cast it as if you were in the spectral mind's space, instead of your own, using its senses. You can do so a number of times per day equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nAs a bonus action, you can cause the spectral mind to hover up to 6m to an unoccupied space that you or it can see. It can pass through creatures but not objects.\n\nThe spectral mind stops manifesting if it is ever more than 90m away from you, if someone casts dispel magic on it, if the the Awakened Spellbook is destroyed, if you die, or if you dismiss the spectral mind as a bonus action.\n\nOnce you conjure the mind, you can't do so again until you finish a long rest, unless you expend a spell slot of any level to conjure it again."
        },
        {
          "level": 10,
          "name": "Master Scrivener",
          "description": "Whenever you finish a long rest, you can create one magic scroll by touching your Wizardly Quill to a blank piece of paper or parchment and causing one spell from your Awakened Spellbook to be copied onto the scroll. The spellbook must be within 1m of you when you make the scroll.\n\nThe chosen spell must be 1st or 2nd level and must have a casing time of 1 action. Once in the scroll, the spell's power is enhanced, counting as one level higher than normal. You can cast the spell from the scroll by reading it as an action. The scroll is unintelligible to anyone else, and the spell vanishes from the scroll when you cast it or when you finish your next long rest.\n\nYou are also adept at crafting spell scrolls, which are described in the treasure chapter of the Dungeon Master's Guide. The gold and time you must spend to make such a scroll are halved if you use your Wizardly Quill."
        },
        {
          "level": 14,
          "name": "One with the Word",
          "description": "Your connection to your Awakened Spellbook has become so profound that your soul has become entwined with it. While the book is on your person, you have advantage on all Intelligence (Arcana) checks, as the spellbook helps you remember magical lore.\n\nMoreover, if you take damage while your spellbook's mind is manifested, you can prevent all of that damage to you by using your reaction to dismiss the spectral mind, using its magic to save yourself. Then roll 3d6. The spellbook temporarily loses spells of your choice that have a combined spell level equal to that roll or higher. For example, if the roll's total is 9, spells vanish from the book that have a combined level of at least 9, which could mean one 9th-level spell, three 3rd-level spells, or some other combination. If there aren't enough spells in the book to cover this cost, you drop to 0 hit points.\n\nUntil you finish 1d6 long rests, you are incapable of casting the lost spells, even if you find them on a scroll or in another spellbook. After you finish the required number of rests, the spells reappear in the spellbook.\n\nOnce you use this reaction, you can't do so again until you finish a long rest."
        }
      ]
    }
  ]
}