{
  "name": "Guild Merchant",
  "description": "Instead of an artisans’ guild, you might belong to a guild o f traders, caravan masters, or shopkeepers. You don’t craft items yourself but earn a living by buying and selling the works o f others (or the raw materials artisans need to practice their craft). Your guild might be a large merchant consortium (or family) with interests across the region. Perhaps you transported goods from one place to another, by ship, wagon, or caravan, or bought them from traveling traders and sold them in your own little shop. In some ways, the traveling merchant’s life lends itself to adventure far more than the life of an artisan.",
  "skills": ["Insight", "Persuasion"],
  "tools": [],
  "languages": 2,
  "equipment": "A mule and cart, a letter of introduction from your guild, a set of traveler’s clothes, and a belt pouch containing 15 gp",
  "feature": {
    "name": "Guild Membership",
    "description": "As an established and respected member o f a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.\n\nGuilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild’s coffers. You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild’s good graces."
  },
  "characteristics": "Guild artisans are among the most ordinary people in the world—until they set down their tools and take up an adventuring career. They understand the value of hard work and the importance of community, but they’re vulnerable to sins of greed and covetousness."
}