{
  "name": "Knight of the Order",
  "description": "You belong to an order of knights who have sworn oaths to achieve a certain goal. The nature of this goal depends on the order you serve, but in your eyes it is without question a vital and honorable endeavor. Elthelas has a wide variety of knightly orders, all of which have a similar outlook concerning their actions and responsibilities.\n\nThough the term \"knight\" conjures ideas of mounted, heavily armored warriors of noble blood, most knightly orders in Elthelas don't restrict their membership to such individuals. The goals and philosophies of the order are more important than the gear and fighting style of its members, and so most of these orders aren't limited to fighting types, but are open to all sorts of folk who are willing to battle and die for the order's cause.\n\nCheck the Organizations page for details on some common knightly orders in Elthelas. Amathera's Shield, Black Guards of Mat'raktha, Champions of Cora, the Dormanian Imperial Guard, the Lords of the Rising Dawn, and the Silver Dragon Knights are good examples of Knightly Orders in Elthelas, however this is not an exclusive list.",
  "skills": [ "Persuasion", "one from among Arcana, History, Nature, and Religion as appropriate for your order."],
  "tools": ["One type of gaming set or musical instrument"],
  "languages": 1,
  "equipment": "One set of traveler's clothes, a signet, banner or seal representing your place or rank in the order, and a pouch containing 10 gp",
  "feature": {
    "name": "Knightly Regard",
    "description": "You receive shelter and succor from members of your knightly order and those who are sympathetic to its aims. If your order is a religious one, you can gain aid from temples and other religious communities of your deity. Knights of civic orders can get help from the community whether a lone settlement or a great nation that they serve, and knights of philosophical orders can find help from those they have aided in pursuit of their ideals, and those who share those ideals.\n\nThis help comes in the form of shelter and meals, and healing when appropriate, as well as occasionally risky assistance, such as a band of local citizens rallying to aid a sorely pressed knight in a fight, or those who support the order helping to smuggle a knight out of town when he or she is being hunted unjustly."
  },
  "characteristics": "Use the tables for the soldier background in the Player's Handbook as the basis for your traits and motivations, modifying the entries when appropriate to suit your identity as a knight of your order.\n\nYour bond almost always involves the order to which you belong (or at least key members of it), and it is highly unusual for a knight's ideal not to reflect the agenda, sentiment, or philosophy of one's order."
}