{"model":"History","documents":[{"start_date":{"year":"927","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Alfadir Colonized","text":"Staelia, since its founding, was an oppressive regime, with high taxes, mandatory military service, and strict laws.  By the 9th century many merchants had begun to resent this fact, dreaming of a merchant republic similar to that of the Morrind.  Eventually these merchants came together and formed a plan that they proposed to the king, they would leave Staelia to build colonies elsewhere, and in return they would sell whatever goods they produced exclusively to Staelia.\n\nThe king accepted their proposal, and the merchants left in 927, building towns in the largely empty southern territories of Hisru'de'tan.  They soon found that the King of Staelia had no way to enforce the bargain they had made with him however.  Trade with Zelfir, Hisru'de'tan, and Stagenheim was much more profitable than with martial-minded Staelia, and Staelia was too busy in its own never-ending war with the trolls and giants to try to enforce rules in its wayward colony.\n"}},{"start_date":{"year":"1236","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Alfadir gains independence","text":"Alfadir had been independent in all but name since its colonization, but as the trade around the world increased in the 12th and 13th centuries, Alfadir began having trouble with foreign sales of goods and recognition by foreign governments.  It came to a head in 1235 when Stagenheim, after a border despute, imposed harsh trade sanctions on Staelia. Because Alfadir was still nominally part of Staelia, the gnomes applied the restrictions to them as well.\n\nThis caused chaos in the markets of Alfadir, their primary advantage in trade was their navigable rivers that allowed them to transport goods down from the mountains of Stagenheim to the sea more cheaply than anyone else.  The merchant council sent an envoy to Staelia demanding formal independence, and threatening war if it wasn't granted.  The combined threat of rebellion in the west and war with the Stagen gnomes left the king little choice, he granted Alfadir formal independence."}},{"start_date":{"year":"1329","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Arad Colonized by Nerim","text":"Arad had been orcish territory for a very long time, but by 1329 the Neran empire's thirst for new land had grown to the point that even war with the orcs seemed worth the risk.\n\nThe first year of the war was incredibly successful.  The orcs were disorganized and unprepared for the attack and it took only a few months for the armies to secure a sizable territory.  Their incredible success was also their undoing, as the orcs fear enabled them to unite, if only for a short time, and halt the Empires expansion."},"end_date":{"year":"1330","month":"","day":""}},{"start_date":{"year":"1843","month":"11","day":"20"},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Aridhem falls to Orcish Assault","text":"Without the Crystal of Light, defending the Fortress of Light became much more difficult for the Alliance of 6 Nations, occupying more and more of their armies, meanwhile in late 1843, the Orcs began a concerted offensive through the Golden Pass.  By the end of 1843, the orcs had crushed the defensive fortresses in the pass and had begun a siege of the Moon Elf capitol, Aridhem.\n\nWith alliance forces still distracted attempting to defend the blighted gap, and 2 months into a siege against a far superior orcish force, Aridhem could hold out no longer.  Orcs poured into the streets as the Moon Elves attempted to flee.  The orcs, gleeful at their first major conquest of the war, burned the city to the ground, slaughtering everyone they found.  The results were nothing short of a disaster for the alliance, as the Orcs now controlled an uncontested route to the northern side of the mountains, and no significant alliance army was close enough to intercept the Orcs."},"end_date":{"year":"1844","month":"2","day":"10"}},{"start_date":{"year":"1410","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Black Shard Pass Constructed","text":"When Dorman I finished conquering the human kingdoms in the north, he wanted to move south into the orc kingdoms. In order to provide an additional route of attack for his armies, he set his best engineers and mages to building a traversable pass through the largely impassable mountains. They chose a likely spot, and literally set about destroying a mountain to create a low pass. They succeeded (as did Dorman's advance), but they discovered that the heart of the mountain had been made of almost pure obsidian."},"end_date":{"year":"1411","month":"","day":""}},{"start_date":{"year":"1782","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Conference of the 6 Nations of Northern Elathia","text":"The 6th Mithril War, and the amazing success of the dwarf, human, and moon elf alliance gave the Queen of Gerasalim an idea.  For years, the moon elves of Demal Thor, the dwarves of Curinor, and the humans of Gerasalim had fought off the orcs without coordination and with great difficulty.  Meanwhile the attacking orc armies had begun to grow in size and coordination.\n\nShe called the 5 nations back together, as well as inviting the young king of the very nation they had fought against, Eldoran, who had inherited the throne just the year before.  When the representatives arrived it was the first time the rulers of all of the good aligned nations on the mainland of Elathia had met together.  The decision of the council was simple and profound: the nations worshipping the good-aligned gods should no longer fight each other, but fight together against their common enemies.  It spawned a series of additional dicussions among diplomats from all 6 nations, eventually creating a new inter-governmental organization: the Alliance of 6 Nations, dedicated to the defence of the southern borders and the containment of the Orcs."}},{"start_date":{"year":"-480","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Curin Keep Construction","text":"The dwarves found themselves fragmented and surrounded by enemies at the end of the God's War, with most groups being killed off relatively early.  One of the major groups that survived was led by a dwarf named Curin Highhammer.  It was about 15 years after the end of the war that Curin proposed an end to searching for their kin, and that the dwarves put down roots and build a proper hold and temple to Dorun, where they could seek the aid of their patron God.  Legend has it that as he made the pronouncement, he struck the ground with his pick, and the rock face in front of him fell away revealing a massive vein of pure gold, and in that spot the dwarves began the delvings that would become known as Curin Keep.\n"},"end_date":{"year":"-460","month":"","day":""}},{"start_date":{"year":"1692","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dera'Dragorim takes control of Portsmith","text":"In 1691 a group of Dormanian explorers landed in Riftlan.  They built a small fort to attempt to establish a settlement, but were unprepared for the climate and foreign diseases and began struggling almost immediately.  In early 1692, the settlers had been reduced to half their original number by starvation and disease when they were discovered by a Deran patrol ship.  Dera'Dragorim, considering the north Riftlan coast to be their homeland and territory, immediately dispatched soldiers and settlers to take control of the fort.  By the time the settlers arrived, less than a dozen of the Dormanian settlers remained, and by the next month, all had died.  \n\nIt was a strange way for Dera'Dragorim to undertake reclaiming their homeland, but the colony persisted, largely held up by its proximity to the passes into the wilds, surviving on tourism and exporting rare materials found there."}},{"start_date":{"year":"-200","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Nation of Dera Founded","text":"Dera was the first true human nation on Elthelas, forming from a collection of city-states in northern Riftlan.  The wilds of Riftlan even then presented a unique challenge that cooperation and sharing of resources reduced greatly.  Rather than any of the city-states take presedence over the others, they decided to build a new capitol, the city of Dera."}},{"start_date":{"year":"1414","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Abdicates his Throne","text":"In 30 years, Dorman I had taken a relatively minor city state in the hills, and turned it into the capitol of the largest empire ever to be seen on Elthelas.  He ruled more people, and controlled more territory than anyone else in a historical period where Elathia and its surrounds was dominated by massive empires.  The Neran Empire in the southeast, Malinval in the southwest the Elves to the northwest, and Dorman in the northeast.  Only Curinor stood unconquered, Dorman's one great failure.  Nevertheless at age 51, Dorman was tired of the complicated court politics that came with ruling such a vast territory.  His eldest son, a promising young man of 25 had been handling many of the administrative duties of the empire already, and was a skilled politician and general in his own right.\n\nEqually, Dorman began to come face to face with his own mortality, and like all challenges in his life, decided it was time to overcome it.  1414 saw Dorman abdicate his throne and begin a mythical quest that would ultimately lead to his ascension to Godhood.  The details of that quest are shrouded in mystery."}},{"start_date":{"year":"1418","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Ascension to Godhood Confirmed","text":"Followers of Dorman had for the 4 years since his abdication been constantly seeking information on th wherabouts and trials undergone by Dorman I.  Dorman II, knowing of his fathers goals, established a priesthood that sought constantly to see if Dorman had risen to the status of a God who could grant divine power.  In 1418 it was confirmed that Dorman could be communed with as a God, and could grant his followers divine power and guidance.  Dorman II immediately declared Dorman the patron God of the Empire of Dormania, with the Emperor as the official leader of the faith."}},{"start_date":{"year":"1409","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Betrays and Conquers the Gerasaline Alliance Kingdoms","text":"9 years before, in 1400, Dorman I had signed a treaty with the Gerasaline Alliance, promising them aid against the orcs in return for mutual non-aggression.  This was useful for Dorman so long as he remained at war with the dwarves in the north, but once peace was declared with Curinor, that peace with the Gerasaline Alliance would be short-lived.\n\nIn 1409, Dorman informed the Gerasaline Alliance that since his other wars were finished, he would be dedicating all of his legions to the defense of their southern border.  He immediately sent half of his legions to the southern border, while positioning the rest in camps in southern Kandor.  The legions in the south were there only a week when they turned on the armies of the other Gerasaline nations.  The surprised Gerasaline armies were cut off and quickly dispatched.  Meanwhile Dorman's other legions attacked the Gerasaline nations from their relatively undefended northern border.  By the end of 1409 the Gerasaline alliance was no more, it's nations nothing but conquered ruins.\n\nDorman was particularly harsh on the cities of Gerasalim.  He burned every settlement larger than a few hundred people to the ground, and ordered mass relocations to cities constructed by his own engineers."},"end_date":{"year":"1410","month":"","day":""}},{"start_date":{"year":"1390","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Conquers Southern Dormania","text":"The south of Dormania was far less populous than the Imperial heartland but nevertheless provided the first stiff resistance Dorman encountered.  Malidal in particular was ruled by a powerful and intelligent archmage who successfully countered many of Dorman's attempted tricks.  Nevertheless Dorman was successful over only a couple of years in conquering all of southern Dormania."},"end_date":{"year":"1392","month":"","day":""}},{"start_date":{"year":"1401","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Sieges Curin Keep","text":"In 1400 YFC, after successfully subdueing the Kandori, Dorman's next target was the vassal kingdoms of Curinor in the hills on the western edge of Kandor.  Populated by a mix of dwarves and humans, and not technically subject to the Dwarves, Dorman was convinced his reputation would keep the Dwarves from intervening because they would not want to try to fight him given that he was not threatening them directly.  This was probably the greatest strategic miscalculation Dorman ever made.\n\nWhile Dorman had no trouble conquering the vassal states, Curinor immediately declared war and mustered large armies to push back against Dorman.  The initial fighting was bloody, but Dorman managed to continue his string of victories, but he couldn't pin down the dwarves, who strategically retreated to their holds every time he thought he had them. Frustrated with his inability to beat the dwarves decisively, Dorman marched on their capitol, Curin Keep, and in the summer of 1401, laid siege.\n\nThe siege would last for 7 years, with Dorman's armies constantly harried by Dwarven units, and Curin Keep never showing signs of starvation or struggle.  Even in 1401, the great tunnels connecting the holds was a closely guarded secret, and one that meant Dorman could never starve out the Dwarves of Curin Keep.  He attempted assaults three times, but the stiff Dwarven fortifications and their skill at tunnel fighting and tactics meant Dorman was forced to retreat each time after taking heavy casualties.  Finally in 1408 Dorman gave up, and signed a peace treaty with the dwarves.  The old vassal kingdoms were split, half becoming permanently part of Curinor, and the other half becoming part of Dormania."},"end_date":{"year":"1408","month":"","day":""}},{"start_date":{"year":"1410","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Attempts Conquest of Northern Malinval","text":"With Gerasalim subdued, Dorman I needed to protect his southern border from the ever aggressive Orcs.  Rather than set up defensive fortifications and hunker down as the Gerasaline Alliance had done, his ambition was greater.  His campaign was not just conquest as previous ones had been, but extermination, and for 2 years he continually pushed further into Orcish territory.  His spies moved in the circles of the Orcish warlords, breeding distrust and preventing them from working together.  Nevertheless Dorman could not maintain the campaign.  The shear size of the territory he was trying to conquer, combined with the lack of local resources to use meant his supply lines became far too long to maintain.\n\nIn 1412 he ended the campaign of conquest, and began building fortifications and bringing in colonists to maintain the territory.  The Dormanian Empire would never be larger, stretching from Curinor to the Eastern Ocean and from the Ice Ocean to the shadow of Dal Okra."},"end_date":{"year":"1412","month":"","day":""}},{"start_date":{"year":"1395","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Conquers Sreppe and Kandor","text":"After conquering southern Dormania it took Dorman a few years to successfully digest his conquests up to that point.  He destroyed remnants of the old regimes, destroyed records, and generally crushed any remnants of the previous cultures that were not useful to him.  Once he felt secure in his powerbase in the east, he began to move west.\n\nThe kingdoms and city states west of the Dormanian Heartland were not blind to Dorman's ambitions, and sought allies to the south in the form of the Gerasaline alliance, a preexisting alliance of martial city states and small kingdoms that maintained a mutual defense treaty in the face of continual orcish aggression.  However, Dorman got to them first.  Dorman promised the alliance that he would leave them alone, and, once he had conquered the northern territories, that he would send his best legions to help them secure the border.  They agreed, and the farming communities of Western Dormania and Kandor found themselves outnumbered and outmaneuvered.  In another two year war, Dorman swept through the Kandori plains and began the process of integrating them into his empire."},"end_date":{"year":"1400","month":"","day":""}},{"start_date":{"year":"1384","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Becomes King of Desadorel","text":"Desadorel, before it became capitol of an empire, was a small city state that relied on mining for most of its wealth.  In 1363 a local miner had a son who named Dorman.  Dorman grew up in the mines before enlisting in the military at 16.  His gift for fighting was recognized early, and by the age of 18 he had risen to Captain of the City Guard, then the next year he was made a personal advisor to the King, then when in 1384 the King died suddenly of a heart attack.  He had a 3 year old heir, but Dorman convincingly made the argument that the city needed stability and strength, and with the backing of most of the cities wealthy merchants and the army he killed the kings heir and several supporters of his in the court before being crowned King of Desadorel by the local priest of Alohim."}},{"start_date":{"year":"1386","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman I Unites the Imperial 'Heartland'","text":"When Dorman I became King of Desadorel it was one of a cluster of human city states in Northeast Elathia that all shared similar cultural practices.  After spending a couple of years consolidating his power in Desadorel and expanding his armies, the depth of his ambition started to show.  First Desadorel's two nearest neighbors, their names now lost to history, were crushed in a lightning-fast war.  He renamed both cities in his own honor (today they are East Dormania and West Dormania) and declared the resulting kingdom the Empire of Dormania, and himself Emperor.  Then in 1388 he declared war on his closest true rival, the city state of Falak.\n\nFalak was the largest city in the area at the time, controlling the trade on the (now named) Dorman River.  Dorman put the city under siege with his main force, before teleporting himself and his 6 best men into the royal palace.  The 7 of them managed to kill the king, his retinue, and their personal guards before carving their way to the city gates and openning them for the besieging army. The next two cities he besieged surrendered without a fight, the Unification Wars, and Dorman I quest to rule the world had officially begun."},"end_date":{"year":"1389","month":"","day":""}},{"start_date":{"year":"0","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"First contact between dwarves of Curinor and Morrindim","text":"The dwarves after the Gods War had been split into 2 primary groups.  One found themselves in a mountain range on Elathia, while the other found themselves on an archipelago.  The Morrindim, those who had found themselves on the archipelago, became the first inventors of ocean-going vessels, with the first ones setting sail around -20 YFC.  It wasn't long before they were encountering other cultures and setting up trade relations.  In 0 YFC (the events of which mark the start of the calendar still in use today) the Morrindim finally made contact with the mountain delving dwarves of Curinor."}},{"start_date":{"year":"1844","month":"4","day":"17"},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Dorman XXII and His Heirs are Murdered ","text":"Dorman XXII had not been a particularly skilled Emperor, and dissent in the empire had been great, particularly outside of the heartland.  Then on the 17th of Sylvanus, 1844, he mysteriously fell from the highest window of his tallest tower.  Within hours, his infant son and heir was found suffocated in his bed.  The Empire was left without a ruler for the first time since its founding."}},{"start_date":{"year":"432","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Eldoran founds first elven colonies on Elathia","text":"For the first 800 or so years of their history the elves were an insular people, trading a little with the Morrind, but otherwise keeping to themselves on the huge forested subcontinent of Eldoran.  It was in the 5th century YFC that that changed, as pressures of population growth and a desire for natural resources not available on Eldoran had them sending ships to other places.  They founded colonies on the main continental body of Elathia, and for the next 300 years they would continually expand into that land, only stopping when they encountered strong organized resistance from the dwarves of Curinor and the ancient Gerasaline city states."}},{"start_date":{"year":"729","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Colonization of Shendarel by Eldoran","text":"The island of Olda had been the domain of Orcs and Goblins since the end of the Gods War.  A fact that had prevented the elves from inhabiting one of their closest neighbors for years. With plenty of easily conquered territory on the mainland, the elves abandoned early efforts to colonize the island. By early in the 8th century they had begun to encounter severe resistance to further expansion into Elathia, and rather than risk all-out-war with the dwarves or humans over what they considered subpar land (or rather, unforested grasslands), they decided it would be more worthwhile to try to push the Orcs out of Olda.  \n\nArmies were dispatched, and the Orcs were quickly pushed to the southern half of the island.  Colonists followed the armies, founding the city of Swava.  The elves called this new territory Shendarel (or 'Southern Land of the Elves'), and determined that it would be a jumping off point for further invasion of Malinval, a possibility that did not escape the Orcs.  Orcish reinforcements arrived from the mainland and pushed the elven armies to a stalemate, neither side has ever been able to gain a decisive advantage since, as any shift in the winds brought reinforcements from the respective homelands, and neither side saw it as worth the forces it would take to push the other off the island completely."}},{"start_date":{"year":"1843","month":"4","day":"17"},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Epic of Elthelas Book 1: The Crystal of Light","text":"1843 saw the fighting on the border become increasingly intense.  The orcs began working in concert, sending larger armies on coordinated strategic attacks and raids.  The Alliance began recruiting heavily to attempt to counter what they assumed was the rise of a new Orc Warlord.  Then the Crystal of Light, hanging over the Fortress of Light, disappeared in the night.  A group of new recruits was blamed and imprisoned, but quickly escaped.  \n\nThe escaped recruits proved to be capable adventurers, chasing the true thieves across Malinval.  They were there when a demonic gate openned in the Morrind city Marinda.  They finally caught the thieves as they attempted to rob the Mages Guild of Morrindim.  The thieves, a group of Stagen Gnome rogues, refused to give up the crystal, blowing up their airship, and the crystal.  The corpse of one of the recruits was then stolen by a strange and incredibly powerful extraplanar being calling itself 'Me'.\n\nThis being was pursued by the remaining adventurers to the shores of Gnarra, where they barely stopped it from taking control of the Goddess Gaian.  Gaian awoke, and she and Amathera aided the adventurers in pursuing and defeating the being."},"end_date":{"year":"1843","month":"11","day":"7"}},{"start_date":{"year":"1844","month":"5","day":"35"},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Epic of Elthelas Book 2: The Rise of Gods","text":"In the late spring of 1844, a group of adventurers came together in a small town in southern Gerasalim to deal with some unusual troubles it was having.  It soon became clear that the toubles the town was having were being caused by a particular troublesome bard, by the name of Galen.  Galen had been presumed dead after falling from an exploding airship in Morrindim.  They followed him across the south, encountering another of the adventurers from Book 1, Jim Jimmy Jim Jim, the already crazed gnomish wizard, now driven insane by the crystal keeping 'Me' imprisoned.  He passed the crystal to this new group of adventurers, charging the half-dwarf Ralf with its protection.\n\nThe adventurers pursued Galen to Aridhem, where they worked with the Alliance General there to infiltrate the city.  Once there, Dench Stormclaw, last survivor of the Stormclaw clan that had previously ruled Morda'serek'hai, instigated a rebellion with the aid of his old vassals.  They followed Galen into a group of caves beneath the city, where they followed him into a teleportation portal that led to the Mountain of Fang in the desert of Nerim.\n\nAfter escaping the desert, they pursued Galen to orcish territory, where they encountered invading demons, and continued following him to Degak'Ta, and then to Marinda.  There the hero Rhakheim, Paladin of Dorman, closed the demon gate and together they faced Galen, finally killing him, only to have Ralf be mind controlled by the creature within the crystal.\n\nThey travelled back into orcish territory, retreiving Nera's god-killing dagger from the ruins of Peloria, and faced the now freed creature known as 'Me', who with its memory restored, declared that she was the long imprisoned Goddess Area, Queen of Rebirth and Retribution, and declared her intent to take her revenge on the goddess of Death herself, Nera, an act that would surely restart the Gods War.\n\nTaking aid from the Earth Goddess Gaian, the adventurers travelled to Nerim's Palace, at the conflux of the positive and negative energy planes, and fighting throw Area's servants, returned Nera's dagger to her.  Nera struck down Area, and the released divine energy turned the adventurers present into Angelic beings, now direct servants of their Gods.  All except the aethiest Trollkin Fighter and mercenary, Butch, who returned to Elthelas."},"end_date":{"year":"1844","month":"12","day":"30"}},{"start_date":{"year":"1845","month":"6","day":"1"},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Epic of Elthelas Book 3: The Succession Crisis","text":"In Progress"},"end_date":{"year":"1845","month":"11","day":"3"}},{"start_date":{"year":"642","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Fall of Dera","text":"Dera was the first truly powerful nation to arise after the end of the God's War. Bringing together the many disparate groups who found themselves in Riftlan. It is said that only a few cities have ever rivalled Dera in splendor and wealth. At its peak at the beginning of the 7th century YFC the empire stretched from the Demon Peaks to the south and west to the northern shores of Riftlan. Yet the empire was mostly peaceful, with few enemies besides occasional monsters drifting through the weak planar boundaries, and it was unprepared for the cataclysm to come.\n\nIn the early morning on a fateful day in 642, a planar gate opened. It is unknown whether this gate was opened by some enterprising young mage with little thought for protective spells, or if it simply ocurred as one of the random planar fluxes of Riftlan, but for some time the gate sat undisturbed, alone, high in the mountains of northern Dera. Then one day demons began pouring through it, led by powerful demon lords. The demons fell on the unsuspecting citizens of Dera burning and slaughtering everyone in their wake. Few escaped to bring warning to those further out, and at first no one believed their tales of an army of demons on the march. Until that army arrived at the gates of the Great City itself. The walls of Dera had not been built to withstand sieges, but rather for beauty and the regulation of trade. Thus when the demons came there was little hope for the city but to try and get as many people away as possible. The college of mages organized an effort to teleport as many people away as they could before the Demons fell on the city. Less than 2000 of the nearly one million inhabitants escaped. But it was enough.\n\nThose who lived yet further out from the invasion had warning, and fled to the coast. There they prepared to make their stand forging from amongst themselves a ragtag army, every able man and woman taking up arms of some sort, and as the demons approached, salvation came. From the clouds swooped in dragons of every size and stripe, at their head a massive dragon covered in glistening scales of platinum. Inspired by the bravery of the people of Dera, Bahamut had sent his avatar and his people to intervene. The demons were routed and fled and many of their demon lords were slain. Those that survived were harried into the Demon Peaks, where they hid from Bahamut's retribution. The demonic gate was sealed by ancient dragon sorcerers, and as a final act of mercy, the dragons carried the people of Dera to a new land, islands far off the coast of Riftlan, and one of their number, a great gold dragon, was left behind to serve as a benevolent king. Their new kingdom was Dera'Dragorim and the twin cities that formed its capital named after great dragons who fell in the defense of the people, Vasha and Vashna."}},{"start_date":{"year":"1784","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Fortress of Light Constructed","text":"The Creation of the Alliance of 6 Nations necessitated building a new headquarters.  They decided to build a massive fortress at the center of the Blighted Gap that would serve as the central staging ground for alliance efforts.  Construction was headed by dwarven engineers and runesmiths.  Meanwhile the elves contributed their greatest find of the modern era, a massive crystal that emitted a powerful antimagic field that stretched for miles.  The wizards of Malidal devised an elaborate control mechanism that enabled wizards and clerics inside the fortress wearing special devices could still cast spells, while other casters could not.  The field prevented unauthorized teleportation, destructive spells and more from affecting the fortress.\n\nOver the next several decades the orcs would throw themselves at the fortress repeatedly, only to have their armies destroyed against its walls in a series of massive defeats."},"end_date":{"year":"1789","month":"","day":""}},{"start_date":{"year":"1553","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Gerasalim Becomes Independent","text":"The Dormanian Empire waned quickly after its meteoric rise. After Dorman I and Dorman II, a series of rather witless emperors took the throne who lost territory to the orcs, wasted resources on expensive public works projects, encouraged corruption, and lavished themselves in all the riches a continent spanning empire provides. Finally during the reign of Dorman V things came to a head. Towards the middle of his reign, in 1553, he pulled several of the legions out of southern Gerasalim in order to quell minor rebellions near the capital over exorbitant taxes (levied to pay back wages for laborers and mages involved in the construction of the Great Ramp 6 years before).\n\nThe very same year, several of the more powerful warlords took it on themselves to move northward across the mountains into Gerasalim. The weakened garrisons were overwhelmed, and by the time the legions returned in early 1554 the orcs had swept as far north as the southern shores of Lake Saria. The legion commanders, local men themselves, along with most of their men, immediately fought back, but also published a letter of support for independence from the empire. The local nobility, unable to agree on one man to lead such a kingdom did something truly unique for that time and place. They put it to a vote of the commons. Dominic Patraeus Orsellus, Commander of the 33rd Legion, was thus elected the first king of Gerasalim, Lord of Eastguard, and defender of the Blighted Gap. Dorman V, incompetent to the last, sent orders to Dominic to put down the rebellion, only to find them ignored and Northport placed under seige. Before the year was out there was not a soldier loyal to the empire left in Gerasalim."},"end_date":{"year":"1554","month":"","day":""}},{"start_date":{"year":"-500","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"God's War","text":"The God's War refers to a period of unknown length before recorded history in which the Gods walked Elthelas freely among their greatest creation and \nservants, the Sorceron. Sorceron magi, wizards. Theologians (at least outside of groups that worship Mat'raktha) blame the war on a coup by Mat'raktha \nin which he sought to claim the world for himself. Malik, the God of Chaos and War joined his coup because he thought it interesting, and they further \nallied themselves with the forces of the hells and the abyss. If true it is in fact the only time that any of these factions have actively aided one \nanother. Certain apographal theologians claim that the war was actually started by Alohim in a quest to rid the world of all evil influences, but such \nideas are frowned upon. This unholy alliance took the other Gods by surprise and the war raged continuously until nearly every Sorceron alive was dead, \nas well as many angels, archangels, powerful demons and devils, and even several minor Gods.\n\nThe war finally ended with Mat'raktha banned from intervening in the world except through mortal clerics after Malik agreed to withdraw from the war. \nWhat Malik got in return for this betrayal is unknown, but perhaps he saw an end to all future chaos and wars with the potential destruction of all \nmortal races. Despite all of this it was Nera, the goddess of Death and Rebirth, who refused to take a side in the war, who ensured that the God's \nWar would not happen again. She used her power to declare death to any God who walked the world himself with no hope of Rebirth.\n"}},{"start_date":{"year":"1524","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Great Ramp Constructed Between Poron and Malidal","text":"The Great Ramp was built by Dorman III and Dorman IV to connect the wizards college at Malidal with the rest of the empire without having to travel hundreds of miles overland. It was a massive public works project that employed nearly 300,000 people during a period of relative peace for the Empire and construction took 23 years. \n\nDorman III began construction in 1524 after his requests for aid from the college during the Nerim Cataclysm took months to arrive.  When he died in battle against the orcs in 1530 his brother, Dorman IV took the throne and continued the project.  Shortly after its completion Dorman IV died of an apparent heart attack."},"end_date":{"year":"1547","month":"","day":""}},{"start_date":{"year":"268","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Zelfir and Hisru'de'tan founded","text":"Following the Enchanter's imprisonment, a great debate occurred among the Hisru regarding where to settle.  One group saw arcane magic as the key that saved their people, and were determined to rebuild their home as a mageocracy.  Others saw it as the tool by which the Enchanter had kept them imprisoned, and rejected arcane magic entirely.  As the debate progressed those who saw arcane magic as a tool of evil came together and decided to leave.  They called themselves 'the protected in exile' or Hisru'de'tan, and travelled east, eventually forming a society of wandering tribes.  Meanwhile those who stayed founded the nation of Zelfir, or 'Homeland'."}},{"start_date":{"year":"760","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Human Colonists Arrive in Shendarel","text":"30 years into their colonial experiment in Shendarel, the elves found themselves against the wall.  Orcish reinforcements had just arrived on the island from the mainland and large numbers of the elvish armies were occupied elsewhere.  Help came from an unexpected source.  \n\nA now forgotten kingdom of humans from around the location of present day Kaland, facing pressure from aggressive neighbors, sent ships to find a new place to settle.  They stopped in Shendarel, where the local governor offered to let them settle in Shendarel.  The human king would have authority over humans, and he would have authority over elves, meanwhile the elven kings son would marry the human kings daughter.  Once the governor and human king had passed away, their children would rule jointly, with their heir to be sole ruler of Shendarel.  The elven king, distracted by other matters, signed off on the deal without looking too deeply into the details.\n\nThe human kingdom relocated its population to Shendarel within months, sending its armies ahead to help secure the new kingdom.  The Orcs were pushed back to the stalemate line, and the humans built a new city alongside the elven provincial capitol."},"end_date":{"year":"761","month":"","day":""}},{"start_date":{"year":"1556","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Kandor Becomes Independent","text":"In 1556, the local lords of Kandor, feeling themselves over taxed and ignored by the empire, and encouraged by the near bloodless revolution in Gerasalim, threatened to rebel unless they were granted independence and a king of their own. Dorman V, thoroughly discouraged by his utter failure in dealing with the first rebellion, granted their petition, and appointed the first King of Kandor that fall. That winter Dorman V died of heart failure, his physician said of a broken heart, while his eldest son, a renowned expert in esoteric poisons, ascended as The Esteemed Emperor of Dormania, Dorman VI."}},{"start_date":{"year":"266","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Last Sorceron Imprisoned","text":"After the Gods War, a few surviving isolated Sorceron still wandered Elthelas.  Most were of little note, bred into the local population (creating today's Sorceron Blooded) and eventually died in some disease or war.  However, there was one notable exception.\n\nHis name is lost to history, but his story is not.  The people of Zelfir refer to him as the Enchanter.  The Enchanter had been a powerful servant of Asmodeous during the war, and was incredibly skilled in magic, particularly enchanting.  Soon after the war he found himself in a small human village, the first of the Hisru people.  Missing his former luxury, he used his magic to enslave the villagers, a practice he continued for generations.  As the population grew and they were continually subjected to enchantment, the Hisru people gained an increasing resistance to enchantment, and eventually a group of them that were able to resist his control came together in secret.\n\nUnable to free their people by force, these resisters pled with the Goddess Amathera to grant them the ability to protect their people from further oppression.  Amathera heard their pleas, and taught them the ways of magic.  She also granted them two powerful artifacts that could create impenetrable barriers of pure force.  Using the magic Amathera had taught them, they dispelled the Enchanter's magic and disabled him.  They transported him far from their people, and then imprisoned him using Amathera's artifact.\n\nIt was then that they named themselves the Hisru, or the protected."}},{"start_date":{"year":"-488","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Loridesa Constructed","text":"The elves came out of the God's War better off than most other races thanks to the protection of Sylvan.  Their population was concentrated in the southwest of the Eldoran subcontinent.  As they began to encounter threats from other races in the area they decided to form a single central government.  A council of elder druids came together and settled on the creation of a single central city and appealed to Sylvan to choose a ruler for the elves.  That city was Loridesa.\n"},"end_date":{"year":"-482","month":"","day":""}},{"start_date":{"year":"1497","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"The Fifth Mithril War","text":"The cause of the fifth mithril war is hard to pin down.  The elves blamed the dwarves, claiming they tunneled into elven territory, the dwarves claimed the elves purposefully collapsed the tunnels of a legally built dwarven hold.  Nevertheless, the fifth mithril war was the hottest and most bloody mithril war since the first, and was most definitely the longest.\n\nAtrocities quickly piled up on both sides, and the war continued until late 1523, when an Elven prince (and Champion of Cora) brokered a peace treaty so that the armies of both nations could turn their focus to the escalating Nerim Cataclysm.\n"},"end_date":{"year":"1523","month":"","day":""}},{"start_date":{"year":"773","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"First Border Skirmishes of the Mithril Wars","text":"In 773 the elves founded a small village in the hills on the far western edge of the plains of Curinor.  This act would change history and relations between elves and dwarves forever.\n\nThe forested hills, known as the Mithril Hills because of the deposits of that extremely valuable mineral found there, had been claimed by Curinor for generations, but because of its distance from the mountains they had never settled them outside of a couple of small mining holds.  When the dwarves discovered the elven village in what they considered dwarven territory, they arrested all of the villagers for illegal settlement and burned the village to the ground.\n\nMeanwhile Eldoran, seeing the hills mostly uninhabited, considered it unclaimed territory, and warned the dwarves not to interfere with elven settlement plans, and sent armies with the next group of settlers to secure the territory.  The dwarves sent their own armies and additional settlers to contest the elven claim, and the first skirmishes followed shortly therafter.  \n"}},{"start_date":{"year":"863","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"The First Mithril War","text":"862 was an election year in Curinor.  Deep dwarves from all over voted to decide the next Under-king.  The hottest topic of the election was the future of the Mithril Hills.  Everyone recognized that firmly securing the hills for Curinor would bring vast new wealth to the kingdom, and an invaluable military asset in mithril ore.  Meanwhile Eldoran warned Curinor that electing someone who favored increased dwarven settlement would likely mean all-out war over the hills.\n\nThe dwarves by now had grown up with anti-elf propoganda, particularly the elves disrespect of dwarven mineral rights law (a big deal in dwarven society), and the elves attempt to influence the election backfired.  The dwarves elected Magar Mithrilaxe, master of a minor hold in the Mithril Hills, who pushed for extermination of the elves in the mithril hills, and an invasion of Eldoran to deter future settlement attempts.\n\nAs soon as Eldoran heard about the election they dispatched the bulk of their armies to Elathia to secure the Mithril Hills, but the dwarves were crafty.  Rather than fight the elven army in their defended forts in Elathia, the dwarves landed a massive invasion force, with the help of the Morrind, onto the Eldoran subcontinent itself.\n\nFor three weeks the dwarven army burned and pillaged its way through the elven countryside before the elven armies were able to respond effectively. When the armies finally met, the weather conditions made it impossible for either commander to control their forces. The slaughter continued for 3 days before everyone on both sides had either been killed or fled. The Under-king himself was killed on the field of battle, as well as the Crown Prince of Eldoran.\n\nNo peace treaty or truce was ever declared, but both sides ability to wage war had been destroyed, and the war for all intents and purposes was over for the time being. Indeed no leader on either side managed to rouse the spirit of war in their people again for 60 years, and the settlements in the hills were all but abandoned."}},{"start_date":{"year":"1345","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"The Fourth Mithril War","text":"The drawing of an official border at the end of the Third War did not end the mistrust and rivalry between elves and dwarves concerning the Mithril Hills.  Both sides were determined to fully enforce their claims, and the first major settlement efforts of the hills took form, surrounded by a massive fortification effort.  Huge fortresses soon covered both sides of the border.  \n\nThis was the state of things when in 1345 a company of elven adventurers arrived in the Mithril Hills, doing odd jobs for various elven patrons in the area.  Eventually they took a job from an avidly anti-dwarf landowner, who claimed a group of dwarves had crossed the border and stolen an important family heirloom from him.  The adventurers crossed into dwarf territory, pressed the landowners accusations, murdered 15 dwarven miners, and made off with several works of priceless art and several hundred pounds of mithril bullion. The local elven governor, having been helped by the adventurers in question in the past, refused to turn them over to the dwarven authorities for prosecution, and things quickly spiraled out of control.\n\nThe war itself was largely a standoff between the opposing fortresses.  The elves sent several armies to the area, as did the dwarves.  The elves relied on attempts to prevent the resupply of the dwarf fortresses, while the dwarves generally preferred direct assault.  In the end, a cease fire was declared and the old border remained in force, but only because a northward push by the orcs that had begun some 15 years earlier was becoming impossible to contain while also warring over the Mithril Hills."},"end_date":{"year":"1352","month":"","day":""}},{"start_date":{"year":"1067","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"The Second Mithril War","text":"The 200 years after the end of the First Mithril War saw just enough fighting between the elves and dwarves to keep the Mithril Hills effectively abandoned, and relations tense. Then, in 1067 YFC, flames erupted over an unusual family. Born of two backwater miners, the half-elf half-dwarf children came to the attention of the elven authorities after their parents were killed by bugbears. The then king of Eldoran declared that the children were the product of rape, as no elven woman could possibly fall in love with a dwarf, and immediately declared all dwarves outlaws in Eldoran. The resulting imprisonment and execution of nearly 2000 dwarves pushed public opinion in Curinor over the edge, and calls began for punishment of the 'pointy eared dogs'.\n\nDwarf armies were assembled, but this time the elves pushed first. Elf armies marched from Estapor to Granite Bluff, placing the hold under siege.  Meanwhile the dwarven armies went about a defensive occupational strategy, occupying the long abandoned fortresses in the Mithril Hills, forcing out the few elven settlers in the area.  The siege of Granite Bluff became farcical in its length. No large dwarf hold has ever fallen to siege or assault, and this was no different. For 60 years the elven army stood outside the gates, and for 60 years the dwarves patiently let them, conducting trade and resupply through the underground tunnel networks that connect all the major holds of Curinor.\n\nThe elven public was fully aware of the ridiculousness of the siege, the siege camp had become like a city outside the city, with semi-permanent dwellings. As public opinion in Eldoran shifted towards recuperation, eventually support for the war waned, and in the first declared truce, the siege was lifted, the dwarves agreed to abandon the forts in the hills, and the law forbidding dwarves entrance to Eldoran was repealed."},"end_date":{"year":"1129","month":"","day":""}},{"start_date":{"year":"1774","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Mithril Wars Sixth War","text":"In 1774 A dispute between Curinor and Kandor over a half-dwarf hold on the border escalated into open war.  The dwarves were hard pressed but winning, and were forced to call their garrisons from the Mithril Hills to the east to reinforce their armies.  The elves saw it as an opportunity to take revenge on the dwarves for siding with the Moon Elves and take control of the Mithril Hills for good.  They sent elf armies into the largely undefended hills and slaughtered every dwarf they could find.  It was a genocide on par with that of the dwarves march through Eldoran in the First Mithril War.  The dwarves quickly concluded a peace with Kandor, giving up the half-dwarf hold in return for help against the elves, sent their armies back to the Hills, and called on their Moon Elf allies.  They also sent representatives to the other ex-imperial nations, Gerasalim and Dormania, who quickly marshalled forces to help.\n\nThe genocide by the elves turned half the continent against them, and the elves armies were quickly beaten by the combined forces of 5 opposing nations.  The resulting peace treaty permanently ceded the Mithril Hills to Curinor, but left it as a semi-independent territory with a largely independent elven governor."},"end_date":{"year":"1776","month":"","day":""}},{"start_date":{"year":"1211","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"The Third Mithril War","text":"The Third Mithril War involved no grand invasions or sieges, but was significant nontheless in that it kept relations tense between the elves and dwarves.  It started after a group of dwarven settlers, outcasts by dwarven standards, decided to occupy a long abandoned hold in the Mithril Hills in 1211.  Elven scouts soon discovered them there, and sent a petition to the government in Curinor to remove them, or the elves would.  The government of Curinor refused to even confirm that the settlers were there, taking a policy of purposeful ignorance.  They sent a letter back to the elves that they had sent no settlers.  The elves responded with force, sending soldiers to clear out the hold, to which the dwarves sent an official objection as armies were supposed to be prohibited from entering the Mithril Hills. Things escalated quickly from there and soon armed skirmishes were taking place.\n\nIt took 4 years for things to die down again, as both sides became tired of a war over uninhabited territory.  Representatives from both sides met and drew an official border through the Mithril Hills."},"end_date":{"year":"1215","month":"","day":""}},{"start_date":{"year":"1692","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Moon Elf Rebellion","text":"For most of history Demal Thor had been a colony of Eldoran, and there were no Moon Elves. The moon elves were a slow adaptation to the open savannah and hostile surroundings of the area. As a colony of Eldoran, Demal Thor was surrounded on 3 sides by enemies. Not only did they guard the only pass between Malinval and Eldoran and the closest location to the Blighted Gap, to the north the dwarves continually invaded as part of the many wars over the Mithril Hills, wars which saw no benefit for the Moon Elves, removed as they were from the object of their cause.\n\nA gathering of the moon elf tribes was called, and in early 1692 they called back all of their warriors from the Mithril Hills and other stations outside of Demal Thor. They set up garrisons at Moon Pass, and north and south of the Griffon Peaks, and sent a delegation to conclude their own peace with the dwarves.\n\nThe delegation came back with more than just peace. The dwarves, seeing it as a way to weaken their ancient enemy, agreed to support Demal Thor's independence. Over the course of that year Eldoran sent 2 campaigns to try to take back Demal Thor by force. The first attempted to go through Moon Pass, but was stopped by a combination of moon elf harriers and thick dwarven fortifications that had been set up at the most difficult points of the pass. The second attempt tried to swing arround both sides of the Griffon Peaks. The northern army faced attack by the dwarves, and was forced to retreat. The southern army marched unopposed until it suddenly found itself surrounded. By the end of 1692 Eldoran agreed to officially recognize Demal Thor's independence."}},{"start_date":{"year":"1250","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Empire of Nerim dominates the Subcontinent","text":"By 1250 YFC The Empire of Nerim was left with no real rivals on the Neran subcontinent.  The date marks what is considered the start of the Empire's golden age."}},{"start_date":{"year":"950","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Neran Imperial Expansion","text":"The Empire of Nerim started as a cluster of 6 city states with semi-independent kings, all worshippers of Nera, goddess of death and rebirth.  Through a series of political maneuverings, Immanuel Exorsa, a particularly skilled priest of Nerim managed to get himself appointed High Priest of the Church of Nerim in all 6 cities in 950 YFC. He was popular with the people, had the support of the armies, and gave the kings a simple choice, swear unending fealty to him or suffer the wrath of Nera herself.  Indeed everyone in Nerim believed him to be Nera's chosen prophet, who spoke for the Goddess in all things.\n\nWith a power base secured, the new Prophet and Emperor immediately began a campaign to turn all of the Neran subcontinent to the worship of Nera, and subservience to him, by force if necessary.  The series of wars that followed eventually led to the complete dominance of the subcontinent outside of the wild forests of the far south by 1250 YFC.  The Prophet of Nera, his life extended far beyond that of any other living mortal outside of Dragonkind, was by now easily the most powerful man on Elthelas.  His empire, while it did not quite equal Eldoran in territory, had triple the population, and quadruple the martial strength.  Even beyond the strength of their living soldiers, powerful necromancers raised and kept armies of undead servants that provided both martial and material support.  Rich landowners would buy wands allowing them to control their own undead servants to work their plantations, mines and factories.  Diseases were tamed, the wilds laid low, and the first sewer systems built in the cities.  The improved living conditions led to a population explosion, and by 1276 colonial territories were sought in order to relieve the pressure.  The Immortal Armies, as the Empires troops were now called, carved out territories in southern Elathia, claiming Terron and the Arad coast for the Empire.\n\nThis relentless period of expansion would only be checked by the raising of a new Orc Overlord, briefly uniting the orc tribes in a bloody war of retribution."},"end_date":{"year":"1330","month":"","day":""}},{"start_date":{"year":"1522","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Nerim Cataclysm","text":"Nerim was one of the two early human empires (along with Dera) and was by far the longest lived. Nevertheless it only ever had one emperor.\n\nNerim, as a nation worshipped Nera, the goddess of death and rebirth, who could grant her followers long life. If she so chose. The Emperor of Nerim, Immanuel Exorsa, was one of her greatest disciples, and considered by the church of Nerim to be her prophet (towards the end of his reign this title was disputed in the colony known as Arad, where they believed the emperor to be apostate.) Yet, after 1000 years of life, Nera told Immanuel it was time for him to prepare for death, as it must eventually come to all. But Immanuel feared death, and concocted a plan with his wizards and priests to gain immortality, not only for himself, but for all the peoples of the empire. Years of work went into preparing the ritual that would be required, but when it was complete, the people discovered that they had been deceived. Or more accurately, those not within approximately 500 miles of the capital, for the ritual killed everyone in that area, and immediately brought them back as undead servants to their newly reborn Lich King Exorsa.\n\nThose left on the fringes of the empire found themselves immediately under seige with undead pouring out of the empires heartland led by fell undead necromancers. Slaughtering all they could and raising them to join their endless armies. Some found refuge, such as the Sand Orcs. Most fled. Soon refugees began pouring into every kingdom that could be reached by ship, with more begging passage than could possibly be accommodated. Yet the nations, as they took in the refugees, still did not understand the scope of the problem, and only a few brave souls, protected by the Gods, resisted that first year. The Goddess Cora immediately took up the cause of the disheartened refugees, sending her mighty Champions to protect them. Yet they fought a losing battle, and it was not until the undead built ships of their own, and the first undead invasion forces landed in southern Dormania that the nations fought back. The war that followed was massive, uniting an entire continent, bringing together dwarves and elves and humans and orcs, gnomes and halflings in a way not seen before or since. The Lich King himself was reputed to be slain at the hands of one of Cora's Champions.\n\nThe undead were pushed back, and the Gods came to agreement, for the alliance could not last, and the undead could not all be destroyed. They put aside the Gods' Agreement, and together made the first changes to the face of the world since the God's War. Great mountains were brought up around Nerim, and the land was cursed with eternal heat by Molton. The undead have remained trapped and leaderless since."},"end_date":{"year":"1524","month":"","day":""}},{"start_date":{"year":"1330","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Orcs in Nerim","text":"After the colonization of Arad by Nerim, the Orcs were sufficiently afraid for their own survival to unite under a single ruler for long enough to abate the threat, however this didn't last long, and not everyone got in line.  One group of orcs left Malinval entirely, fleeing to the far southern part of Nerim, still largely uninhabited forests and deserts populated by huge, unruly beasts leftover from another age.  Their numbers were small enough, and the land worthless enough, that the people of Nerim simply left them to their own devices, and the difficult life and isolation they found themselves in prompted rapid divergence from typical Grunt Orc traits, leading them to over time become the modern Sand Orcs of Nerim."}},{"start_date":{"year":"1841","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Prince of Fiends Awakens","text":"The Prince of Fiends, comatose since the Gods War deep in the halls of Dal Okra, suddenly awoke in 1841 for unknown reasons.  Leaving his ancient tomb, his people, the Orcs, no longer recognized him.  He travelled to Marinval, where the orc chiefs were having a conference to determine how to counter the Alliance of 6 Nations and the Fortress of Light that had left so many of their armies shattered.\n\nThe guards attempted to stop the Prince of Fiends from entering for a few brief seconds before dying horribly.  The chiefs themselves tried to throw out the intruder.  It wasn't until several of them lay dead on the floor that they recognized who they truly faced.  The ancient leader of their people, the last free Sorceron, right hand of Mat'raktha, the Prince of Fiends."}},{"start_date":{"year":"855","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Shendarel gains Political Independence","text":"It was 70 years after the inking of the deal that officially created the first half-elf ruling line that the first truly half-elf ascended to the throne in Shendarel.  Although the details of the deal had been picked apart years before by the Elvish nobility, now that the time to intervene was upon them, they found themselves unable to do so.  Several factors prevented them from doing so:\n\n1. The young half-elf king was charismatic, skilled and popular in his kingdom.\n2. The elven armies were busy fighting the dwarves of Curinor over the Mithril Hills.\n3. Shendarel's standing army, bolstered by the constant need to beat back Orcish incursions, was a formidible enough force to dissuade ideas of an easy victory.\n4. The new King of Shendarel offered the homeland military support against the dwarves in return for formal independence.\n \nWith all these factors in mind, the elven king formally signed an order granting full autonomy to Shendarel."}},{"start_date":{"year":"518","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Kingdom of Staelia Formed","text":"Staelia sits in a brutal position.  The weather is harsh and unforgiving, meanwhile large populations of giants, trolls, and unspeakable creatures regularly sweep down from the Gorgro plateau to raid, pillage, and steal.  The human population of Staelia survived for their first 1000 years by attempting to avoid fighting the invaders whenever possible.  They built escape holes, hid in nearby caves, or fled into the forests when the evil creatures approached.  The 6th century, however, brought change for Staelia.  A small group of champions, incredibly skilled in combat, came together and determined to protect the people of Staelia, and end the threat that the trolls and giants posed.  They left one of their number behind in Staelia to help the people protect themselves, while the rest of them would venture into the Gorgro plateau itself to find the giants home and destroy them.\n\nThe expedition must have met with some success, as raids on Staelia stopped for several years, but the adventurers never returned.  The one who stayed behind did not shirk his duty however.  With the people of Staelia behind him, he trained soldiers, built fortifications and roads, and organized tournaments of martial skill.  All of this required a massive amount of effort and money, as well as centralization of power.  By the time it was clear his companions would never return, he was king in all but name, a fact that would change in 523, when the council of nobles (unsurprisingly, most of whom had been appointed by him) elected him and his heirs Kings of Staelia for all eternity.\n"},"end_date":{"year":"523","month":"","day":""}},{"start_date":{"year":"1276","month":"","day":""},"media":{"url":"","caption":"","credit":""},"text":{"headline":"Terron Colonized","text":"The island of Terron had long been a home for tribes of gnolls and hobgoblins who fought among themselves.  In 1276 however, the growing empire of Nerim, hungry for resources and raw materials, swiftly changed that.  The disorganized locals were no match for the undead armies of Nerim, and the island was quickly conquered, and colonists soon followed."}}]}