{"model":"Landmark","documents":[{"name":"Abyssal Gate of Dera","description":"High in the mountains above the ruined city of Dera, the abyssal gate that brought ruin to an empire is buried, now closed by Bahamut and guarded constantly by ancient silver dragons, the gate's location is marked by a constant smell of brimstone, and a complete lack of growing things.","coords":[27,-134]},{"name":"Cur'Estan","description":"Cur'Estan is the fortress headquarters of the Black Wolf Irregulars, a paramilitary mercenary organization that works out of Alliance territory, and has a large long-term contract to provide support to Alliance armies. The fortress of Cur'Estan was an old abandoned keep in the woods of Kandor, first built during Dorman I war with the dwarves over their eastern holds as a supply dump and staging area for the imperial army. When the founders of the Black Wolf Irregulars discovered it, they bought it from the lumberjacks who owned the land and after making their fortune adventuring, set about restoring the fortress.","coords":[65,102]},{"name":"Dal Okra","description":"Literally in Orcish \"Dal Okra\" means Home of the Orcs. It is an ancient name for the place of legend where the orc race was first created. Whether that was actually the huge black mountain called Dal Okra today is a question for debate, as that history was lost in the God's War. Dal Okra today is a huge empty tomb, once holding the Prince of Fiends, a believed dead Sorceron, who once commanded at least part of the orc legions in the God's War before he was struck down by Michael, the Archangel of Alohim. Now he is awake again, and has taken nearly complete control of the orcish tribes.","coords":[0,79.5]},{"name":"Dera","description":"Once the capital of the Deran empire, now an ancient ruin destroyed by demons. Yet it is not uninhabited. Underground, in the deep sewers, live the Fey'ri, a bastard race of elves and demons. The spawn of the inhabitants of the first towns to be destroyed by the demons.","coords":[26,-125]},{"name":"Fang","description":"The white mountain, Fang, is the center of Sand Orc society. The mountain is home to an extensive system of natural caves, which they have greatly enlarged, and several cool springs that supply an abundance of water. As such it serves as trading post and wintering location for the Sand Orcs. It is also the location their chiefs meet in order to discuss any matters that involve all of the tribes. It is a place of peace, and no sand orc is allowed to raise a hand against another while at or near Fang.","coords":[-65,114]},{"name":"Fortress of Light","description":"The Fortress of Light is a massive joint venture defensive fortress and staging facility manned by dwarves, humans, and elves from Gerasalim, Dormania, Kandor, Curinor, Demal Thor, and Eldoran. It is the central supply dump and gathering point for campaigns and troop movements in the defense against attacking orcs, trolls, gnolls, and various goblinoids coming across arid plain known as the Blighted Gap.\n\nThe fortress itself is built surrounding a small springfed lake, and covers nearly 3 square miles. It's outer wall extend up 150 feet of sheer stone braced with adamantium, without joint or crack, and they are nearly 15 foot thick. Several large inner keeps, built similarly to the outer wall, extend up some 200-250 feet. Large counterspelling crystals instantly counter any spell cast at or near the fortress. A dry moat, filled with thick steel spikes, extends out 25 feet from the edge of the wall.","coords":[17.5,90]},{"name":"Gaia's Grove","description":"The Dreaming Goddess, Gaia, Who Dreams No More. Such is the line the druids have told in recent months, encouraging pilgrims to come to the wild island of Gnarra to see the hidden grove where Gaia, until recently, slept. About 20 miles in from the south coast of Gnarra the grove is guarded by the Faelin, who speak little about the events that led to the Goddess awakening, only saying she was 'saved' by a group of adventurers and a mighty druid. No one will say what she was saved from.\n\nThe grove itself has only 1 small entrance, with no other path through the tangle of branches and trees that form an impenetrable dome around the living altar.","coords":[-5,-30]},{"name":"God Spire","description":"The God Spire is a relic of the age before the God's War located in north central Eldoran. It is a 500 foot tall metallic spire, with inscriptions covering it written in an unknown heiroglyphic language. It is believed to be a shrine once dedicated to some now dead God, but no one really knows its purpose or what may be inside.","coords":[40,-5]},{"name":"Great Ramp","description":"The Great Ramp was built by Dorman III and Dorman IV to connect the wizards college at Malidal with the rest of the empire without having to travel hundreds of miles overland. It was a massive public works project that employed nearly 300,000 people during a period of relative peace for the Empire and construction took 23 years.\n\nDorman III began construction in 1524 after his requests for aid from the college during the Nerim Cataclysm took months to arrive.  When he died in battle against the orcs in 1530 his brother, Dorman IV took the throne and continued the project.  Shortly after its completion Dorman IV died of an apparent heart attack.","coords":[36.5,144]},{"name":"Iron Triangle","description":"The Iron Triangle is three fortresses built equidistant from each other in northeast Nerim, each about half a mile from the other two. In their day the three fortresses were the greatest defensive structure in the world, although they never endured much test beyond disorganized rebel groups. Today they are (mostly) uninhabited ruins, but they are still imposing and difficult to capture should anyone choose to defend them.","coords":[-53,143.5]},{"name":"Nerim","description":"Nerim was once the seat of the Neran Empire, a monotheistic continent spanning empire. It was here that the great spell was cast that turned the population of the continent into armies of the undead, millions strong. The city still stands, largely undamaged, preserved by the dry air, and the inability of growing things to survive in the lingering negative energy presence.","coords":[-60,125]},{"name":"Peloria","description":"The city of peloria was a rowdy bustling trading hub before the Nerim Cataclysm. It was, at the time, one of the wealthiest and most cosmopolitan cities of Malinval, even elves could walk the streets with a reasonable expectation of going unmolested.\n\nAfter the cataclysm, armies of undead poured out of the subcontinent of Nerim, across what was then a relatively narrow channel between it and Elathia. The unwalled and poorly defended city, far from the war fronts the orcs were used to fighting on, was quickly overrun. Those who did not escape were killed, and while the undead were driven back and eventually destroyed, the Champions of Cora who led the charge felt no pity for the Mat'raktha worshipping orcs, and bypassed the city on their way to Nerim. The city remains a nest of the undead to this day.","coords":[-20,118]},{"name":"Sorcerer's Prison","description":"The Sorcerer's Prison is believed to be the single greatest work of magic since the God's War. Created by the wizards of Zelfir to contain their once master, a powerful Sorceron enchanter of unknown name, it is a huge magical barrier which it is possible to enter from the outside, but impossible to get out of from within. The barrier forms a massive sphere, with the center at ground level such that it is impossible to fly or dig oneself out. The surface of the barrier is silvery and impossible to see through. The barrier has stood for thousands of years without anyone ever escaping.","coords":[-43,-158]}]}