[{"id":"allianceof6nations","title":"Alliance of 6 Nations","description":"The Alliance of 6 Nations is a recent strategic alliance of the nations on the [Elathian](/geo/continents/elathia) continent who oppose the expansionistic tendencies of the [Malinval](/geo/nations/malinval) Orcs, as well as the worship of [Nera](/ref/gods/nera), [Mat'raktha](/ref/gods/matraktha), and [Malik](/ref/gods/malik). Made up of [Curinor](/geo/nations/curinor), [Eldoran](/geo/nations/eldoran), [Demal Thor](/geo/nations/demalthor), [Kandor](/geo/nations/kandor), [Gerasalim](/geo/nations/gerasalim), and [Dormania](/geo/nations/dormania), the alliance was impossible until recently because of recurring wars between the elves and dwarves over the [Mithril Hills](/geo/features/mithrilhills). The crowning achievement of the Alliance has been the construction, maintenance, and manning of the [Fortress of Light](/geo/landmarks/fortressoflight) and other border forts along the [Blighted Gap](/geo/features/blightedgap).","nations":["eldoran","dormania","gerasalim","curinor","kandor","demalthor"],"cities":["desadorel","strovenguard","kaland","curinkeep","aridhem","loridesa","eastguard","highhammer","estapor","storval","sofala","malidal"],"tenets":[],"level1":"","level10":""},{"id":"amatherasshield","title":"Amathera's Shield","description":"Amathera's Shield is an organization of knights, paladins, and others dedicated to defending the helpless and uplifting the poor and downtrodden.  \n\nIt has two branches, the militaristic branch seeks out war zones, building and defending refugee camps, and setting up defenses in communities likely to be subject to raids or attack.  The charitable branch goes into communities to distribute food, supplies and education.\n\nBoth branches have a heirarchical ranking system based on knightly orders, with new initiates referred to as pages, followed by squires.  Senior members are called 'shieldmaiden' or 'shieldwarden' depending on their gender.\n\nAmathera's Shield is sponsored by the church of Amathera, and is greatly respected everywhere Amathera is worshipped.  Their headquarters is in the city of Mandon in Zelfir, but they have chapterhouses in many major cities throughotu the world.","nations":["zelfir","deradragorim","alfadir","staelia","eldoran","gerasalim","kandor","dormania","terron","shendarel","seran","curinor","morrindim"],"cities":["malidal","desadorel","farengar","kaland","eastguard","strovenguard","granitebluff","storval","torinhammer","tenecha","kimly","swava","alados","kelas","dieel","fradae","damat","mandon","zelfin","lastwatch","portsmith","vashna","delan"],"tenets":["Defend the weak and provide refuge.","Don't start conflicts, finish them.","Provide charity for the poor."],"level1":"**Guardian.** When someone within 5 ft of you makes an attack you can use your reaction to interpose yourself and force them to target you instead.","level10":"**Magic Refuge.** You can cast the spell Ottiluke's Resilient Sphere 1/day without using a spell slot.  When cast in this way you can only target a willing target."},{"id":"artificersofmechanus","title":"Artificer's of Mechanus","description":"The Artificer's of Mechanus is an international organization of inventors, wizards, and engineers dedicated to seeking out hidden knowledge and building new or unusual machines and constructs.  They have sponsored universities in several major cities, and even universities that are not officially associated with the group typically still host members of the group.\n\nThe group has no official leadership, and only one real rule: knowledge should be shared freely with other members, and guarded closely from falling into the hands of others.","nations":["stagenheim","zelfir","deradragorim","eldoran","curinor","morrindim","gerasalim","dormania"],"cities":["malidal","desadorel","strovenguard","milan","torinhammer","curinkeep","stromforde","granitebluff","vasha","vashna","craftheim","gnoma","ifritan","zelfin"],"tenets":["The secrets of the guild must never be revealed.","Your secrets are the guilds secrets, and should be freely shared within the guild, but not outside of it.","The pursuit of knowledge transcends moral bounds."],"level1":"**Engineer.** You get advantage on intelligence checks related to identifying or using magic items.","level10":"**Secret of the Golem.** Your skill has grown enough that the guild entrusts you with the secrets of golem building.  With sufficient time and materials you are able to build various types of golems.\n\n*50,000 gp worth of materials and 2 months: Iron Golem.\n*25,000 gp worth of materials and 1 month: Stone Golem.\n*20,000 gp worth of materials and 3 weeks: clay golem.\n*6,000 gp worth of materials, 3 humanoid corpses, and 2 weeks: flesh golem.\n*5,000 gp worth of materials and 1 week: copper golem.  Golems you build in this way obey your verbal orders to the best of their ability (unless berserk).  The copper golem is a new monster, a medium construct with an armor class of 13 (natural armor), 85 hit points (10d8+40), a 20 ft move speed, 18 str, 8 dev, 18 con, 3 int, 8 wis, 1 cha.  Immunity to acid, poison, and psychic damage.  Immune to charmed, exhaustion, frightened, paralyzed, petrified, and poisoned conditions.  darkvision 60 ft, passive perception 9.  Understands the languages of its creator but cannot speak.  A challenge rating of 4.  It has the following traits as written for the clay golem: berserk(triggers at 35 or fewer hit points), immutable form, magic resistance, and magic weapons, multiattack.  It's slam attack does 2d8+4 damage and has a +6 to hit.  It's proficiency bonus is +2."},{"id":"blackguardsofmatraktha","title":"Black Guards of Mat'raktha","description":"The Black Guards are the militaristic branch of the church of Mat'raktha, mostly, but not solely, made up of orcs, they are dedicated to the destruction of the worshippers of all other Gods so that Mat'raktha can finally take his place as the rightful God King and King of Gods.\n\nTheir chapter houses are largly concentrated in Malinval, and they are officially led by the Prince of Fiends himself.","nations":["malinval","olda","sage"],"cities":["makhol","forbel","marinval","makir","mordaserekhai","gulutheim","ochreken","malgeth","parakas","sage","punbar"],"tenets":["Mat'raktha's glory must come before all other concerns.","Obey your betters unless they prove themselves weak.  If they are weak, replace them.","Power is it's own goal."],"level1":"**Intimidating Presence.** You gain proficiency in the intimidation skill.  If you are already proficient you gain expertise instead.","level10":"**Destroy the Unfaithful.** After making an attack roll but before the DM tells you the result of that attack you can choose to add +10 to the result.  You can do this twice, after which you must finish a long rest before using this feature again."},{"id":"blacksun","title":"Black Sun","description":"The Black Sun is a loose international organization of thieves, cutthroats, assassins, and bandits.  They have a presence in most major cities throughout the world, however there is no strong central leadership.  Each local branch will typically have it's own guildmaster, and it's own call signs and codes in addition to the more global thieve's cant.  Members who travel can usually expect to find safeharbor in local chapterhouses, but little trust or aid.\n\nMembership in the Black Sun is membership for life, in that if you try and leave or betray the Black Sun they will hunt you down and kill you.","nations":["eldoran","dormania","gerasalim","curinor","kandor","demalthor","terron","malinval","seran","degakta","morrindim","olda","shendarel","deradragorim","zelfir","hisrudetan","sage","stagenheim","alfadir","staelia"],"cities":["malidal","poron","desadorel","falak","farengar","sreppe","northport","strovenguard","eastguard","purs","kaland","westport","highhammer","granitebluff","curinkeep","torinhammer","stromforde","storval","aridhem","sofala","estapor","makhol","forbel","marinval","makir","parakas","malgeth","mordaserekhai","gulutheim","ochreken","tenecha","kimly","sunra","alados","morrind","diya","punbar","barak","swava","milan","loridesa","dima","vasha","vashna","delan","portsmith","tarum","shodal","sage","craftheim","gnoma","ifritan","atyrao","fradae","damat","dieel","kelas","instar","pelgan","mandon","zelfin"],"tenets":["Never betray the Black Sun.","Profit by any means.","Contribute to the Guild's coffers regularly"],"level1":"Gain proficiency in one skill from the following list: acrobatics, deception, intimidation, investigation, slight of hand, stealth","level10":"You gain 2d6 sneak attack damage as the rogue feature, cumulative with any sneak attack dice from other features."},{"id":"blackwolfirregulars","title":"Black Wolf Irregulars","description":"The Black Wolf Irregulars are a mercenary organization that has existed in northern [Elathia](/geo/continents/elathia) for the last 200 years or so, hiring themselves out by company to various militaries. They have a history of taking in those who don't fit into a standard military structure and coming up with unusual tactics designed to take advantage of them. After the formation of the [Alliance of 6 Nations](/org/allianceof6nations) they were hired en masse by the same to be a cross-national force that worked strictly for the Alliance as a whole. The Irregulars typically work in small squads on the peripheries of major battles, handling scouting missions, infiltration missions, and other missions that require unusual or specialized training for a small number of individuals.\n\nDespite their reputation for success and loyalty to their contractors, they still tend to be distrusted by national professional militaries.","nations":["eldoran","demalthor","curinor","gerasalim","kandor","dormania"],"cities":["strovenguard","eastguard","purs","sreppe","desadorel","aridhem","estapor","storval","highhammer","granitebluff","loridesa"],"tenets":["Complete the objective  you are given, even if it means working outside of typical means and methods.","Keep in contact with your commanding officer.","Leave no man behind.  Work as a team with your squad and don't leave anyone in enemy hands."],"level1":"**Guild Funding.** You start with an additional 50 gold.","level10":"**Advanced Training.** Add +1 to one ability score of  your choice.  Also pick 1 skill you are proficient in, you gain expertise in that skill."},{"id":"championsofcora","title":"Champions of Cora","description":"The Champions of Cora are an unofficial offshoot of the [Church of Cora](/ref/gods/cora). They are a group of adventurers who travel the world, either individually or in small groups, finding hopeless situations to turn around for the cause of good. The champions were a largely unknown organization until the [Neran Cataclysm](/history/nerimcataclysm), when the Champions were the first, and most successful, respondants to the crisis. They successfully organized the evacuation of thousands of survivors, while delaying the advance of the undead hordes. Their intervention enabled the nations of the world to mount an organized response, and it was rumored that it was in fact a Champion of Cora who fought the once Emperor of [Nerim](/geo/nations/nerim), turned Lich King, in single combat. Defeating him before succumbing to his wounds.\n\nChampions of Cora are almost always welcomed in any good aligned community in which they arrive, although governments often resent their interventions.","nations":["dormania","gerasalim","curinor","seran","shendarel","eldoran","demalthor","terron","staelia","malinval"],"cities":["malidal","eastguard","strovenguard","highhammer","granitebluff","kimly","swava","estapor","loridesa","aridhem","tenecha","pelgan","instar","kelas","gulutheim"],"tenets":["Defend the weak at all costs","No cause is without hope","Evil must be destroyed","Never choose the lesser evil"],"level1":"**Hope springs eternal.** Whenever you are reduced to 0 hit points you can roll a d10 + your level and heal by that many hit points.  After you use this feature you cannot use it again until after a short or long rest.","level10":"**First Strike of the Faithful.** You have advantage on itiative checks."},{"id":"dormanianimperialguard","title":"Dormanian Imperial Guard","description":"The Dormanian Imperial Guard is devoted to the defense of the Emperor Dorman, his heirs, and his empire.  They are an elite unit of guards, retainers, and knights who brook no threat to their charges. In battle they serve as the Emperor's personal retinue and vanguard.  Outside of battle they guard his person and that of his heirs.  On occasion members of the group may be tasked with missions of high importance to the Emperor, or to investigate rumors of assassination plots.","nations":["dormania"],"cities":["desadorel"],"tenets":["The Lives of the Emperor and his heirs are more important than your own.","The commands of the Emperor and his assigned representatives are absolute so long as they do not violate the first tenet","Dorman rewards the strong, become the best self you can be.","Protect the Dormanian Empire and its soldiers"],"level1":"**Guard the Door.** You gain proficiency in the perception skill.  If you are already proficient you gain expertise instead.","level10":"**Guard the Body.** You gain the protection fighting style, if you already have the protection fighting style choose another fighting style from your class list.  Also you get a +1 bonus to AC while wearing a shield and you have an adjacent ally."},{"id":"dragoncult","title":"Dragon Cult","description":"The Dragon Cult is a group of dragons and their humanoid followers dedicated to the rise of Tiamat and the destruction of all good-aligned Dragons.  Tiamat's evil nature and refusal to recognize even the other evil Gods as legitimate makes members of the Dragon Cult rare throughout the world, however the blessing of tiamat is not without benefits. Each member additionally serves a particular chromatic dragon, who passes on the orders of Tiamat, as well as their own desires to the members of the Dragon Cult under their control.","nations":["dragonhome"],"cities":[],"tenets":["I cannot abide the existance of a metalic dragon, if I learn of ones existance I must find a way to destroy it.","I must never acknowledge the legitimacy of any God but Tiamat","I must not disobey my Dragon master, the chromatic dragons are the true inheritors of the earth."],"level1":"**Breath of the Dragon.** You gain a breath weapon, per the Dragonborn racial trait.  If you are a Dragonborn you instead gain 1 additional use of your breath weapon per day.","level10":"**Wings of the Dragon.** You gain the ability to grow wings at will.  When you have your wings you have a 20 ft fly speed as long as you are not encumbered."},{"id":"guildofheroes","title":"Guild of Heroes","description":"The Guild of Heroes is dedicated to hunting down and destroying monstrous creatures, for payment of course.  They pride themselves on taking the jobs that the normal authorities can't handle.  They are strictly non-political and don't get involved in conflicts between humanoid peoples, and as a result are welcome in most nations.","nations":["staelia","stagenheim","sage","alfadir","zelfir","morrindim","degakta","olda","shendarel","malinval","seran","terron","dormania","kandor","gerasalim","curinor","eldoran","deradragorim"],"cities":["dieel","pelgan","morrind","barak","swava","sunra","sage","mandon","lastwatch","seldan","kimly","tenecha","parakas","makhol","gulutheim","northport","desadorel","westport","curinkeep","granitebluff","estapor","milan","vashna","portsmith"],"tenets":["Fulfilling contracts is my purpose, I should always be trying to fulfill my next contract","If possible I always try to complete contracts on time and to the letter","Getting involved in politics can be bad for the guilds ability to get contracts.  I should avoid political entanglements."],"level1":"**Well Funded.** +50 starting gold from guild grants","level10":"**Contract.** The guild has contracts on all sorts of unusual creatures.  Whenever you kill a monstrosity, ooze, giant, dragon, or abberation of CR 8 or higher for which you don't already have a guild contract, there is a chance it had a contract on it that you didn't know about.  Roll a d6 on a 5 or 6 there was a preexisting contract on the creature worth 250 gp * the creature's CR."},{"id":"illustriousguildofmerchantsandfineartisans","title":"Illustrious Guild of Merchants and Fine Artisans","description":"Based in [Desadorel](/geo/cities/desadorel) and spread throughout the imperial nations of [Gerasalim](/geo/nations/gerasalim), [Kandor](/geo/nations/kandor), and [Dormania](/geo/nations/dormania), members of the Illustrious Guild of Merchants and Fine Artisans controls most of the trade throughout the region. Operating a trading company without the blessing of the guild is generally considered to be unhealthy, often leading to premature death by such diverse means as poison, stabbing, falling from very high places, and lynching.\n\nMeanwhile, membership in the guild provides access to discounts on hiring guards, grants your voice greater weight in matters of local governance, and a certain amount of protection from unwanted competitors, unless of course those competitors are also guild members.","nations":["dormania","kandor","gerasalim","curinor","demalthor","eldoran","shendarel","olda","malinval","arad","terron","seran","degakta","morrindim","deradragorim","hisrudetan","sage","stagenheim","alfadir","staelia","zelfir"],"cities":["malidal","poron","desadorel","sreppe","falak","farengar","northport","strovenguard","eastguard","purs","kaland","westport","granitebluff","highhammer","curinkeep","torinhammer","stromforde","stroval","sofala","aridhem","estapor","milan","loridesa","dima","swava","punbar","diya","barak","makhol","forbel","marinval","makir","mordaserekhai","ochreken","gulutheim","parakas","malgeth","faran","albeliath","tenecha","kimly","sunra","alados","morrind","sage","tarum","shodal","atyrao","fradae","damat","dieel","craftheim","gnoma","ifritan","kelas","instar","pelgan","mandon","zelfin","lastwatch","seldan","portsmith","delan","vasha","vashna"],"tenets":["Never sell counterfeit goods","Stay within the laws of whatever country you are in.","Be willing to trade with anyone"],"level1":"**Guild Funding.** The guild provides funding to outfit yourself.  Start with 50 extra gold.","level10":"**Guild Bank.** Your good standing in the guild makes you eligible to borrow money from other guild members at a reduced rate.  Loan interest rates never exceed 2% / month."},{"id":"internationalgrangemastersalliance","title":"International Grangemaster's Alliance","description":"After observing a spate of occurances where local lords levied unfair taxes on farmers and merchants with near monopoly local power refusing to give fair prices to farmers in the area, a group of clerics of Sara came together to officially form the Grangemaster's alliance.  The alliance is made up of thousands of local grange houses, each of which acts as a community center for farmers in the area.  Collectively they act as a bulwark against ruling class abuse, sponsor soup kitchens and other charitable causes to feed the poor, and promote causes farmers care about.  The organization is largely decentralized, no house is ever compelled to act by the others or by the organization as a whole, but their shared interests allow for powerful collective action.  When merchants in small communities refuse to pay fair prices, they can expect a grange sponsored buyer to come in and buy up the goods in their place, and when rulers demand unfair taxes they may suddenly find themselves unable to buy food for their armies.  The alliance crosses borders and has members even on opposite sides of major conflicts.","nations":["dormania","kandor","gerasalim","curinor","eldoran","demalthor","shendarel","olda","malinval","arad","terron","seran","degakta","morrindim","deradragorim","sage","hisrudetan","stagenheim","staelia","alfadir","zelfir"],"cities":[],"tenets":["Do everything reasonable to ensure no one in your community goes hungry","You should own a farm or otherwise spend time each day growing food","speak up for the rights of farmers","pay your dues every month, equal to 5% of monthly farm profits or 20gp, whichever is higher."],"level1":"**Herder.** Gain proficiency in the animal handling skill, if you are already proficient in animal handling you instead gain expertise in animal handling.","level10":"**Blessing of the Earth.** You learn the spell Plant Growth, and can cast it without expending a spell slot.  Once you use this ability you cannot use it again until you finish a long rest."},{"id":"keepersofthegrove","title":"Keepers of the Grove","description":"The Keepers of the Grove are a druidic order dedicated to protecting the Grove of Gaia, a hidden grove on the island of Gnarra that is the home of the Goddess Gaian.","nations":["gnarra","eldoran"],"cities":[],"tenets":["I must stay in contact with the druids at the grove itself, and ensure its continued safety at all times","Nature must be protected from the ravages of civilization"],"level1":"**Child of Nature.** You have proficiency in nature checks.  If you are already proficient in nature you gain expertise instead.","level10":"**Blessing of the Earth.** You learn the spell Plant Growth, and can cast it without expending a spell slot.  Once you use this ability you cannot use it again until you finish a long rest."},{"id":"lordsoftherisingdawn","title":"Lords of the Rising Dawn","description":"The Lords of the Rising Dawn are Alohim's order of Paladins.  They are dedicated to defeating evil and upholding the law.","nations":["dormania","gerasalim","kandor","terron","seran","shendarel","staelia","alfadir","eldoran"],"cities":["desadorel","falak","malidal","poron","sreppe","farengar","northport","strovenguard","eastguard","purs","kaland","westport","tenecha","kimly","swava","kelas","instar","pelgan","dieel","fradae","damat","loridesa","milan","sofala"],"tenets":["I must never break the laws of my home country or any of its allies while I am there.","Evil must be rooted out and brought to light.  If an evil is unlawful I must put an end to it.  If it is in within the law I must reveal the perversion in the law to those capable of changing it."],"level1":"**Light of Dawn.** You know the light cantrip and can cast it at will.","level10":"**Radiant Weapons.** When you make a weapon attack you can choose for the damage you do to be radiant damage instead of bludgeoning, piercing, or slashing damage."},{"id":"makersoflegend","title":"Maker's of Legend","description":"The Makers of Legend are probably the most influential of the bardic colleges.  They teach their students to not only spread the knowledge of legendary accomplishments, but to constantly seek to become a hero of legend.  Cowardice or bad actions are highly frowned upon.","nations":["dormania","gerasalim","kandor","curinor","eldoran","terron","shendarel","zelfir","staelia","deradragorim"],"cities":["desadorel","kaland","strovenguard","curinkeep","loridesa","tenecha","swava","zelfin","instar","vasha"],"tenets":["I will always behave in the most courageous manner possible","Legends are made in the eyes of those who watch them, I must always appear to be upstanding to others","I must make sure that everyone knows the legends of my people"],"level1":"**Book of Legends.** The Makers of Legend have supplied you with a book of prominent legends and stories from history.  While the book is in your possession you have advantage on intelligence(history) checks.","level10":"**Inspiring Leader.** You gain 1 additional use of bardic inspiration per short rest."},{"id":"mastersofthedeepsong","title":"Masters of the Deep Song","description":"Among the highest acolytes of Dorun are the Masters of the Deep Song. They are skilled musicians who sing and teach the oral history of their God through music.  The songs of the masters of the deep can travel huge distances as they echo through the tunnels of a dwarven hold, creating intricate overlapping harmonies.  These masters of music are sworn to uphold the strictest tenets of their faith.","nations":["curinor","morrindim","stagenheim"],"cities":["curinkeep","torinhammer","stromforde","highhammer","granitebluff","morrindim","alados","craftheim","gnoma","ifritan"],"tenets":["**Darkness Protects.** Dorun lives in the darkness and shuns the light, I must live by his example and never reveal my face to the sun.  If necessary I may use a mask or cloak to hide myself, but to expose my face to direct sunlight would be the greatest shame.","I must make time each day to practice my art.  I will grow through the songs of my people."],"level1":"**Singer.** You gain proficiency in the performance skill.  If you are already proficient in performance you gain expertise instead.","level10":"**Master of the Deep Song.** You gain the ability to cast the spell enthrall at will without using a spell slot.  Charisma is your spellcasting ability when it is cast in this way."},{"id":"morrindbrewersclub","title":"Morrind Brewers Club","description":"The [Morrind](/geo/nations/morrindim), like their kin from [Curinor](/geo/nations/curinor), love beer and brewing. Unlike their kin from [Curinor](/geo/nations/curinor), they have access to a variety of ingredients unlike any other group in the world. Some years back, a group of prominent brewers from a variety of colonies got together and began trading recipes. Soon they formed an organization, admittance to which required the submission of a high quality recipe (judged by the local guild members). It caught on like wildfire, and now the world over it is known that the place to get the best beer is the local Morrind Brewers Club.","nations":["morrindim","olda","eldoran","alfadir","malinval","stagenheim","staelia","seran","shendarel","zelfir","terron","kandor","dormania"],"cities":["alados","barak","damat","diya","estapor","fradae","gulutheim","ifritan","instar","kimly","loridesa","malidal","mandon","milan","mordaserekhai","morrind","ochreken","pelgan","safala","swava","tenecha","westport"],"tenets":["I must always be on the lookout for new recipes and share them with the club.","I should promote a local club member to anyone looking for a good place to drink.","If I own a bar it must display the Morrind Brewer's Club sign out front","I can never serve or accept poor quality alcohol"],"level1":"**Beer Brewing Training.** You gain proficiency in alchemist's tools and brewer's tools.","level10":"**Master Brewer.** The club funds the founding of a bar for you in return for a cut of the profits.  The bar takes 20 days to build and start operations, after which it will earn you 20 gp of profit a day assuming it is maintained and staffed."},{"id":"orderofthecleansingfire","title":"Order of the Cleansing Fire","description":"The Order of the Cleansing Fire is an offshoot of the Church of Molton.  They preach change through violent means.  They believe that an enforced material equality, where everyone has nothing to begin with, will with time reveal the truth of how a people should be governed, and that this must happen periodically in order to avoid corruption across generations.\n\nNeedless to say they are not well liked by ruling classes anywhere, although they often gain adherents among the destitute who shelter them from the eyes of the powerful.  Members of the Order are easily identified by the brand they where prominantly on their bodies in the shape of a flame.","nations":[],"cities":[],"tenets":["I have a marking brand on my body that must never be hidden by clothing.","My actions must never enforce the class divisions of a people.  The rich are not rich by right but through oppression and must be brought low.","The destruction of the ruling class is good and right."],"level1":"**Fire from nothing.** You learn the create bonfire cantrip and can cast it at will.  Charisma is your spellcasting ability for this spell","level10":"**Master of Flame.** You are immune to fire damage."},{"id":"shepherdsoftheallmother","title":"Shepherds of the All-Mother","description":"Making up a hidden cult of Nera worshippers throughout the world, the Shepherds of the All-Mother provide rituals to help the soul reach its designated afterlife, and believe in the continued usefulness of the body after death, via necromancy.  Even in Nera worshipping Arad the shepherds are considered a fringe group, nevertheless they maintain a presence in most communities throughout the world.","nations":[],"cities":[],"tenets":["The dead must always receive the ritual of passage. If I am capable I must give the souls of the recently dead the chance to reach the afterlife.","Once the soul has passed on a body is not useless.  Whether as material, meat, or undead servant the bodies of the dead can serve the living.","Undead can provide useful services and labor and I must fight the stereotype that they are servants of evil."],"level1":"**Religious Rites.** You gain proficiency in the religion skill, if you are already proficient from your class or background you gain expertise instead.","level10":"**Necromantic Rituals.** You learn the spell animate dead and can cast it 1/day at the 3rd level without using a spell slot.  Additionally, when you cast animate dead you can choose to have it last until the next time you cast the spell instead of the normal duration of 24 hours."},{"id":"silverdragonknights","title":"Silver Dragon Knights","description":"The Silver Dragon Knights are the protectors of the Dragon Emperor, and make up his personal retinue.  Occasionally, he will send one or several of them on missions of great importance.  The knights are dedicated to upholding the laws of Dera'Dragorim, honoring good-aligned Dragons, and pursuing justice throughout the world.","nations":["deradragorim"],"cities":["vasha","vashna","delan","portsmith"],"tenets":["The Dragon Emperor speaks for Bahamut and his decrees are absolute.","I must abide no threat to the Dragon Emperor's life","I must uphold the rights of good and free people everywhere","I will not abide or consort with fiends of any sort"],"level1":"**Breath of the Dragon.** You gain a breath weapon, per the Dragonborn racial trait.  If you are a Dragonborn you instead gain 1 additional use of your breath weapon per day.","level10":"**Wings of the Dragon.** You gain the ability to grow wings at will.  When you have your wings you have a 20 ft fly speed as long as you are not encumbered."},{"id":"stormlordsoftrimala","title":"Stormlords of Trimala","description":"The Stormlords represent the anger of the seas.  They are an organization dedicated to eliminating piracy and polution of the seas.  Coastal towns that dump their garbage into the sea often sea delegations of Stormlords demanding greater respect for the oceans.  Likewise, ships commanded by Stormlords often hunt down pirates to their lairs.","nations":["morrind","eldoran","shendarel"],"cities":["morrindim","alados","sofala","estapor","milan","loridesa","swava"],"tenets":["I must not abide piracy.  If I discover pirates active in an area I must destroy them if it is within my power to do so.","I cannot stand idle while others polute the sea."],"level1":"**Elemental Adept.** At level 1 you learn the gust and shape water cantrips and can cast them at will.  Wisdom is your spellcasting stat for these spells.","level10":"**Master of the Storm.** At level 10 you learn the spell Call Lightning and can cast it 1/day without using a spell slot.  Wisdom is your spellcasting ability for this spell."},{"id":"sylvansrangers","title":"Sylvan's Rangers","description":"Reknowned explorers and adventurers, Sylvan's Rangers are a loose organization dedicated to exploring unknown haunts.  They sponsor outfitters in cities close to remote locations that act as the gatekeepers to the organization.  These outfitters compile maps and information brought in by the rangers, creating guide books and outfitting kits.","nations":["eldoran","demalthor","gerasalim","morrindim","deradragorim","staelia","zelfir"],"cities":["lastwatch","mandon","seldan","dima","storval","estapor","aridhem","eastguard","portsmith","pelgan","morrind"],"tenets":["To stay in one place is to fail to grow, I must always be finding new places","The frontiers are dangerous and I must always strive to make them safer for others","I must attempt to preserve natural beauty where I find it"],"level1":"**Favored Terrain.** You gain a favored terrain.  See the ranger feature in the PHB, if you already have a favored terrain you may pick an additional one.","level10":"**Master Hunter.** Add the spell hunter's mark to your spells known or spellbook.  If you do not the ability to cast spells, you gain the ability to cast hunter's mark 1/day as a first level spell.  The duration changes from 'Concentration up to 1 hour' to '1 hour'."},{"id":"trollkinmercenarycorps","title":"Trollkin Mercenary Corps","description":"The Trollkin Mercenary Corps is the official diplomatic arm of Degak'Ta, but membership is not restricted to citizens of Degak'Ta or Trollkin.  They are an elite group of mercenaries who will sign up for any conflict for the right price, even different sides of the same conflict. Once contracted they are known to be extremely loyal and impartial, governed by the contract they are given until it expires.  Further they are known to be among the best warriors in the world, so being able to afford Trollkin Mercenaries is considered extremely prestigious.","nations":["degakta"],"cities":["sunra"],"tenets":["My contract is law.  Failing to fulfill the contract I agree to is never acceptable for any reason.","Never work without payment.  We are not a charity organization","Avoid religious entanglements.  Many employers have particular religious beliefs, and one should avoid offending future employers.  I must never engage in public displays of religion or work directly for a religious organization."],"level1":"**Advance Payment.** People who give you contracted missions are willing to pay in advance whenever they are able.  The reputation of the Mercenary Corps preceeds you.","level10":"**Battle Master.** The advance training the Corps provides has paid off and you are able to do more damage with every swing of your sword or shot of your bow.  You get +1d4 damage on all weapon attack rolls."},{"id":"voidbringers","title":"Voidbringers","description":"The voidbringers are a collection of worshippers of Trollka, Malik, and various unspeakable evils from beyond the edge of existence who are dedicated to returning the world of Elthelas to the void.  The continued existence of the mortal plane is seen as an affrontory to the beauty of pure chaos, and so it must be brought to an end.","nations":[],"cities":[],"tenets":["Governments and organized religions represent the natural order.  I must never work for them, and should try to undermine them where possible.","If I have multiple ways I could solve a problem, I should choose the most violent or destructive method"],"level1":"**Insanity.** You have been touched by the eternal void, and your mind will never be the same again.  Your dedication to chaos gives you advantage on saves against charm and fear.","level10":"**Extraplanar.** You are a senior agent of your God, and he speaks to you.  You can cast Contact Outer Plane once per day without using a spell slot so long as you use it to contact Trollka, Malik, or an outer evil whom you revere."}]