{
  "name": "Dormania", 
  "primelanguage": "",
  "seclanguages": [],
  "coords": [67.8180604062138, 103.42835470247077],
  "bordercoords": [
    [73.40667151856782, 77.15694854830423],
    [71.40288755930774, 77.15694854830423],
    [69.66114385488451, 75.18267591787749],
    [66.25386407845592, 74.12865277694321],
    [66.0762805590054, 82.2544387085378],
    [64.79781874626237, 91.78456460781837],
    [63.884528715917604, 92.49807021822059],
    [59.91682764190146, 94.91353991619494],
    [57.356534533026796, 95.52838674840659],
    [56.90337852240974, 95.87972779538467],
    [56.347370405809556, 97.02158619806345],
    [55.16043536786112, 97.81210355376415],
    [53.49499027578922, 98.82220906382615],
    [47.82099291702753, 100.2275732517385],
    [47.16777652195969, 101.7646903322676],
    [48.11522506232188, 104.26799529198647],
    [52.03264053901125, 108.01306310582297],
    [54.731360856838975, 110.20894464943599],
    [56.71091303022316, 110.91162674339219],
    [58.86525961258023, 111.39425009531547],
    [60.11448725214835, 111.21857957182641],
    [61.21241982497141, 110.42806221612571],
    [62.71981280284028, 109.54970959868052],
    [63.96179789450044, 109.68146249129732],
    [64.53456764831915, 109.33341555802019],
    [65.75347700465251, 110.16785054459315],
    [66.44777128729203, 111.17795605465514],
    [67.91300879667932, 112.45156734995071],
    [69.0098569390557, 111.48537947076099],
    [69.56930102430901, 110.78624062515541],
    [71.20568079894481, 111.57675798085612],
    [72.1853751126503, 109.95180563858246],
    [72.91015411609764, 107.84375935671395],
    [73.41921666801886, 105.50845710960034],
    [73.30597771435797, 102.87339925726471],
    [73.45679682993942, 99.4917416801006],
    [73.34380727719767, 94.74863754589649],
    [73.60629113982226, 92.5966736331557],
    [73.60629113982226, 90.0055334116923],
    [73.07724163906074, 83.4178887808532],
    [73.30597771435797, 80.43148988153948]
  ],
  "color": "#9999FF",
  "map": "https://elthelas-images.herokuapp.com/maps/nations/Dormania.jpg",
  "capitol": "Desadorel",
  "cities": ["Sreppe", "Farengar", "Falak", "Malidal", "East Dormania", "West Dormania", "Wayrest", "Timberlan", "South Port", "East Port", "Orania", "Prince Port", "Cur'Lesto", "Cur'Mestin", "Miner's Rest", "Poron", "Silver Head"],
  "landmarks": ["World Crack", "Great Ramp"],
  "borders": ["Terron", "Malinval", "Arad", "Gerasalim", "Kandor"],
  "population": 5600000,
  "populationDistribution": [{
    "race": "Imperial Humans",
    "proportion": 0.7
  },
  {
    "race": "Lightfoot Halflings",
    "proportion": 0.1
  },
  {
    "race": "Imperial Gnomes",
    "proportion": 0.09
  },
  {
    "race": "Half-Elves",
    "proportion": 0.06
  }],
  "government": "Dormania is ruled by the eternal emperor, lord of all the east, Dorman. The Emperor has absolute authority in Dormania, although of course most decisions are made by appointed officials and bureaucrats, all officials serve at the pleasure of the Emperor.  The most recent Emperor, Dorman XXII, died after falling from the highest window in the tallest tower of his palace, shortly afterward his infant son and heir was found suffocated by his nurse.  This has left the government without an obvious ruler for the first time ever, and rule has reverted to the local lords.\n\nThe major cities of Dormania are ruled over by Dukes and Arch-dukes, each of which sits on the Council of Lords, charged by the imperial charter with choosing a new Emperor should the sitting Emperor die without an heir.  Unfortunately the Council has been deadlocked for some time.",
  "ruler": "Until recently, Dorman XXII, now deceased.",
  "history": "The city state of Desadorel was a prominent trade city and independent city state that exported iron, adamantine, and other valuable minerals before Dorman I became the king. With dreams of mighty conquest, he marshaled his troops and conquered several of his nearest neighbors before they really had time to build armies of their own. After a couple years of consolidation he went on the march again, and over his 40 year reign he conquered everything from the eastern coast west to the border of Curinor and south to Dal Okra.\n\nAfter his death it was not long before pieces of the empire began to fall away. First a slow march north by the orcs over a period of nearly 100 years reconquered the southernmost territory north to the Rust Desert, then during the disastrous reign of Dorman V Kandor and Gerasalim both declared independence. Since then the borders have remained fairly stable, although the extent of rule by the central authority has waxed and waned.",
  "gods": ["Alohim", "Sara", "Dorman", "Fanome", "Maris", "Tock", "Trimala", "Gaian", "Molton"],
  "worship": "The Dormanians have a history of experimenting with different religions, and most every God has a cult of at least some size in the empire. Dorman I, however, does hold a special place here.",
  "culture": "Dormania is a country in flux. The countryside is still largely feudal, with Lords overseeing large areas of land cared for by their serfs, however few Lords have proper castles, but rather live in elaborate manor homes. Meanwhile the cities are home to a burgeoning middle class of merchants and artisans whose power is continually growing.",
  "economics": "Dormania has many commercial centers and is a reasonably wealthy country. The bulk of the land east of the World Crack is made up of large open grasslands where they raise herds of cattle and other livestock. The hills above Desadorel have some of the world's richest deposits of adamantine. The north mostly produces grains, while the area around Malidal produces a number of cash crops such as cotton and olives.\n\nDesadorel is the largest metropolis on the continent north of Malinval, and most any kind of craftsman can be found there, not to mention more beauracrats than you can shake a stick at. Meanwhile Malidal is home to one of the finest colleges of wizardry in the world, (Dormanians would say THE finest, but even the more traveled people would rank it in the top 5.)",
  "slavery": "Slavery is illegal in the empire, however serfdom is the regular order of the day in the countryside.",
  "magic": "A Mage must be a registered member of one of the many magical colleges in order to practice magic legally. However, enforcement of this law outside of the major cities is largely ignored.",
  "property": "Anyone can own property in the empire except for branded serfs.",
  "citizenship": "Their is no legal method of citizenship in the empire, although records of the royal line are kept."
}