{
  "name": "Eldoran",
  "coords": [30,-10],
  "border-coords": [],
  "color": "#FFFF00",
  "map": "/images/maps/nations/Eldoran.jpg",
  "capitol": "Loridesa",
  "cities": ["Milan", "Dima", "Sefala", "Storvel", "Estapor"],
  "landmarks": ["God Spire", "Undead Woods", "Glass Cliff", "Mithral Hills", "Moon Pass"],
  "borders": ["Dera'Dragorim", "Gnarra", "Curinor", "Demal Thor", "Malinval", "Shendarel", "Olda"],
  "population": 3600000,
  "populationDistribution": [{
    "race": "Wood Elves",
    "proportion": 0.62
  },
  {
    "race": "High Elves",
    "proportion": 0.22    
  },
  {
    "race": "Half-Elves",
    "proportion": 0.12    
  }],
  "government": "Eldoran is governed by a king responsible for day to day affairs of government, and the council of elders, which is the eldest healthy member of each district, and has 350 members. The council can override the affairs of the king, or depose him and elect a new king should he refuse. On a local scale, lords have hereditary domain over their territory.",
  "ruler": "Eldran Se'la'mer",
  "history": "Of the major races, the elves were lucky in that not only were they relatively untouched by the God's War, they managed to stay together after the conflict in a relatively remote area. They founded a single kingdom, Eldoran, and slowly began to expand as their population grew. It was not long before they had taken control of the entire subcontinent and sent colony ships across to the main continent, as well as south (the southern ships landed on the coast of Shendarel) and west (the elves sent west returned with tales of the Deran empire, opening trade relations with the west for the first time). Eventually the elves controlled as much territory on the mainland continent as elsewhere.\n\nOver time the elves were involved in several wars with the orcs, the dwarves, and the various human kingdoms, as well as various civil wars. Three of the most recent deserve special mention as historically important to current affairs. First, when Dorman I sought to control the entire continent he clashed with the elves on several occasions. These battles are regarded historically as among the only ones he didn't win(they repeatedly stalemated, as he was never able to force the elves to commit to the field, rather they harried his forces until he gave up). Shortly after the death of Dorman I, the Moon Elves, who had taken the brunt of those battles with little support from the west, declared themselves independent of the elven kingdom, calling their new land Demal Thor. War ensued, and the High Elves were unable to retake control of the east. Lastly, there have been repeated conflicts with the dwarves of Curinor over the Mithril Hills, aptly named for their large deposits of easily mined mithril. The most recent war however, resulted in near total victory by the elves. While the resulting peace treaty placed the border almost directly down the middle of the hills, most of the largest mithril deposits are on the elfin side, and the dwarf mines in the area have been abandoned.",
  "gods": ["Gaian", "Amathera", "Sylvan"],
  "worship": "The elves worship Gaian and Amathera primarily, as nature God and protector. However Sylvan is worshiped the most as patron God of the Elves, who spent the God's War protecting her people rather than actively fighting.",
  "culture": "The elves love nature, and it shows in their practices and architecture. Aged trees are protected, and most smaller villages are actually built in the canopy of the trees, while the larger cities are built among them and around them. Farmers specifically grow crops that thrive in the shade and the elves tend to live far apart from each other (Eldoran has the one of the lowest population densities of any country.)",
  "economics": "The elves export specialty woods, spices, fine furniture, art, fine steel and mithril. They are also the world's largest exporter of magical goods such as scrolls, wands, and other enchanted items.",
  "slavery": "Slavery is abhorrent to the elves.",
  "magic": "Magic comes naturally to the elves and is highly commonplace. The regulations for its use are highly esoteric to outsiders, often dictating specific times when specific spells can be used. (For example a shield spell can only be cast when one feels threatened, and is considered a threat in itself).",
  "property": "Trees are protected, and the removal of wood is usually done by special magic or the cutting of low branches rather than by cutting them down. Otherwise any elf can own property in Eldoran.",
  "citizenship": "Any elf except moon elves are considered citizens. Although the only real difference between citizens and non-citizens is whether they are counted when seeking members of the council of elders."
}