{
  "name": "Stagenheim", 
  "primelanguage": "",
  "seclanguages": [],
  "coords": [-36.56039393337069, -45.50166685488014],
  "bordercoords": [
    [-30.627868021988988, -41.531728066567496],
    [-29.141966429841336, -47.416690603450434],
    [-28.692394666557494, -52.818199339577866],
    [-36.70531110774926, -53.53414093322117],
    [-39.664385162230374, -53.89803632684293],
    [-41.63135419009182, -55.0652787821586],
    [-46.00411630923806, -54.855932830060844],
    [-46.58104651714895, -49.959428770347785],
    [-46.490356282464795, -46.3581830388224],
    [-45.94303320745295, -43.06436072340284],
    [ -45.111815521121336, -42.62518441468024],
    [-43.60376465190968, -38.361824743114504],
    [-40.67178518351826, -38.317907112242224],
    [-40.23708119770154, -42.0509057363844],
    [-38.744979645057434, -41.2603883806837],
    [-37.25601956056729, -41.304306011555965],
    [-37.08092785557601, -41.531091389129486],
    [-36.27029661150108, -40.69665640255653],
    [-34.87635513202252, -40.65273877168426],
    [-34.840295024025934, -40.8284092951733],
    [-33.274861346151496, -40.916244556917825],
    [-31.231004534414804, -41.17975034215141]
  ],
  "color": "#FF0000",
  "map": "https://elthelas-images.herokuapp.com/maps/nations/Stagenheim.jpg",
  "capitol": "Craftheim",
  "cities": ["Gnoma", "Ifritan"],
  "landmarks": ["Fire Islands"],
  "borders": ["Hisru'de'tan", "Sage", "Alfadir", "Staelia"],
  "population": 2000000,
  "populationDistribution": [{
    "race": "Stagen Gnomes",
    "proportion": 0.85
  },
  {
    "race": "Deep Dwarves",
    "proportion": 0.05
  },
  {
    "race": "Strongheart Halflings",
    "proportion": 0.04
  },
  {
    "race": "Imperial Gnomes",
    "proportion": 0.03
  },
  {
    "race": "Kobolds",
    "proportion": 0.02
  }],
  "government": "The Gnomes of Stagenheim are ruled by a king and an elected parliament. The parliament is in charge of the collection of taxes and troops, as well as enacting laws. The King is responsible for leading the armies, and enforcing the laws. Local governments are generally split between elected mayors and more traditional feudal lords.",
  "ruler": "",
  "history": "Stagenheim started out as a haven for gnome mages with unusual ideas in a network of caves provided to them by the God Tock. Over time they managed to overcome their various opponents and conquered a small nation of dwarves, as well as subdued several kobold tribes. When they managed to expand to the edge of Alfadir, their population exploded as they were able to import large quantities of food and other raw materials from throughout the continent.",
  "gods": ["Tock", "Fanome", "Molton"],
  "worship": "The priests of Tock are wealthy supporters of the many technologists in the country, and are in turn supported by those inventors who make it big with their support. Meanwhile the priests of Fanome serve as the emotional core of the country, as the single independent country of gnomish people. Molton is primarily worshiped by the people in the eastern Fire Islands who give offerings in the hope of avoiding his wrath in the form of volcanic eruptions.",
  "culture": "The Stagen gnomes are technologists to the core, and strange contraptions both mundane and magical are common throughout Stagenheim.",
  "economics": "Stagenheim is a huge consumer of raw materials, and an exporter of all sorts of finished contraptions, magical devices, furniture, and metal goods.",
  "slavery": "Slavery is illegal, and foreigners who have slaves often have them 'liberated' by the local authorities.",
  "magic": "Magic use requires a license that can be revoked if the ability is misused, but the licenses are cheap, oversight limited, and rules lax.",
  "property": "While physical property is generally well-enforced, special distinctions have to be made for depth and purpose of use.",
  "citizenship": "Only gnomes have voting rights in Stagenheim."
}