{
  "name": "Terron", 
  "primelanguage": "",
  "seclanguages": [],
  "coords": [36.7762924811868, 98.89950345311317],
  "bordercoords": [
    [47.468949677672484, 97.07519531250001],
    [46.89586230605985, 97.71240234375001],
    [45.43508099838452, 98.63525390625],
    [44.97062759301016, 99.51416015625001],
    [44.34545810301834, 100.04150390625001],
    [42.72078596277834, 100.43701171875],
    [40.78678041401646, 101.93115234375001],
    [38.17559185481665, 102.59033203125001],
    [36.92135192790115, 102.54638671875001],
    [34.74838307098529, 103.11767578125001],
    [32.99714648628775, 102.41455078125001],
    [32.145385562629315, 101.62353515625],
    [31.69779270531287, 101.00830078125],
    [31.360673191606306, 99.90966796875001],
    [30.114245744598513, 99.25048828125],
    [29.42763722319321, 98.19580078125001],
    [29.542398322601738, 96.35009765625001],
    [32.07093815080466, 94.19677734375001],
    [32.368363067704735, 94.15283203125001],
    [33.40163829558251, 94.32861328125],
    [34.928726792983845, 93.62548828125],
    [36.10903359678316, 93.62548828125],
    [37.96801944035648, 94.06494140625001],
    [40.25228042623786, 94.06494140625001],
    [41.2509675141624, 94.59228515625001],
    [41.481833430076065, 94.59228515625001],
    [42.978530155644734, 95.69091796875001],
    [43.935483850319784, 96.04248046875001],
    [44.40827836571936, 95.73486328125001],
    [45.21880793965786, 95.95458984375001],
    [46.322274857040256, 96.48193359375001],
    [47.284818765649284, 96.17431640625],
    [47.64133557512159, 96.61376953125001]
  ],
  "color": "#FFFF00",
  "map": "https://elthelas-images.herokuapp.com/maps/nations/Terron.jpg",
  "capitol": "Tenecha",
  "cities": [],
  "landmarks": ["World Crack"],
  "borders": ["Arad", "Seran", "Dormania"],
  "population": 600000,
  "populationDistribution": [{
    "race": "Neran Humans",
    "proportion": 0.85
  },
  {
    "race": "Imperial Humans",
    "proportion": 0.1
  }],
  "government": "Terron is ruled by the Council of Lords. The 27 seat assembly is hereditary, and members are banned from intermarriage. Terron is unusual in this way that the nobility are in fact required to marry non-nobles in order to preserve the separation of the noble houses and prevent power from becoming consolidated in a single individual.",
  "ruler": "",
  "history": "During the period leading up to the cataclysm of Nerim, 27 Lords from within Nerim opposed the Emperor's plan for immortality. They tried to curry influence with the church to build opposition and force the Emperor to back down, but they were betrayed. Fearing for their lives they fled and met up on the island colony Terron. It was while they were meeting there that the cataclysm occurred. Horrified by the masses of undead they believed resulted from the use of Nera's power, they gave up the worship of Nera and took up the worship of Cora. Once the ensuing war ended, the 27 Lords split the island into 27 estates, and vowed to govern jointly rather then ever let one man have enough power to repeat an event like the cataclysm.",
  "gods": ["Cora", "Sara"],
  "worship": "The nobility have traditionally worshiped Cora ever since the cataclysm, and many of the common people do as well. Sara also has a strong following among the agrarian class.",
  "culture": "The culture of Terron is influenced by a strong sense of personal freedom and a distrust of powerful people. Laws are designed to protect individuals rights and limit the power of the great. It is the only country in the world with a progressive tax system.\n\nTerron's poor tend to be subsistence farmers or miners up in the mountains. While no one of them has much, they all help each other as much as they can, and to refuse aid to someone in need is considered the worst of manners.",
  "economics": "Terron is a poor country of subsistence farmers and miners. The lords of the land typically have control of larger plantations and trading interests, but even they are usually only comparable to a middling noble or regional merchant in Dormania or Eldoran.\n\nThe mountains are dotted with small mines built by entrepaneuring prospectors. They tend to have big dreams, and not much capital, so their mines rarely get far beneath the surface, yet the rumors of large deposits of valuable gemstones and veins of silver and gold regularly draw them up into the mountains. Occasionally foreigners, particularly dwarves who hear the rumors, will find their way to Terron to try their luck, but the locals have a strong distaste for such outsiders 'who come to strip our land and carry away everything we have'.",
  "slavery": "Slavery is illegal in Terron",
  "magic": "Magic is closely regulated, and most high level magic is strictly illegal. One man should never be allowed so much power is the view in Terron.",
  "property": "While any citizen can own property in Terron, there are restrictions on how much, although the nobility are the only ones that get close to pushing that boundary. Anyone who owns too much property is liable to have the extra portion of his estates confiscated and distributed to poor homesteaders.",
  "citizenship": "An oath of opposition to tyranny and the Goddess Nera is required for citizenship in Terron."
}