{"model":"Feature","documents":[{"name":"Adindora Mountains","description":"The Island of Terron is bisected by the Adindora Mountains, the southern terminous of the broken range made up by the Black Peaks and the Sword Mountains.  The mountains are a major source of wealth for the poor nation, with major deposits of tin, zinc, and coal.  The mountains themselves are barely more than tall hills, with many traversible passes and plateaus.","coords":[36.82797398619907,97.72656295326642]},{"name":"Alf River","description":"One of two rivers for which Alfadir is named, the Alf is the more northern of the two. It is a well developed river that provides irrigation to large swathes of countryside. The rights to the water of the Alf are tightly controlled by the Alfadiran government, or more accurately, by the large farmer barons who use the government to provide themselves large water subsidies and charge everyone else for access.","coords":[-41.49109217223112,-63.90462860126645]},{"name":"Ara River","description":"The Ara river, like the Sindi Silme-Ranna, runs for much of its length directly under the orbit of the moon Ara. Feeding into Saria Lake at it's southwest termination, it combines with the Sindi Okra to form the longest river system in the world. It brings a variety of goods down from the heart of Gerasalim down to Saria Lake and the capitol at Strovenguard, and forms an important leg in the trade routes with Dormania.","coords":[59.63512878739761,75.84129905896712]},{"name":"Aruru River","description":"Named for the moon of the same name, the Aruru River is one of three inlets to Lake Saria. The easternmost and shortest of the three, it carries massive amounts of water down from the Black Peaks into Saria Lake, carrying grain and other trade goods from Southeast Gerasalim with it.","coords":[56.28072318654398,75.57779327373359]},{"name":"Black Peaks","description":"The imposing mountain range blocking the way between Gerasalim and Malinval gets its name from the black specked granite, onyx, and other volcanic rock that make up much of the rock in the area. It is theorized that the mountains were created during the Gods War by the Gods themselves pulling magma and rock up from the heart of the earth to destroy each others armies. Regardless of how they were created, the mountains today serve as an imposing border and stopgap from orcish invasion for Gerasalim.","coords":[50.30425289732485,77.33449850862398]},{"name":"Black Shard Pass","description":"When Dorman I finished conquering the human kingdoms in the north, he wanted to move south into the orc kingdoms. In order to provide an additional route of attack for his armies, he set his best engineers and mages to building a new pass through the mountains. They chose a likely spot, and literally set about destroying a mountain to create a low pass. They succeeded (as did Dorman's advance), but they discovered that the heart of the mountain had been made of almost pure onyx.","coords":[52.06684451000508,85.06400154214191]},{"name":"Blighted Gap","description":"The Blighted Gap is an arid waste, once part of the fertile plain that makes up the bulk of Demal Thor, Curinor, and Southern Gerasalim, nothing grows in the area any longer after centuries of warfare on that ground with destructive magic used liberally on both sides. It is bordered on the west by Demal Thor, on the north by Curinor, to the east by Gerasalim and to the south by Malinval. The gap is also home to many strange monsters that feed off of the latent magical energy that has built up there over time, often drawn to the sites of old battlefields between groups of mages. The north edge of the gap is dotted with fortresses, by far the largest of which is the massive Fortress of Light.","coords":[47.23542209101768,58.36208197180735]},{"name":"Boundary River","description":"The Boundary River runs on a northeast - southwest course through Riftlan, some 80-100 miles north west of Last Watch and the official patrolled border of Zelfir. It is generally considered to mark the final boundary between civilization and the areas inhabited by man, and the wild, untamed central Veldt. Only the trading post and fortress Saldan is known to lie further north anywhere west of the Dragonhome Mountains. Between the river and the fort lies 150 miles of grassland without a single human inhabitant outside of the occasional hermit.","coords":[-29.972780616663897,-96.52948990174221]},{"name":"Demon Peaks","description":"The Demon Peaks are a string of mountains in far west Riftlan, running north from the Sorcerer's Prison along the western edge of the veldt. So named because they are the refuge of the demons who survived the wrath of Bahamut after the fall of Dera. The Demons there are generally disorganized, spending much of their time hunting the creatures of the veldt for food and sport, yet there are rumors that a great Demon Lord remains high in the mountains, in a fortress of his own construction.","coords":[-12.87473119764905,-104.34682819700464]},{"name":"Desert of Despair","description":"Located just south and east of the Glass Cliff in Malinval, the Desert of Despair is a hot desolate place that despite its relative proximity to the coast, rain somehow never falls and the wind never blows. It is sandy and barren, yet unlike the typical sandy desert, there are no dunes, but it is unnaturally flat throughout. Once, as a dare, a group of orcs thought to see if they could dig deep enough in the sand to find something other than sand. They dug down close to 500 feet before their hole collapsed on top of them.","coords":[27.392497540937878,36.03880439715049]},{"name":"Dina River","description":"The Dina River has its head waters in the Runic Mountains, running east and south from there into the northern tip of Saria Lake. The exact origin of the river is unknown outside of the Deep Dwarves, as the head waters run out of massive fortified dwarven fortresses, although it is known that the underground river runs as far as Highhammer on the far side of the mountains, allowing the dwarves to send their trade goods east as well as west.","coords":[59.51795123679212,65.6094628365568]},{"name":"Dir River","description":"One of two rivers for which Alfadir is named, the Dir is the more southern of the two. It is a well developed river that provides irrigation to large swathes of countryside. The rights to the water of the Dir are tightly controlled by the Alfadiran government, or more accurately, by the large farmer barons who use the government to provide themselves large water subsidies and charge everyone else for access.","coords":[-42.86740922288481,-65.0369062468919]},{"name":"Dorman River","description":"Running northeast from the mountains above Desadorel, the imperial capitol of Dormania, to the northeast coast of Elathia, the original name of the river was lost years ago. After Dorman's assencion to godhood was confirmed by imperial priests, the river was renamed in his honor, and all records of the original name were altered or expunged.","coords":[69.18233334938937,101.17193343899193]},{"name":"Dragonhome Mountains","description":"The Dragonhome Mountains are large imposing mountains that split the continent of Riftlan in half. The mountains are the home of the worlds largest population of Dragons.","coords":[-9.133961283596275,-89.56103494580488]},{"name":"Dragon's Teeth","description":"The Dragon's Teeth Mountains mark the border between Eldoran and Demal Thor.  They are only sparsely populated, with a few border forts concentrated near the Moon Pass.  Because the elves have few if any settlements nearby, there are a number of kobold mines, gnoll forts, and free goblin clans that inhabit the area.","coords":[48.05651271802527,27.347698436153177]},{"name":"Exodus Isthmus","description":"Named for the flight from Zelfir of the Hisru people of Hisru'de'tan, the isthmus connects the continents of Atyrea and Riftlan with a strip of land 10 miles wide and 80 miles long. A distance not impossible for a small ship to portage if necessary, and port towns along the coasts often have gangs of workers who will hire themselves out to do just that, bringing ships from the Dragon Sea to the Mermaid Sea and back again.","coords":[-36.97567823176651,-73.20597313192074]},{"name":"Fire Islands","description":"The Fire Islands are a large group of small volcanic islands off of the coast of Stagenheim. The regular volcanic activity means very few people choose to live there, and those that do are generally devotees of Molton. The islands are rich in gemstones, and export them throughout the world.","coords":[-42.57684921609548,-40.57517339383103]},{"name":"Glass Cliff","description":"The Glass Cliff is a 1000 ft. smooth vertical plane that sits on the southern border of Eldoran on the Elathian continent and runs for nearly 300 miles across, a remnant of the God's War, most historians and theologists believe it to be the work of Molton, the God of Fire. Nevertheless, it serves as an effective border between Eldoran and Malinval, and ensures relative safety from direct invasion for both sides. Attempts to take samples by the elves have proven that it is not in fact glass, but a smooth, dense diamond lattice not even adamantine can puncture, and that appears to absorb magical energy.","coords":[34.02591682124144,30.679472263203255]},{"name":"Golden Pass","description":"The Golden Pass lies between Demal Thor and Malinval, and has been a common invasion route for the orcs. On the Demal Thor side the ancient fortress city of Aridhem, the only permanent settlement of the Moon Elves, guards the pass. The pass itself is named as it is because of the way it shines in the sun, however prospectors who have braved the journey come back with little worth risking a mining venture in such a dangerous territory.","coords":[43.81124281565437,47.5438425181514]},{"name":"Isle of Peaks","description":"A massive mountainous island off the coast of Malinval, it is almost like a river delta gone wrong with it's place at the mouth of the Sindi Okra. The island was an ordinary flat river delta until the Gods raised Titan's Peaks around Nerim to the southeast. The following decades saw massive volcanic activity in the surrounding oceans and islands, turning the island of Tenecha, and Sindi Okra's river delta into large mountainous areas, as well as the formation of a number of small isolated volcanic islands, including the particularly large island of Marinda.\n\nToday the Isle of Peaks is home to several large warring tribes of hobgoblins, gnolls, and bugbears.","coords":[10.672079237984406,62.69542516908133]},{"name":"Kandor River","description":"The Kandor River later gave its name to the kingdom it runs through. The city of Northport sits astride its head waters in the south, and it flows northwest to Kaland in the north, crossing the kingdom of Kandor, both east to west and south to north in the process.","coords":[70.7183255645507,60.08099012941146]},{"name":"Liga River","description":"Literally translating from orcish as \"Small River\". The Liga's watershed is a relatively sparsely populated area largely separated from the rest of Malinval both physically and culturally. Where the large population centers of central and northern Malinval have consistently sat on a wartime footing, the villages and small cities along the Liga have almost always just kept to themselves.","coords":[10.350045832740452,53.763411409651845]},{"name":"Mashashana River","description":"The Mashashana River, the second longest in the world and by far the largest by volume, draws water from two massive mountain ranges, and pulls in additional flow from the Elemental Plane of Water at Mirage Lake. Running north through the great expanse of the Veldt, it's headwaters lie in the dragonhome mountains above Saldan, while it's mouth flows into a massive delta system on the northwestern shores of Riftlan.","coords":[17.697016118192607,-100.64617336948415]},{"name":"Mirage Lake","description":"Located in the center of the Veldt, Mirage Lake is rumored to sit on top of a portal to the Elemental Plane of Water. Whatever the source, it is the home of a wide variety of unusual and magical creatures, many of an elemental variety. The water of mirage lake is said to be extraordinarily pure, free of salts and other contaminants.","coords":[7.940236025285963,-97.08884526883101]},{"name":"Mithril Hills","description":"The Mithril Hills is a hilly trailless area along the border of Eldoran and Curinor rich in mithril and other valuable minerals. The two countries have disputed over ownership of the hills for centuries, and the wars typically only stopped when one side or both became involved in some other conflict.","coords":[61.79941707164933,28.040871162517014]},{"name":"Moon Pass","description":"Moon Pass for many centuries was internal to Eldoran, simply a way across the mountains that separated the lands of wood elf from moon elf. When Demal Thor declared independence, that changed quickly. Instead it became a major strategic strongpoint, and the site of several major battles. The successful defense of the pass by the moon elves meant that the high elves had to either attack north of the mountains, where their supply caravans were regularly raided by dwarf irregulars, or to the south, where the bulk of the moon elf army held them at bay.","coords":[50.99344659285936,29.75365876653516]},{"name":"Mount Frost","description":"Mount Frost is known as the coldest place in Elathia. A lonely mountain just miles from the sea shore of Kandor, in an area that is otherwise flat farmland. Mount Frost is known as a roosting place for silver dragons, who can be regularly seen soaring overhead. The locals regularly leave offerings for the dragons at the foot of the mountain, and meanwhile the area for 50 miles around has become known as the safest place to farm in Kandor.","coords":[74.15527649675724,63.06511913525056]},{"name":"Nadrak River","description":"The River Nadrak runs out of the black shard pass, through the hills surrounding Malgeth and meeting trade off the Little Nadrak coming from Parakas. Eventually it runs through Morda'serek'hai before hitting the coast through the ruins of Peloria. The Nadrak and its tributaries are the primary vehicle for trade in eastern Malinval.","coords":[41.58309321017146,78.49111413274336]},{"name":"Nasraigh Fiornde","description":"The wide strait between the Island of Eldoran and the Elathian continent is one of the busiest trade routes in the world. The elven navy ensures the security of merchantmen (in return for a sizable tax) and it is the only connection between Morrindim, Dera'Dragorim, Kandor, and Dormania that doesn't go through orc controlled waters. The name translates to The Narrow Ruby Throat, and comes from a time when the tax was equal to 'the value of a ruby the size of an elves thumbnail', and the punishment for attempting to evade the tax was death by slitting of the throat. Since then the Morrind have successfully lobbied for the tax to be reduced and the punishment less severe (now it is imprisonment and a lengthy fine), but the name nevertheless remains.","coords":[56.879374361521585,7.388469750553215]},{"name":"Red River","description":"Zelfir produces the best steel outside of Parakas, and the reason shows up in their famous red river. The river gets its color from the iron ore that lines its bed and washes down from the mines in the hills. The ore is not special, but the quantity of untapped reserves means iron is cheap, and so smelters have more leeway to experiment with alloys without wasting expensive raw materials. While they have not been able to mimic the famous red steel produced from the iron of the rust desert, the smelters of the red river valley are truly skilled artisans.\n\nOutside of the steel industry, the red river also provides the bulk of water supplies for Zelfin and much of the countryside of Zelfir.","coords":[-38.26352383635067,-87.57498305431115]},{"name":"Rock River","description":"The rock river runs through the heart of curinor, pulling its source waters from the Runic Mountains and the Mithril Hills. It feeds farms and communities of plains dwarves all along its length, who named it 'Rock' so they could claim to live close to the 'Rock', raising their status among their peers. This reinforced the increased wealth and opportunity that access to fresh water provided them, and meshed with the traditional dwarven caste system, allowing the surface living plains dwarves to have their own system of status despite being the lowest outcasts among dwarven society as a whole.","coords":[63.884528715917604,37.04782012523622]},{"name":"Runic Mountains","description":"After the Gods War, a group of dwarves led by a young warrior named Curin found themselves living in an unusual natural cave system deep in the mountains of central Elathia. The walls of the caves were covered in a script that none alive could read, but which the dwarves called 'runes'. The mountains themselves soon took the name, becoming the 'Runic Mountains', and over time dwarven scholars would learn to decipher the writings, and discovered their magical import.\n\nToday that original cave system is lost, perhaps destroyed to make room for some dwarven hold or other, but the name remains as a herald that 'here there be dwarves', and pointing the way to the largest, most imposing natural mountain formation in the world.","coords":[64.67150680484569,50.26761853046367]},{"name":"Rust Desert","description":"The Rust Desert is dry yes, but not actually dry enough to be classified a desert in most circumstances. Rather nothing grows there because the entire several thousand square mile area is a massive pit filled with tiny rusted iron filings. Believed to contain more than 90% of the world's accessible iron, its origin is unknown, although it is considered a major strategic resource, and has changed hands multiple times between the orcs and the Dormanian Empire.","coords":[45.229447770946926,66.34147142971108]},{"name":"Ruu River","description":"The Ruu river runs near the eastern border of Hisru'de'tan, along the entire length of the country, with various tributaries pushing deep into hisru territory. The river provides much needed water for the Hisru's herds, and so access to it is a source of constant contention among the tribes.","coords":[-22.653304181183607,-53.53325803498904]},{"name":"Saria Lake","description":"A large lake at the conflux of several major rivers in central Gerasalim. Saria Lake is the only lake on the Elathian continent where you cannot see the far side from the shore. Saria Lake is a major fishery and trade ships put in at a variety of villages and towns along the shore, most notably Strovenguard, capital of Gerasalim.","coords":[57.1965518965869,69.78243762277047]},{"name":"Serpents Spine","description":"The Serpent's Spine is a lengthy underwater ridge that rises to within about 50 feet of sea level along its length, and is covered in coral reef above that tall enough to break the surface in most places. The spine goes for hundreds of miles north and south, separating the isles of the Morrindim from the Atyrean continent. It is impassable by ship except through magical means, which means most traders and ship captains simply go around.","coords":[-36.36711608775211,-28.013253639599835]},{"name":"Sindi Dal'Elda","description":"The 'River of Elf Home' was the site of the first elven settlements after the Gods War, most notably, at its mouth sits the great city of Loridesa, capitol of Eldoran, and seat of the largest kingdom by land area in the world.","coords":[58.09021867912491,-18.96954347524284]},{"name":"Sindi Estel","description":"Sindi Estel, the River of Hope, was named such because the elven vessel that discovered the river had run out of fresh water only to discover the river delta of Sindi Estel and have their crew saved. They subsequently established a fort on the delta and returned to Milan, beginning the long period of elven colonization of Elathia.","coords":[56.10306632645359,18.62862966035583]},{"name":"Sindi Ohta","description":"Literally translated 'War River', Sindi Ohta was for many years the semi-official boundary between Eldoran and Curinor, with the dwarves controlling the Mithril Hills beyond. As the elves continued to gain power and the dwarves military might slowly receded, the border pushed further and further to the north and east, beyond the river, until today it sits 50-100 miles beyond, running through the northern part of the mithril hills and terminating at the Fortress of Light, with the western part of the border changing from Eldoran to Demal Thor half way between.\n\nThe land surrounding the river is sparsely populated, with the only settlement of any size being Storval, a minor elvish city that sits astride the trade routes coming west from Gerasalim and Curinor.","coords":[60.65736799498726,25.52369770730076]},{"name":"Sindi Okra","description":"Sindi Okra, when considered together with the Ara River (which really is the same river on the other side of Saria Lake), is the longest river system in the world. The Sindi Okra branch, literally translated from Elvish to mean Orc Waters, runs from Saria Lake south through the blighted gap, past Makir, Marinval, and Gulutheim to finally flow into the south sea 6000 miles south of the headwaters of the Ara. Despite crossing through a major war zone, the river acts as a primary conduit for trade across large swaths of the continent, although by the time it reaches Gulutheim the water is so poluted as to be completely undrinkable.","coords":[38.62599040724098,61.272649237321]},{"name":"Sindi Silme-Ranna","description":"Flowing westward from it's headwaters above Aridhem to its final termination at Estapor, The River of the Moon Elves was the migration route for the eastward flowing settlers from Eldoran who settled Demal Thor. The river's route points in the direction of the largest moon of Elthelas, Ara, giving the moon elves their original name, 'those who follow the moon'. Today it provides an avenue for trade for the two elven nations, and an important connection to the sea for Demal Thor.","coords":[37.34450497634804,27.983085036147354]},{"name":"Smuggler's Pass","description":"The Smuggler's Pass is named such because it is a well known route for smugglers who trap various creatures, extra-planar or just dangerous, on the central steppes of the Veldt on the journey to the coast where they can be shipped and sold on the black market or otherwise throughout the world. In ancient days it was a major throughway of Dera, but today little remains of the once broad roads. The city of Portsmith was actually founded at least in part to help combat the smugglers.","coords":[7.7661034142890255,-87.12502548004801]},{"name":"Staelic River","description":"Running through the western woods of Staelia, the Staelic river serves as an important break point in their defense against the trolls and giants who come down from the Gorgro plateau. The river has fortified embankments all along the eastern shore, with fortresses hovering over irrigation channels that run further east.","coords":[-53.03419420606098,-54.53275856777136]},{"name":"Sword Mountains","description":"The Sword Mountains are the northern extension of the Black Peaks, separated from them by the World Crack in the east and the plains of Gerasalim in the west.  They are rich in a number of valuable minerals, including copper, iron, as well as the worlds largest deposits of adamantine.","coords":[65.33992044134308,88.45680461679052]},{"name":"Titan's Peak","description":"The only act of major divine intervention to occur since the Gods' Agreement, the Titan's Peaks are actually a broad ring of mostly impassable mountains that circle what was once the subcontinent of Nerim. After the Nerim Cataclysm the Gods agreed that the undead needed to be stopped, and worked together to create the barrier.","coords":[1.0779698465858916,81.95699524769597]},{"name":"Troll Pass","description":"The Troll Pass is less a pass, and more a wide ramp that flows down from the high plateau of Gorgro , cutting through the surrounding mountains. It is the primary route by which trolls, ogres, giants, and other monstrous creatures of the plateau leave to raid the surrounding lands, particularly Staelia.","coords":[-48.61747733567233,-57.788906187837654]},{"name":"Undead Woods","description":"The first major conflict of the Mithril Wars saw the dwarves attempt to invade Eldoran in force. They landed a large army on the northeast shore of Eldoran, and started a campaign of destruction through the forests there, forcing the residents to flee or be killed. The elves were taken by surprise, expecting the dwarves to attack elsewhere. When they finally were able to field a significant enough army to take on the dwarves assault, the battle was long and bloody, and neither side gave up an inch until only a bare fragment of either army remained, and the fighting had continued for 6 days. Finally, the dwarves retreated, leaving behind their dead and making for the shore, where the Morrind ships that had taken them there waited. As time passed rumors began to spread that the woods where that final battle had taken place, and all the area that the dwarves had laid waste to were haunted, and those who tried to resettle that land were never heard from again. Today they are called the Undead Woods, and they are forbidden ground.","coords":[59.94469496963479,-2.7422498565088014]},{"name":"Veldt","description":"The Veldt is a large savannah that occupies the bulk of the western continent north of Zelfir and west of the mountains that marked the ancient border of Dera . The veldt is known for having weak planar boundaries, and monsters of many kinds have made their home their over the years. It is considered highly dangerous, and there are no known humanoid inhabitants.","coords":[4.325870873008957,-98.83402620501526]},{"name":"World Crack","description":"The World Crack is a massive canyon that separates the bulk of Dormania from Gerasalim, Malinval, and Arad. The Crack is roughly a mile and a half deep at its deepest, about 600 miles long, and about 80 miles wide at its widest point. Most of the canyon is filled with water at the bottom. The crack is a remnant of the God's War, and whatever cataclysmic event caused it is lost to history. The city of Malidal is built on a magically-supported platform at the water level on the Dormanian side of the crack at a low point in the wall. A long ramp leads down the approximately 3000 feet to get to its level over a length of about 15 miles. Two major rivers drain into the canyon, one at the northern terminus, and the other near Malidal, both river mouths are a sight to behold as the water cascades several thousand feet down in a great waterfall.","coords":[53.71052639598225,96.21215937676125]},{"name":"Yellow River","description":"A silty, oft-flooding mess of a river, the yellow river is named for the yellow color it gets every time it floods (which it does at least once every spring). These floods provide fertile soil for the eastern farming communities of Dormania. The river in fact, is two rivers that meet a mere 30 miles from the coast, named, appropriately, the West Yellow River and the East Yellow River.","coords":[71.08162716353847,92.10970135182178]}]}