{"model":"Nation","documents":[{"name":"Alfadir","primelanguage":"","seclanguages":[],"coords":[-42.146096259707384,-63.21293757045058],"bordercoords":[[-36.70531110774926,-53.53414093322117],[-38.4810072394296,-62.18591421505654],[-39.97869861176252,-69.34448804723503],[-40.80497409762779,-69.82218406942073],[-42.25240953731371,-69.16341960633683],[-43.98441605494319,-70.83228957948273],[-44.95653822732272,-72.32548902913959],[-45.080793767920255,-65.29866808957787],[-46.792068161928825,-58.45717856158622],[-46.00411630923806,-54.855932830060844],[-41.63135419009182,-55.0652787821586],[-39.664385162230374,-53.89803632684293]],"color":"#0000FF","map":"https://elthelas-images.herokuapp.com/maps/nations/Alfadir.jpg","capitol":"Dieel","cities":["Fradae","Damat"],"landmarks":[],"borders":["Hisru'de'tan","Stagenheim","Staelia","Zelfir"],"population":3000000,"populationDistribution":[{"race":"Staelic Humans","proportion":0.6},{"race":"Hisru Humans","proportion":0.15},{"race":"Strongheart Halflings","proportion":0.06},{"race":"Tallfellow Halflings","proportion":0.05},{"race":"Morrind Dwarves","proportion":0.04},{"race":"Stagen Gnomes","proportion":0.04}],"government":"Alfadir is a country that can be bought. The primary government in Alfadir is the Council of Lords, however titles are not hereditary or elected, but rather purchased, as an optional, and very significant, tax. Once a title is paid for it lasts 10 years unless the tax is paid again. Thus the wealthiest members of society make the rules, and outside forces sometimes make large inroads into Alfadiran society through the influx of money. Indeed there are 3 members of the council who are in fact Morrind Dwarves, and 2 from Staelia, 1 from Hisru'de'tan, 2 from Zelfir, 5 from Dera'Dragorim, and 6 from Stagenheim. There is no limit to the number of lords that sit on the council, and the funds raised by the tax go to civic improvements and the maintenance of the army, often through generous no-bid contracts to council members.","ruler":"Council of Lords","history":"Alfadir was originally a Staelic colony by a group of merchants who hoped to escape the endless wars with the trolls. It worked, and the colonies position on two major rivers that come out of the gnome-controlled mountains of stagenheim means that there are a bevy of goods to carry to the coast. Additionally, Alfadiran merchants handle most of the purchase and sales of Hisru cattle to lands that need it, such as Zelfir and Stagenheim, and control the ports in the villages that line the isthmus between Zelfir and Hisru'de'tan, and in the Hisru city of Atyrao.","gods":["Maris","Sara","Trimala"],"worship":"Maris, god of trade, travel and divination is the primary patron God of Alfadir, but most of the common folk worship Sara or Trimala.","culture":"Alfadir is a country where anything can be bought for the right price, even things that are nominally illegal can usually be obtained if one has the money to pay for a title first. Corruption is rampant, and it is simply expected that obtaining government services will require a bribe of some sort. The poor tend to keep their heads down and work their land.","economics":"Alfadir's economy revolves around the river trade and cash crop farming within the fertile flood plains of its rivers.\n\nMost of the land in Alfadir is owned by the very wealthy, who rent out portions of it to poorer farmers rather than work it themselves. Cash crops such as cotton and dyes are common more inland, while the coastal region is the worlds largest producer of sugar.","slavery":"Slavery is nominally illegal in Alfadir, however indentured servitude is common.","magic":"Magic users are free to practice in Alfadir, and there is a major research college in Dieel, sponsored by the government.","property":"Property rights are strongly protected and almost anything except the rivers and the public roadways can be bought.","citizenship":"Alfadir does not have citizenship requirements, anyone who lives or comes to Alfadir is treated the same way, and always based on the size of their wallet."},{"name":"Arad","primelanguage":"Neran","seclanguages":["Orc"],"coords":[44.73210119404699,90.05959417373937],"bordercoords":[[49.98699361915004,93.93486762289477],[45.98980600197725,86.1216262085378],[40.48925963597949,85.4189441145816],[37.866722853218626,86.7803906716217],[42.43207267241209,90.29144820304472],[45.836932440121316,93.8926939345701],[47.7619452898863,94.33187024329271]],"color":"#000000","map":"https://elthelas-images.herokuapp.com/maps/nations/Arad.jpg","capitol":"Albeliath","cities":["Faran"],"landmarks":["World Crack"],"borders":["Malinval","Terron","Dormania"],"population":600000,"populationDistribution":[{"race":"Neran Humans","proportion":"0.84"},{"race":"Imperial Humans","proportion":"0.07"},{"race":"Lightfoot Halflings","proportion":"0.06"}],"government":"Arad is a monotheistic theocracy that worships Nera, Goddess of death and rebirth. Their government is led by her Prophet who has led the country since the demise of Nerim, although it is rumored that he is looking to die soon.","ruler":"The Prophet Albeliath","history":"Arad was already a colony of Nerim at the time of the cataclysm, however the church there was largely disconnected from that on the subcontinent. For years prior to the fateful day that ended the Empire, the priests in Arad had told of the corruption of the church and warned that the Emperor's quest for immortality was against the teachings of Nera.","gods":["Nera"],"worship":"Nera is the only God worshipped in Arad, if not by law then by practice. They consider themselves the true followers of Nera and that the church of Nerim at the time of the cataclysm was corrupt and misinterpreting her words, particularly the emperor who thought to be immortal, for while Nera may grant long life to her most faithful subjects, all beings must die so that their souls may be reborn. There is a great deal of misunderstanding about the beliefs of the people of Arad, and many nations have severed diplomatic relations with them fearing that they will cause another cataclysm.","culture":"The people of Arad are very formal, and always polite. They take for granted the appearance of certain things that others would consider horrible or disconcerting, such as the presence of deathless (which few outside of Arad can distinguish from typical undead) and faithful clerics who are approaching 3 or even 4 hundred years of age.","economics":"Arad is primarily agrarian, with many orchards and wineries. They export fine wines and artisan cheeses as well as dried fruits such as prunes and apricots.","slavery":"While the people of Arad do not keep slaves, slavery is allowed by treaty with Malinval that also keeps the orcs from invading. People who have not traveled to Arad often believe that they keep undead slaves to do all of their work. The fact is that undead in the typical sense are very rare in Arad, kept only by a few skilled necromancers. Rather deathless, who come back to aid their families by choice, appear quite commonly, particularly if they were devout followers of Nera.","magic":"Arcane magic is not illegal in any way, but most people in Arad see it as inferior to divine blessing.","property":"Property in Arad is owned by families and passed from generation to generation. Family estates tend to grow as families expand, rather than children move away. When two people are married, the man generally moves in with the woman's family.","citizenship":"Only followers of Nera are granted citizenship in Arad."},{"name":"Asura Confederacy","primelanguage":"Hisru","seclanguages":["Dwarf, Elf"],"coords":[-16.2,-140.6],"bordercoords":[[-11.525778716699989,-137.24121093750003],[-10.133820586900628,-141.08642578125003],[-7.223524433766947,-143.67919921875003],[-5.651518917890183,-146.44775390625003],[-5.695248967605625,-148.55712890625003],[-7.9,-149.7],[-10.385168447070184,-149.89746093750003],[-12.460714617547069,-150.84228515625003],[-14.08596532711486,-151.63330078125003],[-15.742032029750966,-153.34716796875003],[-17.845446982925584,-154.27001953125003],[-19.924294950473808,-154.00634765625003],[-20.460469486630767,-145.26123046875003],[-25.95063596244655,-139.19677734375003],[-24.119181784645278,-132.47314453125003],[-22.626687362153042,-131.55029296875003],[-21.772253578222447,-131.46240234375003],[-15.572773625363597,-131.28662109375003],[-14.511803324514721,-130.75927734375003],[-11.73023482493298,-130.71533203125003],[-11.299627795341117,-132.16552734375003],[-11.902291077727055,-133.92333984375003],[-12.93229151092004,-134.84619140625003]],"color":"#440066","map":"","capitol":"","cities":[],"landmarks":[],"borders":[],"population":2100000,"populationDistribution":[{"race":"Hisru Human","proportion":0.2},{"race":"Deran Human","proportion":0.2},{"race":"Elf","proportion":0.22},{"race":"Dwarf","proportion":0.22},{"race":"Strongheart Halfling","proportion":0.1}],"government":"","ruler":"","history":"The Asura Confederacy is a collection of elven, dwarven, halfling, and human city states that have banded together for mutual defense and trade. They face regular threats from the Yuan-ti to the north as well as a large number of lizardfolk, gnoll, and goblinoid communities within the confederacies larger borders. Internal strife between the city states is also not uncommon, as rulers vie for power within the confederacy. The infrastructure necessary for empire management has never existed however, and so these would be Kings of Asura have rarely gained much traction.","gods":[],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Blood Empire","primelanguage":"Goblin","seclanguages":["Neran"],"coords":[-46.12274903582431,114.74121093750001],"bordercoords":[[-41.370625341989026,119.55322265625001],[-42.38492275784806,115.59814453125001],[-43.22319117678929,111.02783203125001],[-41.73237975329554,106.41357421875001],[-43.86027718467949,98.15185546875001],[-43.923615428841146,94.15283203125001],[-41.56819689811342,89.49462890625],[-42.124710287101955,86.41845703125],[-44.896741421341964,83.21044921875001],[-45.485169153401216,83.73779296875001],[-45.5775226948369,83.86962890625001],[-46.31089291474789,83.47412109375001],[-52.2631146369856,85.45166015625001],[-53.56152036189747,86.77001953125001],[-54.41413535660238,88.30810546875001],[-55.3244568589177,90.59326171875],[-56.091959387071775,90.90087890625001],[-56.3363340484037,89.18701171875001],[-56.9404795880411,88.92333984375001],[-58.0270095822495,94.81201171875001],[-57.81696660217842,98.02001953125],[-57.0362467940865,102.94189453125001],[-55.374428810207625,106.58935546875],[-55.048482452429475,108.34716796875],[-54.18333391577665,111.15966796875001],[-53.76981918576237,117.00439453125001],[-51.44887208400474,124.43115234375001],[-49.548379811426386,129.96826171875003],[-48.71452483966838,131.77001953125003],[-47.807620817180705,132.95654296875003],[-46.67394106549698,141.52587890625003],[-44.803275645550436,143.02001953125003],[-43.38309377382829,140.99853515625003],[-43.22319117678929,137.92236328125003],[-42.99862111927107,134.93408203125003],[-42.44980808481614,134.45068359375003]],"color":"#664444","map":"","capitol":"","cities":[],"landmarks":[],"borders":[],"population":22100000,"populationDistribution":[{"race":"Hobgoblin","proportion":0.5},{"race":"Goblin","proportion":0.4},{"race":"Bugbear","proportion":0.15}],"government":"The Blood Empire is a military oligarchy run by a council of generals.","ruler":"","history":"The Blood Empire was forged by the hobgoblins uniting to defend themselves against the Neran Empire. When the Empire imploded, the wave of instant death the Emperor unleashed covered the northern part of the Blood Empire, extending much farther south than it did in any other direction. Any creature that dies in the northern desert or mountains of the Blood Empire rises from the dead by the next morning. This has given the Empire an enemy that is neverending.","gods":[],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Curinor","primelanguage":"","seclanguages":[],"coords":[62.360441597190544,39.90565971761762],"bordercoords":[[53.91121454964488,32.84711854652224],[49.87384022957383,44.26570257331004],[49.160603679993315,54.310230333158586],[57.87433972843447,59.36075788346858],[63.49497665139195,54.925077165370254],[67.41197128562575,50.73497765008041],[69.02559283725621,49.54920161652939],[70.38177353245575,49.19786056955131],[72.53163405391571,43.13635626636939],[71.40288755930774,41.77490970932932],[70.39652289651721,38.74459317914335],[70.02457537044215,35.18723739686247],[69.3534549454494,33.47298266657413],[67.79705234232529,30.794007183366205],[63.94250055832521,25.699562002183967],[62.8805099605879,24.118527290782605],[60.0706649887424,32.199371371278566],[55.98032952249634,34.527005807508374]],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Curinor.jpg","capitol":"Curin Keep","cities":["Torin Hammer","Stromforde","High Hammer","Granite Bluff"],"landmarks":["Blighted Gap","Fortress of Light","Mithril Hills"],"borders":["Eldoran","Demal Thor","Malinval","Kandor","Gerasalim"],"population":2600000,"populationDistribution":[{"race":"Hill Dwarves","proportion":0.45},{"race":"Plains Dwarves","proportion":0.27},{"race":"Deep Dwarves","proportion":0.1},{"race":"Half-Dwarves","proportion":0.12},{"race":"Imperial Humans","proportion":0.04}],"government":"Curinor is ruled by the under-king, who is really more of a temporary elected president, as he serves a 5 year term and has greatly limited powers. The bulk of governing power lies with the Curin Congress, an assemblage of Deep Dwarves, elected by the deep dwarves of each hold.","ruler":"Under-King Magnor Stoneshield","history":"The dwarves found themselves in an unlikely place in Curinor. While the large mountain ranges made for excellent places in which to dig their holds, they were stuck with enemies on every side, with the human kingdoms on the east, the elves to the west, and the orcs to the south. Nevertheless, for most of their history they have thrived reasonably well. They subjugated the nearest human kingdoms to them, and used them to supply grain and other farm products to the holds while exporting metals and finished goods. It was a good situation until Dorman I invaded the vassal kingdoms. He crushed the dwarven army, and even managed to capture a number of the small holds along the border of Curinor. He even laid siege to Curin Keep for several years before giving up. The dwarves managed to maintain their sovereignty, but they have been in decline ever since, with their population shrinking and near-constant wars with the elves. In recent years they have even lost any effective presence in the Mithril Hills, bringing an end to over 1000 years of conflict with Eldoran over those lands. And clearing the way for both the Elves and Dwarves to join the Alliance of 6 Nations, and the construction of the Fortress of Light by Dwarven engineers.","gods":["Dorun","Amathera","Tock","Chthonis","Vulcan"],"worship":"Dwarves are not a typically religious people, but they all revere Dorun, patron God of the Dwarves and Deep places. The poor plains dwarves often worship Amathera as well, entreating her for protection.  Tock, god of machines, learning, and invention and Vulcan, god of smithing, are often worshipped by the smithing and artisan class. The Deep Dwarves also regularly revere Chthonis.","culture":"Society in Curinor is caste based, depending on how deep in the mountains you and your ancestors lived. Those dwarves that almost never see daylight, the Deep Dwarves, are the highest caste, and hold most of the political and economic power, while the Hill Dwarves that make up the bulk of the population live in the caves closer to the surface and regularly travel to trade with other peoples. Meanwhile the Plains Dwarves are farmers and craftsman that live on the open central plain of Curinor, and are shunned by most other dwarves. The dwarf holds are huge cave systems built into mountains and deep in the earth.","economics":"Curinor exports a wide variety of valuable minerals as well as stock metal. They also export weapons, armor, fine metalwork crafts and coal","slavery":"Slavery is illegal, but many Plains Dwarves live in effective slavery due to their caste making it impossible for them to earn more than a subsistence wage.","magic":"Licenses are required to practice magic in Curinor.","property":"Where one is able to purchase property depends on ones caste. A Plains Dwarf is not permitted to purchase property within the holds, while a hill dwarf must purchase property within half a mile of the surface. The Deep Dwarves are the only ones allowed to live and own property in the deep mines where the mineral veins are the richest, although they usually hire hill dwarves to do most of the actual work of mining.","citizenship":"Only deep dwarves hold any political power in Curinor, while the laws on the books nominally state that any dwarf (technically including the Morrindim) or half-dwarf is a citizen of Curinor."},{"name":"Degak'Ta","primelanguage":"","seclanguages":[],"coords":[-27.896135525750502,41.74876076961016],"bordercoords":[[-32.61392993783565,45.59326171875],[-33.82707529344597,44.62646484375001],[-33.27773164255521,42.69287109375001],[-34.118626335469514,42.07763671875001],[-34.118626335469514,40.23193359375001],[-32.79881885529199,39.30908203125001],[-32.24300560401557,38.60595703125],[-31.79588964057516,38.56201171875001],[-30.89515437144469,38.69384765625001],[-29.52806029506425,38.12255859375001],[-27.520451064122128,37.68310546875],[-25.792472545052053,37.68310546875],[-25.276987151369237,37.33154296875001],[-24.599577462003495,37.28759765625001],[-23.717468136962662,38.03466796875001],[-23.314513287569504,38.86962890625001],[-22.3424548401465,39.17724609375001],[-21.731437277824014,40.62744140625001],[-22.5861184893211,43.26416015625001],[-24.319568189281284,45.85693359375001],[-27.792920984444557,45.28564453125],[-29.068173545070522,44.45068359375001],[-29.757224408272663,45.02197265625]],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Degak'Ta.jpg","capitol":"Sunra","cities":[],"landmarks":[],"borders":["Morrindim","Malinval","Nerim"],"population":800000,"populationDistribution":[{"race":"Trollkin","proportion":0.7},{"race":"Ogres","proportion":0.2},{"race":"Trolls","proportion":0.05}],"government":"The trollkin government is in the form of disciplined military regiments. The ultimate ruler is the grand marshal, however his primary responsibilities are the approval of large scale mercenary contracts and the appointment of the generals.","ruler":"Grand Marshal Gorok Hagmar","history":"The Trollkin were an experimental half-breed race that came about during the God's War. They were discarded as too weak as compared to their troll forebears and were thus left to their own devices. They found a place for themselves on the island of Degak'Ta, and despite the poor opinion of them held by the Sorceron who had created them, the Trollkin are exceptionally disciplined and capable fighters. The Trollkin have built the wealth of their country on their value as mercenaries, and most every major war has involved trollkin mercenaries on one or both sides.","gods":[],"worship":"Degak'Ta is officially non-theistic to avoid conflicts of interest with potential employers.","culture":"Degak'Ta sees a lot of cultural imports, but the primary culture consistently remains Spartan and militaristic in nature.","economics":"Trollkin do not have many merchants or much of a merchant marine, particularly for an island nation. They do, however, have a sizable navy that transports their mercenaries to where they are needed. Trollkin mercenaries send most of the money they earn home to support their families back in Degak'Ta.","slavery":"Slavery is not strictly illegal in Degak'Ta, but the Trollkin do not keep slaves themselves.","magic":"Those who are capable mages are encouraged to pursue the craft for military purposes, and their is a small warmage college in Sunra.","property":"Any citizen can hold property in Degak'Ta as long as it is within the disgnated area apportioned for their regiment.","citizenship":"Anyone can join the mercenary bands of Degak'Ta, and 2 years of honorable service earns citizenship in Degak'Ta. Because they are so accepting of capable soldiers that may not be accepted elsewhere, there is actually a sizable minority of ogres who have emigrated to the island over the years, as well as a few full-blooded trolls."},{"name":"Demal Thor","primelanguage":"","seclanguages":[],"coords":[47.71068560344829,38.85019713204094],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Demal Thor.jpg","capitol":"Aridhem","cities":[],"landmarks":["Moon Pass","Blighted Gap","Fortress of Light","Golden Pass","Glass Cliff"],"borders":["Eldoran","Malinval","Curinor","Gerasalim"],"population":500000,"populationDistribution":[{"race":"Moon Elves","proportion":0.9},{"race":"Wood Elves","proportion":0.05},{"race":"Half-Elves","proportion":0.04}],"government":"Demal Thor is governed by a confederation of tribes. The chiefs meet yearly at Aridhem to discuss disputes and determine each tribes contribution to the forts in the Golden Pass, the Fortress of Light, and other border forts along the gap.","ruler":"","history":"The Moon Elves were originally Wood Elf settlers who took to the grasslands on what was then the far eastern edge of Eldoran as hunter-gatherers. As the closest elves to the humans, dwarves, and orcs, they routinely took the brunt of most wars waged by the homeland. After yet another war with the dwarves over the Mithril Hills led to the destruction of several of their tribes, the Moon Elves declared independence. While they are part of the Alliance of 6 Nations and are the defenders of the Golden Pass against the orcs, the Moon Elves find the situation much preferable to what they had before.\n\nCurrently the Moon Elves are struggling as a people. The recent orcish advance has sent several waves of armies through the Golden Pass, bypassing the Fortress of Light, while another Orc army pins down the bulk of Alliance forces in an endless siege at the blighted gap. The proud fortresses that once defended the pass are now little more than rubble, and Aridhem is an occupied city. The tribes themselves are scattered, disorganized, and without help may soon face extinction.","gods":["Maris","Sylvan","Gaian"],"worship":"Each tribe usually has 3 priests that share a mobile temple, each priest dedicated to a different God. The temples are simple affairs where the moon elves visit to pray and make offerings before undertaking difficult tasks or journeys.","culture":"The Moon Elves of Demal Thor are wandering hunter gatherers who follow the herds of buffalo through their land. They are used to a rough life living in tents, and differ significantly from other elves in their necessarily pragmatic outlook on life. The only permanent settlement in Demal'Thor, the capital Aridhem, is only sparsely populated most of the year.","economics":"While the economy of Demal Thor is primarily subsistence they do export ivory and leather goods, as well as the eastern world's fastest horses.","slavery":"Slavery is illegal in Demal Thor.","magic":"Local mages are given duties to support their tribe, outsider mages are viewed with suspicion but not strictly prohibited from practicing their craft.","property":"Land cannot be owned in Demal Thor except by tribes. Family groups will typically own their own tents and supplies however. Food from hunts is distributed evenly among those who participated and their families, with a small portion for orphans, the tribes priests, and the disabled.","citizenship":"Non elves are not allowed tribal membership in Demal Thor, Elves who are not born into a tribe and wish to join usually have to prove their loyalty to that tribe."},{"name":"Dera","primelanguage":"","seclanguages":[],"coords":[24.148006717536955,-90.86324427641067],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Dera.jpg","capitol":"Dera","cities":[],"landmarks":["Veldt","Demon Peaks"],"borders":["Dera'Dragorim"],"population":5000,"populationDistribution":[{"race":"Fey'ri","proportion":1}],"government":"Dera today is ruled by a council of elder fey'ri.","ruler":"","history":"Dera once was a mighty empire, and its capitol city the jewel of the west until a climactic invasion by demons occured. Those who survived fled to a chain of islands to the east, forming the nation of Dera'Dragorim. However, an enclave of elves was among the first to be attacked. They were enslaved by the demons, and the women repeatedly raped. When the demons were driven back, the elves managed to escape. Yet the damage to their bloodlines was done. The women bore half-breed children, and the trauma of that birth left most of them infertile. The half-breeds were viable however, and within a couple of genrations there was not a child born that did not have at least some demon blood. Fearing retribution by others if they tried to reintegrate with common societies, they fled to the ancient sewers of the once great capitol. they remain there to this day, living in squalor, fearful to come out into the light of day.","gods":[],"worship":"The Fey'ri are mostly antitheistic. They particularly revile Bahamut for not saving them from ruin when he rescued the human peoples of Dera.","culture":"The Fey'ri are generally not a kind people. They tend towards evil more than most people due to the influence of their blood. They are cruel towards failure and seek power over their peers.","economics":"The Fey'ri have a subsistence economy, hunting the creatures of the sewers and growing whatever they can(largely things like mushrooms) where sunlight filters down from the ruins above. Gifted mages among them often use their talents to create basic necessities of living more than grand arcane art.","slavery":"The Fey'ri do not have enough strength to take slaves, yet most have no moral objection.","magic":"Magic is not regulated among the Fey'ri, and they tend to be gifted sorcerers.","property":"Property is minimally protected, but can be taken through challenge.","citizenship":"Fey'ri are distrustful of outsiders, and are more likely to kill strangers in their land then even talk with them."},{"name":"Dera'Dragorim","primelanguage":"","seclanguages":[],"coords":[19.49895870273904,-57.74935059872609],"bordercoords":[[14.016690919227486,-46.99951171875001],[13.632641180688484,-53.63525390625001],[13.07680293502934,-61.14990234375001],[11.746369681911013,-64.00634765625001],[9.110232637514535,-64.79736328125001],[8.15439934578613,-68.22509765625001],[7.675607480343972,-71.56494140625001],[8.197897975919595,-74.37744140625001],[6.192437893691237,-83.03466796875001],[11.789391345177572,-85.27587890625001],[12.691253472166489,-78.11279296875001],[11.013992545290018,-72.83935546875001],[15.58864754638038,-66.86279296875001],[20.153941536577417,-64.46777343750001],[23.175713800385203,-61.04003906250001],[26.524650377182788,-61.12792968750001],[32.51671004436773,-61.63330078125001],[35.0367432201753,-59.83154296875001],[35.3308118573182,-46.88964843750001],[35.1154153142536,-42.5830078125],[33.224903086263964,-41.44042968750001],[27.37908429955532,-48.31787109375001],[25.013439812256372,-47.43896484375]],"color":"#9999FF","map":"https://elthelas-images.herokuapp.com/maps/nations/Dera'Dragorim.jpg","capitol":"Vasha","cities":["Vashna","Delan","Portsmith"],"landmarks":["Smuggler's Pass"],"borders":["Dera","Eldoran","Gnarra"],"population":6300000,"populationDistribution":[{"race":"Deran Humans","proportion":0.75},{"race":"Dragonborn","proportion":0.12},{"race":"High Elves","proportion":0.08}],"government":"Dera'Dragorim is ruled by the Dragon Emperor, an Elder Gold Dragon who has grown accustomed to human form, and who was put in place by Bahamut to rule justly and protect the people. There have been rumors that the Dragon Emperor is aging and may soon die, as he has become increasingly reclusive over the last dozen years or so.","ruler":"The Dragon Emperor Valraxa","history":"The islands that make up Dera'Dragorim used to be only distant colonies of the mighty empire of Dera. Dera ruled nearly half of the continent from their mighty capitol near the eastern coast of Riftlan. Yet it would not last. It is not known whether it was the work of some powerful evil wizard or simply a random rift as opens on that continent from time to time, but a portal opened one day high in the mountains above Dera between this world and the endless abyss. It was not long before hordes of demons began to pour through the portal. They marched relentlessly out of the portal in ever greater numbers. Whenever they found human habitation they would murder the men and children, burn everything to the ground, rape those women they desired, and send them onward to tell the tale. It was not long before the horde stood at the gates of Dera itself. Those people who had not already fled were slaughtered. It was just after the burning of the great city that Bahamut intervened. The Dragon God led the metallic dragons from all over the world against the demon horde and drove them back. Finally closing the portal through which they had come. Those demons that survived fled to the western mountains where many remain to this day. Bahamut brought the survivors of Dera to Vasha and Vashna, then small towns and left one of his greatest warriors to rule over them. They renamed their land Dera'Dragorim in honor of the sacrifice the dragons gave for them and took up the worship of Bahamut.\n\nSince then Dera'Dragorim has grown in wealth and prosperity. They have become great traders, rivaled only by the Morrindim and monopolize much of the trade in the west. Their warm fertile islands produce a variety of goods and they have even reestablished colonies on the continent, the largest being the city of Portsmith.","gods":["Bahamut","Maris","Indra"],"worship":"Dragons of all kinds are considered holy in Dera'Dragorim although metallic dragons in particular. Bahamut is the patron God of the empire and his temples are everywhere. Yet they owe much of their wealth to trade and Maris the God of trade has a significant following in the trade enclaves.","culture":"There are many unusual halfbreeds who find welcome in Dera'Dragorim including dragonborn, tieflings, mephlings, and genasi. This is a representation both of their history, and of the highly tolerant nature of their society. Science and magic prosper, and Vashna holds the only alchemists guild outside of Stagenheim. Dragons are not only culturally sacred but militarily important to Dera'Dragorim as they make use of many draconic beasts as both mounts and war machines.","economics":"Dera'Dragorim's economy is based on cash crops which produce multiple times a year (as the tropical climate allows for growing crops year round) and trade. They export silk, citrus, spices, rice, and exotic animals and carry many other goods from one country to another.","slavery":"Slavery is illegal, and slavers are hunted down and killed when discovered.","magic":"The use of compulsions and charms is illegal, however there is no further regulation of magic beyond that.","property":"Only citizens are allowed to own property, however citizenship is not hard to achieve.","citizenship":"Anyone who pledges to obey the laws of the country and serve its interests can be naturalized as a citizen. Otherwise anyone born of 2 citizens is automatically a citizen of Dera'Dragorim."},{"name":"Dormania","primelanguage":"","seclanguages":[],"coords":[67.8180604062138,103.42835470247077],"bordercoords":[[73.40667151856782,77.15694854830423],[71.40288755930774,77.15694854830423],[69.66114385488451,75.18267591787749],[66.25386407845592,74.12865277694321],[66.0762805590054,82.2544387085378],[64.79781874626237,91.78456460781837],[63.884528715917604,92.49807021822059],[59.91682764190146,94.91353991619494],[57.356534533026796,95.52838674840659],[56.90337852240974,95.87972779538467],[56.347370405809556,97.02158619806345],[55.16043536786112,97.81210355376415],[53.49499027578922,98.82220906382615],[47.82099291702753,100.2275732517385],[47.16777652195969,101.7646903322676],[48.11522506232188,104.26799529198647],[52.03264053901125,108.01306310582297],[54.731360856838975,110.20894464943599],[56.71091303022316,110.91162674339219],[58.86525961258023,111.39425009531547],[60.11448725214835,111.21857957182641],[61.21241982497141,110.42806221612571],[62.71981280284028,109.54970959868052],[63.96179789450044,109.68146249129732],[64.53456764831915,109.33341555802019],[65.75347700465251,110.16785054459315],[66.44777128729203,111.17795605465514],[67.91300879667932,112.45156734995071],[69.0098569390557,111.48537947076099],[69.56930102430901,110.78624062515541],[71.20568079894481,111.57675798085612],[72.1853751126503,109.95180563858246],[72.91015411609764,107.84375935671395],[73.41921666801886,105.50845710960034],[73.30597771435797,102.87339925726471],[73.45679682993942,99.4917416801006],[73.34380727719767,94.74863754589649],[73.60629113982226,92.5966736331557],[73.60629113982226,90.0055334116923],[73.07724163906074,83.4178887808532],[73.30597771435797,80.43148988153948]],"color":"#9999FF","map":"https://elthelas-images.herokuapp.com/maps/nations/Dormania.jpg","capitol":"Desadorel","cities":["Sreppe","Farengar","Falak","Malidal","East Dormania","West Dormania","Wayrest","Timberlan","South Port","East Port","Orania","Prince Port","Cur'Lesto","Cur'Mestin","Miner's Rest","Poron","Silver Head"],"landmarks":["World Crack","Great Ramp"],"borders":["Terron","Malinval","Arad","Gerasalim","Kandor"],"population":5600000,"populationDistribution":[{"race":"Imperial Humans","proportion":0.7},{"race":"Lightfoot Halflings","proportion":0.1},{"race":"Imperial Gnomes","proportion":0.09},{"race":"Half-Elves","proportion":0.06}],"government":"Dormania is ruled by the eternal emperor, lord of all the east, Dorman. The Emperor has absolute authority in Dormania, although of course most decisions are made by appointed officials and bureaucrats, all officials serve at the pleasure of the Emperor.  The most recent Emperor, Dorman XXII, died after falling from the highest window in the tallest tower of his palace, shortly afterward his infant son and heir was found suffocated by his nurse.  This has left the government without an obvious ruler for the first time ever, and rule has reverted to the local lords.\n\nThe major cities of Dormania are ruled over by Dukes and Arch-dukes, each of which sits on the Council of Lords, charged by the imperial charter with choosing a new Emperor should the sitting Emperor die without an heir.  Unfortunately the Council has been deadlocked for some time.","ruler":"Until recently, Dorman XXII, now deceased.","history":"The city state of Desadorel was a prominent trade city and independent city state that exported iron, adamantine, and other valuable minerals before Dorman I became the king. With dreams of mighty conquest, he marshaled his troops and conquered several of his nearest neighbors before they really had time to build armies of their own. After a couple years of consolidation he went on the march again, and over his 40 year reign he conquered everything from the eastern coast west to the border of Curinor and south to Dal Okra.\n\nAfter his death it was not long before pieces of the empire began to fall away. First a slow march north by the orcs over a period of nearly 100 years reconquered the southernmost territory north to the Rust Desert, then during the disastrous reign of Dorman V Kandor and Gerasalim both declared independence. Since then the borders have remained fairly stable, although the extent of rule by the central authority has waxed and waned.","gods":["Alohim","Sara","Dorman","Fanome","Maris","Tock","Trimala","Gaian","Molton"],"worship":"The Dormanians have a history of experimenting with different religions, and most every God has a cult of at least some size in the empire. Dorman I, however, does hold a special place here.","culture":"Dormania is a country in flux. The countryside is still largely feudal, with Lords overseeing large areas of land cared for by their serfs, however few Lords have proper castles, but rather live in elaborate manor homes. Meanwhile the cities are home to a burgeoning middle class of merchants and artisans whose power is continually growing.","economics":"Dormania has many commercial centers and is a reasonably wealthy country. The bulk of the land east of the World Crack is made up of large open grasslands where they raise herds of cattle and other livestock. The hills above Desadorel have some of the world's richest deposits of adamantine. The north mostly produces grains, while the area around Malidal produces a number of cash crops such as cotton and olives.\n\nDesadorel is the largest metropolis on the continent north of Malinval, and most any kind of craftsman can be found there, not to mention more beauracrats than you can shake a stick at. Meanwhile Malidal is home to one of the finest colleges of wizardry in the world, (Dormanians would say THE finest, but even the more traveled people would rank it in the top 5.)","slavery":"Slavery is illegal in the empire, however serfdom is the regular order of the day in the countryside.","magic":"A Mage must be a registered member of one of the many magical colleges in order to practice magic legally. However, enforcement of this law outside of the major cities is largely ignored.","property":"Anyone can own property in the empire except for branded serfs.","citizenship":"Their is no legal method of citizenship in the empire, although records of the royal line are kept."},{"name":"Dragonhome","primelanguage":"","seclanguages":[],"coords":[-7.339312794263156,-84.98088381253523],"border-coords":[],"color":"#FFFF00","map":"","capitol":"","cities":[],"landmarks":["Dragonhome Mountains"],"borders":["Dera","Riftlan Wilds","Zelfir"],"population":50000,"populationDistribution":[{"race":"Dragons (metallic)","proportion":0.25},{"race":"Dragons (chromatic)","proportion":0.05},{"race":"Dragonborn","proportion":0.35},{"race":"Deran Humans","proportion":0.25}],"government":"The dragonhome does not have a single government, rather families and clans of dragons are ruled over by the eldest of the tribe, and each dragon has complete autonomy in their dealings with their vassals.","ruler":"","history":"In the early days of the world, dragons were much more common, and lived in many far flung places. After the fall of Dera, however, Bahamut declared the mountains between the east coast of Riftlan and the central Veldt, \"Dragonhome\", and a great migration of metallic and even some chromatic dragons followed. Roosts, dens and dungeons were built and established throughout the vast mountain ranges to house the dragons and their descendents.","gods":["Bahamut","Tiamat","Indra"],"worship":"Dragons worship their Gods as Greatest Among Equals, rather than as lords never to be disobeyed, however they enforce a much stricter worship on their humanoid servants and vassals, who congregate regularly in shrines and temples to their lords respective Gods.","culture":"Humanoids in dragonhome are almost all vassals of one dragon or another, or occasionally to a particular family or clan. As such, almost all decisions of note are made by the dragons, and everything from the sizes of entryways (huge), to the methods of travel (no roads, one is expected to fly between roosts) cater to the particular ways of dragons.","economics":"Dragons are jealous creatures who often collect treasures, but the art of buying and selling is not typical among them. The vassals of the dragons will often collect scales, bones, and other pieces of their masters that are shed or from the dead, and trade them abroad to obtain goods for their own subsistence or treasures desired by their masters.","slavery":"While metallic dragons view slavery as evil, their vassals have little freedom and do not get paid (dragon society does not have a concept of work for payment, rather it is considered a duty to serve). Nevertheless, all vassals to metallic dragons are nominally there by choice. Chromatic dragons have no such misgivings, and will often force those they can into bondage, hunting those who try to escape.","magic":"There are no laws or particular customs concerning magic in Dragonhome, though all dragons have some sorcerous talent.","property":"A dragon is considered to own his den or roost, and there are a great many customs that must be abided by when visiting a neighbor.","citizenship":"Because there is no central government there is no concept of citizenship, however, long term survival invariably requires declaring oneself a vassal to an established dragon."},{"name":"Eldoran","primelanguage":"","seclanguages":[],"coords":[59.367493648265246,-10.760087638414596],"bordercoords":[[57.9210476707742,6.239068832779423],[56.735025282066914,6.019480678418093],[55.1353223665972,1.7943362224103157],[53.72962293149973,-3.124438435282882],[53.337843432008775,-6.495272496000889],[51.815831459725246,-9.920847704037227],[51.15910750294231,-14.268693160391036],[52.38272474814214,-16.51527433367246],[53.88532105918089,-16.910533011522812],[55.28576341790459,-18.40373246117967],[56.10306632645359,-20.028684803453316],[56.68489968493713,-20.764160156250004],[57.40206340839755,-22.65380859375],[57.94255668241767,-23.488769531250004],[58.86348440845593,-23.356933593750004],[59.583023000672675,-24.587402343750004],[60.48293866462562,-24.80712890625],[61.168410844977466,-25.070800781250004],[62.597133367594935,-24.411621093750004],[64.47634442281898,-24.49951171875],[64.77763676431793,-24.32373046875],[65.1126160125044,-23.620605468750004],[65.91398626589483,-24.32373046875],[66.32317056079233,-24.367675781250004],[67.8817470221638,-25.0927734375],[68.41838320668627,-25.290527343750004],[69.13714089855071,-23.598632812500004],[69.00862709736805,-21.555175781250004],[68.8823264632913,-20.676269531250004],[69.10287891544486,-19.401855468750004],[69.25906747648308,-17.248535156250004],[68.86648798003206,-14.699707031250002],[67.89518698098077,-12.766113281250002],[66.89882873839606,-9.865722656250002],[61.56849714055255,0.28564453125000006],[60.8060830730267,0.6811523437500001],[59.93712838146011,3.0102539062500004]],"color":"#00FF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Eldoran.jpg","capitol":"Loridesa","cities":["Milan","Dima","Sofala","Storvel","Estapor"],"landmarks":["God Spire","Undead Woods","Glass Cliff","Mithral Hills","Moon Pass"],"borders":["Dera'Dragorim","Gnarra","Curinor","Demal Thor","Malinval","Shendarel","Olda"],"population":3600000,"populationDistribution":[{"race":"Wood Elves","proportion":0.62},{"race":"High Elves","proportion":0.22},{"race":"Half-Elves","proportion":0.12}],"government":"Eldoran is governed by a king responsible for day to day affairs of government, and the council of elders, which is the eldest healthy member of each district, and has 350 members. The council can override the affairs of the king, or depose him and elect a new king should he refuse. On a local scale, lords have hereditary domain over their territory.","ruler":"Darendel Se'la'mer","history":"Of the major races, the elves were lucky in that not only were they relatively untouched by the God's War, they managed to stay together after the conflict in a relatively remote area. They founded a single kingdom, Eldoran, and slowly began to expand as their population grew. It was not long before they had taken control of the entire subcontinent and sent colony ships across to the main continent, as well as south (the southern ships landed on the coast of Shendarel) and west (the elves sent west returned with tales of the Deran empire, opening trade relations with the west for the first time). Eventually the elves controlled as much territory on the mainland continent as elsewhere.\n\nOver time the elves were involved in several wars with the orcs, the dwarves, and the various human kingdoms, as well as various civil wars. Three of the most recent deserve special mention as historically important to current affairs. First, when Dorman I sought to control the entire continent he clashed with the elves on several occasions. These battles are regarded historically as among the only ones he didn't win(they repeatedly stalemated, as he was never able to force the elves to commit to the field, rather they harried his forces until he gave up). Shortly after the death of Dorman I, the Moon Elves, who had taken the brunt of those battles with little support from the west, declared themselves independent of the elven kingdom, calling their new land Demal Thor. War ensued, and the High Elves were unable to retake control of the east. Lastly, there have been repeated conflicts with the dwarves of Curinor over the Mithril Hills, aptly named for their large deposits of easily mined mithril. The most recent war however, resulted in near total victory by the elves. While the resulting peace treaty placed the border almost directly down the middle of the hills, most of the largest mithril deposits are on the elfin side, and the dwarf mines in the area have been abandoned.\n\nEldoran is currently in a state of civil conflict.  The eastern Waelin region has declared itself independent from Eldoran proper, and declared their own king, Saendal Alistiae, once Duke of Estapor.  Meanwhile the recently ascended King Darendel declared every elf in Waelin an outlaw for their treachery. Both sides are still mustering their forces, but all elven forces have been recalled from Gerasalim and Demal Thor as a result of the conflict, and pitched battle is only a matter of time.","gods":["Gaian","Amathera","Sylvan","Agrios"],"worship":"The elves worship Gaian and Amathera primarily, as nature God and protector. However Sylvan is worshiped the most as patron God of the Elves, who spent the God's War protecting her people rather than actively fighting.","culture":"The elves love nature, and it shows in their practices and architecture. Aged trees are protected, and most smaller villages are actually built in the canopy of the trees, while the larger cities are built among them and around them. Farmers specifically grow crops that thrive in the shade and the elves tend to live far apart from each other (Eldoran has the one of the lowest population densities of any country.)","economics":"The elves export specialty woods, spices, fine furniture, art, fine steel and mithril. They are also the world's largest exporter of magical goods such as scrolls, wands, and other enchanted items.","slavery":"Slavery is abhorrent to the elves.","magic":"Magic comes naturally to the elves and is highly commonplace. The regulations for its use are highly esoteric to outsiders, often dictating specific times when specific spells can be used. (For example a shield spell can only be cast when one feels threatened, and is considered a threat in itself).","property":"Trees are protected, and the removal of wood is usually done by special magic or the cutting of low branches rather than by cutting them down. Otherwise any elf can own property in Eldoran.","citizenship":"Any elf except moon elves are considered citizens. Although the only real difference between citizens and non-citizens is whether they are counted when seeking members of the council of elders."},{"name":"Gerasalim","primelanguage":"","seclanguages":[],"coords":[61.73705351838136,58.48282049043948],"bordercoords":[[57.87433972843447,59.36075788346858],[60.63582622096303,63.00592124586621],[62.6391349133703,60.5465339170196],[63.49497665139195,54.925077165370254]],"color":"#0000FF","map":"https://elthelas-images.herokuapp.com/maps/nations/Gerasalim.jpg","capitol":"Strovenguard","cities":["Eastguard","Northport"],"landmarks":["Fortress of Light","Blighted Gap","Black Shard Pass","Saria Lake","World Crack"],"borders":["Malinval","Curinor","Kandor","Dormania"],"population":4200000,"populationDistribution":[{"race":"Imperial Humans","proportion":0.75},{"race":"Half-Elves","proportion":0.1},{"race":"Lightfoot Halflings","proportion":0.06},{"race":"Moon Elves","proportion":0.04},{"race":"Plains Dwarves","proportion":0.04}],"government":"Gerasalim is ruled by an elected king, who rules for life and who appoints local governors.","ruler":"Queen Organa Mataelin. 43 years old, previously a renowned Cleric of Cora and General of the 5th Legion, stationed at Eastguard.","history":"The territory that is Gerasalim was made up of several small kingdoms with a loose alliance set in defense against the orcish threat before the invasion by Dorman the First. In fact, just before the invasion Dorman signed onto the alliance and promised his legions. Depending on the historical perspective, either the smaller kingdoms broke the alliance by not reinforcing Dorman's legions, or Dorman did by instead turning his legions against the kingdoms. Whatever the cause, the end result was the total conquest of the entire area by Dorman's ever-victorious legions, who then continued their expansion south into Malinval.\n\nSeveral generations later, with the orcs in a phase of expansion and Dorman V too obsessed with court politics to commit serious resources to guarding the southern border, the people in the south western portion of his empire rose up in mass rebellion. Electing a king from among the local generals, they defeated those garrisons that would not turn, and then threw back the orcish invaders. While in the present day relations with Dormania are friendly, it took several generations and renewed commitments to aid in the defense of the southern borders for that normalization to happen.\n\nToday Gerasalim is in shambles. The Prince of Fiends rise, combined with the internal struggles of Eldoran and Dormania, have left Gerasalim with few allies in its sworn mission to defend the southern border.  After the second fall of Aridhem, the orcs successfully encircled the border forts and have moved into the heartland of Gerasalim, sacking Strovenguard and Eastguard.  The remaining armies of Gerasalim now wage a guerilla war from the Sword Mountains, led by their ever valiant Queen.","gods":["Cora","Dorman","Bahamut","Amathera","Sara"],"worship":"Gerasalim has a surprising variety of worship methods among its people. However there are certain themes to the Gods that find favor. The militaristic natures of Cora, Dorman, and Bahamut lend themselves well to the militaristic nature of Gerasaline society. At the same time Amathera and Sara lend themselves well to worship by the poorer agrarian segment of society.","culture":"Gerasalim is a highly militaristic country, and the heart of the Alliance of 6 Nations that led to the founding of the Fortress of Light. It sends the most soldiers to fight, and die, at the border forts with Malinval of any country, and its people see the war as one of both liberation and survival. All young people without children between the ages of 17 and 22 are required to serve in the military according to their talents. Clerics and Wizards must also serve 3 additional years upon completion of their training.","economics":"Gerasalim's economy is primarily agrarian, as they have ample supplies of water, but poor trade connections due to being landlocked. Only Northport has an easy to reach river connection that does not lead through orc-held territories. Nevertheless there are some mines along the southern and eastern edges of the country. Gerasalim exports grain northward and westward out of Northport and into Curinor and Demal Thor.\n\nThe country is subsidized somewhat by the other kingdoms of the alliance, who have armies stationed on Gerasaline soil that require supplies, most easily obtained locally from Gerasalim's merchants.\n\nGerasalim's smiths and craftsman are of average quality, with a few masters practicing in the major cities and working for the armies. It can be hard to find craftsmen experienced with unusual materials.","slavery":"Slavery is illegal in Gerasalim.","magic":"Magical training is encouraged but regulated. There is a major college of wizardry at Strovenguard and the king supplies scholarships to young men and women who show particular aptitude. Nevertheless, all wizards must serve an extended period in the military, and obtain a license to practice within Gerasalim.","property":"Any citizen can own property within Gerasalim, but the king and local governors have extensive rights of eminent domain, particularly for military purposes.","citizenship":"Anyone born within Gerasalim's borders is considered a citizen. However, naturalization can only be obtained by declaration of the king, usually due to extraordinary service within the military. Noncitizens have limited rights, in that they cannot own land, or graze more than 3 animals on public land, nor vote in elections for King. Noncitizens also do not have the right of appeal to the King, although few citizens ever have their appeal heard."},{"name":"Gnarra","primelanguage":"","seclanguages":[],"coords":[7.234423433691038,-18.272735714078504],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Gnarra.jpg","capitol":"","cities":[],"landmarks":["Serpent's Spine"],"borders":["Morrindim","Eldoran","Shendarel","Olda","Dera'Dragorim"],"population":100000,"populationDistribution":[{"race":"Faelin","proportion":0.6},{"race":"Wild Elves","proportion":0.2},{"race":"Kobolds","proportion":0.15}],"government":"The Faelin and the Wild Elves both shun governments, and tend to live in solitary family groups.","ruler":"","history":"Gnarra has never really had contact with the outside world, and most expeditions to explore the interior have never returned. Faelin and Wild Elves who leave Gnarra rarely speak of home, and then only reluctantly.","gods":["Gaian"],"worship":"Those Faelin who have appeared in the outside world have almost exclusively worshiped Gaian, the nature goddess and patron of fey. How this worship is handled within the country is anybody's guess.","culture":"","economics":"","slavery":"The attitude of all fey-like creatures towards slavery is anything but favorable.","magic":"Magic is believed to be common in this lush land.","property":"","citizenship":""},{"name":"Gorgro Plateau","primelanguage":"","seclanguages":[],"coords":[-52.98668384095864,-63.42006025076251],"border-coords":[],"color":"#222200","map":"https://elthelas-images.herokuapp.com/maps/nations/Gorgro.jpg","capitol":"","cities":[],"landmarks":["Ice Wastes","Troll Pass"],"borders":["Staelia","Alfadir","Stagenheim","Tiaov Coast","Ice Wastes"],"population":200000,"populationDistribution":[{"race":"Trolls","proportion":0.2},{"race":"Trollkin","proportion":0.18},{"race":"Ogres","proportion":0.18},{"race":"Giants","proportion":0.14},{"race":"Gnolls","proportion":0.12},{"race":"Hobgoblins","proportion":0.12}],"government":"Gorgro is in truth a region rather than a nation. While there are some tribal entities within it, there is no real government of any kind.","ruler":"","history":"Gorgro featured prominently in the development of nearby nations, as many of the creatures that call the high plateau home are difficult to deal with, to say the least. Tribes of giants and trolls can eat entire villages before men can be marshaled to defense, and Ogres, Trollkin, Gnolls, and Hobgoblins are certainly not threats to sneeze at. However, no one has ever really recorded any history of the denizens of the plateau itself.","gods":["Trollka","Malik"],"worship":"Worship methods vary significantly by the tribe and race. However Trolka and Malik are certainly the most common Gods worshipped.","culture":"","economics":"","slavery":"Without rule of law, the weak often find themselves slaves.","magic":"Particular moods on magic vary by tribe, but generally trolls, gnolls, and ogres are highly distrustful (or just too stupid to use it), while hobgoblins, giants and trollkin make use of it to their own advantage when they can.","property":"","citizenship":""},{"name":"Hisru'de'tan","primelanguage":"","seclanguages":[],"coords":[-24.324573805856367,-60.78500239842688],"bordercoords":[[-15.70964576925431,-48.95344782281892],[-19.561731187837697,-49.831800440264146],[-28.692394666557494,-52.818199339577866],[-36.70531110774926,-53.53414093322117],[-38.4810072394296,-62.18591421505654],[-39.97869861176252,-69.34448804723503],[-38.618479949960594,-70.38525168848219],[-37.84829030697314,-72.01471613607733],[-37.46559360090851,-73.42008032398967],[-36.19940396139785,-73.81533900184002],[-36.05742594589385,-71.66337508909925],[-35.950774009042945,-71.2681164112489],[-35.45116158984834,-71.01319193061451],[-35.02043737649655,-71.05710956148677],[-34.623602749607485,-71.01319193061451],[-34.29750109934764,-70.83752140712546],[-34.11578399404576,-70.87581966756663],[-33.348311208794065,-70.34880809709952],[-31.942257299875497,-70.30489046622725],[-30.665675324520414,-70.12921994273822],[-28.603211564929566,-70.12921994273822],[-25.90802682962475,-69.03127917093171],[-24.116048248355582,-68.81124811052656],[-22.826187530506285,-68.28423654005944],[-21.728248015908182,-68.02073075482586],[-20.99157317727192,-67.36196629174196],[-20.086243625401526,-68.10856601657039],[-18.3434460482644,-67.97681312395362],[-15.907847888663683,-65.91282288109606],[-14.721096574183294,-65.64931709586247],[-12.586062288061292,-61.21363637776415],[-12.54316941000806,-60.33528376031894],[-12.92894534401738,-59.89610745159633],[-12.242720476621736,-58.53466089455625],[-12.242720476621736,-58.00764932408912],[-11.640803757585118,-57.21713196838842],[-11.425513796074753,-56.60355849105279],[-9.914067452051532,-56.38269698181548],[-10.000634148840673,-55.723932518731566],[-10.908155917437197,-54.713827008669554],[-11.468584970810742,-54.538156485180515],[-11.769897987872593,-52.737533619417825],[-13.527851816968928,-50.10247576708218]],"color":"#00FF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Hisru'de'tan.jpg","capitol":"She'dal","cities":["Atyrao","Taruu"],"landmarks":[],"borders":["Zelfir","Alfadir","Stagenheim","Sage"],"population":1200000,"populationDistribution":[{"race":"Hisru Humans","proportion":0.88},{"race":"Deran Humans","proportion":0.04},{"race":"Stagen Gnomes","proportion":0.03},{"race":"Staelic Humans","proportion":0.03}],"government":"Hisru'de'tan's government is a decentralized feudal clan system. With most power residing in the local clan chiefs. The Khan is nominal ruler of the nation, but in truth he is little more than the strongest clan chief. Civil strife is common, and internal wars commonplace. Nevertheless, it is the khan who sets most policy as regards trade with foreign nations.","ruler":"","history":"When the people of Zelfir gained their independence in the city, not all chose to submit to the leadership of the wizards. Those that did not were asked, politely but insistently, to leave. They took to horse, and crossed the mountains to the east, over the peninsula, and onto the steppe, where they have raised cattle ever since. Beyond these records, kept in the histories of Zelfir, no one really knows the history of Hisru'de'tan, as few Hisru have the ability to write, and those that do have never bothered to write about the past.","gods":["Kara","Mosru","Paltak","Nora","Fedrik"],"worship":"The Hisru have their own extensive pantheon of Gods based on animals, and their 'clerics' are usually just druids. Whether the Hisru Gods actually exist is still questionable, but the power of nature at the command of the druid priests is without compare.","culture":"The hisru are a nomadic people, who rely on their herds to survive.","economics":"Hisru'de'tan is dependent on the export of horse flesh and beef cattle, and import most of their forged metal and other finished goods(although you won't find more skilled farriers anywhere in the world). They also export worked leather.","slavery":"Slavery is not strictly illegal on a national level, however the purchase of slaves is. Male captives taken from other clans or other nations must serve faithfully for 5 years, after which they are given a horse and a milk cow and are allowed to either return to their home or join the clan. Female captives are taken as mistresses to the person who captured them, and if they leave after 5 years any children they have had in their captivity remain with the clan.","magic":"Most arcane magic is viewed with suspicion as witchcraft, if the viewer is even capable of discerning it from the druidic magic that is common in the area.","property":"Land is owned by clans, rather than individuals, as few homes are permanent anyway. Cows, horses, and other animals are owned by individual families. Any unmarried person over the age of 20 is considered a family unto him/herself.","citizenship":"Citizenship is either by birth or by clan adoption after serving 5 years as a captured slave. If not a member of the local clan or protected by treaty, any person entering a clans territory is by law forfeit of his/her life and liberty. The Khan's road is exempt from this law, being part of no clans territory."},{"name":"Ice Wastes","primelanguage":"","seclanguages":[],"coords":[-74.00668355469516,-101.89190489486292],"border-coords":[[-71.8,-116.5],[-73,-122.5],[-74.2,-123.2],[-74.8,-121.2],[-75.4,-116],[-75.3,-98],[-74.7,-94.5],[-73.9,-92.6],[-73.1,-89.1],[-71.8,-90],[-72.5,-105.7]],"color":"#222200","map":"","capitol":"","cities":[],"landmarks":[],"borders":[],"population":0,"populationDistribution":[],"government":"","ruler":"","history":"The Ice Wastes are a flat frozen tundra on the southern edge of Atyrea, south of the Gorgro plateau and Staelia. It has never been fully explored, but it is believed to terminate at the southern ice cap. The ice wastes are full of strange and unusual creatures and monsters found nowhere else in the world. It is also the home of the white dragons.","gods":[],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Jotunheim","primelanguage":"Giant","seclanguages":[],"coords":[74.38294979606921,-100.67871093750001],"bordercoords":[[72.40068910294568,-99.09667968750001],[71.97048891173539,-108.76464843750001],[71.19306730399536,-110.34667968750001],[70.23531792009278,-112.98339843750001],[70.20278500177974,-115.02685546875001],[69.87272710927748,-117.61962890625001],[70.33630621096798,-119.15771484375001],[69.7057261305929,-121.61865234375001],[69.44502083266276,-124.16748046875001],[69.33674271476097,-128.29833984375003],[69.94820050018694,-133.74755859375003],[70.24738849893248,-135.06591796875003],[71.16205215095839,-136.42822265625003],[71.40179263232164,-136.91162109375003],[71.66625493346267,-140.38330078125003],[72.07644742513067,-143.37158203125003],[73.65486385335862,-143.15185546875003],[74.84708266385645,-144.86572265625003],[74.92728457447282,-145.21728515625003],[75.15415454646435,-147.28271484375003],[75.32211320229507,-147.72216796875003],[75.99683309403015,-149.74365234375003],[76.81264927369843,-152.81982421875003],[77.72269211188618,-153.43505859375003],[78.2620085782465,-155.98388671875003],[78.45707424730084,-158.57666015625003],[78.87163893937506,-160.86181640625003],[79.06504093442985,-160.11474609375003],[79.00653356656002,-156.77490234375003],[78.84616484650552,-153.74267578125003],[78.38651400843126,-151.54541015625003],[78.31552840395555,-146.79931640625003],[78.10905310123454,-143.41552734375003],[78.01816335913092,-139.59228515625003],[77.8897666726979,-138.27392578125003],[77.9265891250121,-119.94873046875001],[77.88054378735633,-106.19384765625001],[77.71334392832614,-101.31591796875001],[77.31432953169521,-89.80224609375001],[76.75236129552475,-84.13330078125001],[76.55965825995186,-75.73974609375001],[76.63097219876565,-70.51025390625001],[76.78253904611567,-69.01611328125001],[76.94235013897841,-65.93994140625001],[77.36249181475401,-63.17138671875001],[77.42961694118709,-61.28173828125001],[77.67588106036713,-60.97412109375001],[78.2620085782465,-57.98583984375001],[78.31552840395555,-57.15087890625001],[78.56212238483329,-55.83251953125001],[78.50971675006728,-54.47021484375001],[78.2620085782465,-53.89892578125],[77.90819170678063,-54.73388671875001],[77.33361607248891,-54.86572265625001],[77.02154218568921,-55.48095703125001],[76.73220521172568,-54.95361328125001],[75.82567733743878,-54.73388671875001],[75.19912637178085,-52.71240234375001],[74.46334165687823,-52.40478515625001],[74.34519609565815,-53.02001953125001],[74.22617475454729,-53.81103515625001],[74.52208787912652,-56.40380859375001],[74.38073144983149,-61.98486328125001],[73.54318958203025,-63.52294921875001],[73.24175298774118,-65.10498046875001],[72.26482017044759,-67.74169921875001],[71.83140901045195,-75.16845703125001],[72.1169752567015,-79.03564453125],[72.13046482513413,-81.58447265625001]],"color":"#AAAAFF","capitol":"","map":"","cities":[],"landmarks":[],"borders":[],"population":13000000,"populationDistribution":[{"race":"Humanoid Slaves","proportion":0.3},{"race":"Giantkin","proportion":0.1},{"race":"Hill Giants","proportion":0.2},{"race":"Frost Giants","proportion":0.15},{"race":"Stone Giants","proportion":0.08},{"race":"Fire Giants","proportion":0.07},{"race":"Cloud Giants","proportion":0.06},{"race":"Storm Giants","proportion":0.04}],"government":"","ruler":"","history":"","gods":["Annam","Othea","Stronmaus","Hiatea","Grolantor","Skoraeus Stonebones","Memnor","Iallanis","Surtr","Thrym"],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Kandor","primelanguage":"","seclanguages":[],"coords":[71.03214223175296,57.0899188627209],"bordercoords":[[66.83570556831708,69.61501622434774],[64.8588576088178,55.741141749618755],[63.49497665139195,54.925077165370254],[67.41197128562575,50.73497765008041],[69.02559283725621,49.54920161652939],[70.38177353245575,49.19786056955131],[72.53163405391571,43.13635626636939],[73.19198754779217,45.66773039661589],[73.889157621034,47.73185904761216],[73.98642794060653,48.96155271203544],[74.09517349172856,52.299292658327275],[74.03484840899563,56.42754996031977],[74.14327362586269,59.06288462893279],[74.41711044681625,62.75196562220271],[74.3579756783226,63.98165928662599],[74.07107015011275,66.17754083023905],[73.889157621034,68.2416694812353],[73.26806468356646,72.80910309195043],[73.40667151856782,77.15694854830423],[71.40288755930774,77.15694854830423],[69.66114385488451,75.18267591787749],[66.25386407845592,74.12865277694321]],"color":"#99FF99","map":"https://elthelas-images.herokuapp.com/maps/nations/Kandor.jpg","capitol":"Kaland","cities":["Westport","Purs"],"landmarks":[],"borders":["Curinor","Gerasalim","Dormania"],"population":2800000,"populationDistribution":[{"race":"Imperial Humans","proportion":0.83},{"race":"Half-Dwarves","proportion":0.08},{"race":"Plains Dwarves","proportion":0.05},{"race":"Hill Dwarves","proportion":0.03}],"government":"Kandor's feudal system is corrupt and oppressive, but nevertheless stable. Of all the nations on the Elathian continent, Kandor is the most separated from war, and it shows. The nobility are rarely soldiers, and tend towards extravagant displays of wealth, while their serfs suffer. The king is weak, plagued by nobles who vie for his throne, and the throne regularly changes hands between houses. Laws tend to be draconian, and vary by the fief, while the King's jurisdiction barely extends beyond Kaland.","ruler":"","history":"Kandor got its start as a part of the Dormanian Empire. When Emperor Dorman I marched through the territory that now makes up Kandor, he found it a hodgepodge of minor kingdoms many of which were practically vassals to the nearby dwarven power in Curinor. In a series of lightning wars he conquered the vassal kingdoms, and managed several key victories against the dwarves, managing to push them back deep into their mountains, and take control of several holds. By the time his empire began to succumb to corruption there was little thought in the dwarven kingdom that those holds could be retaken. The first King of Kandor was actually an appointee of Emperor Dorman V, a weak ruler who thought to consolidate the heart of the Empire while letting the corrupt northwest go its own way.","gods":["Alohim","Sara","Dorman","Dorun"],"worship":"Kandor is one of three nations to worship Dorman, the ascended first Emperor of the Dormanian Empire, the conqueror and the law bringer. At least officially they worship Dorman. In practice it is a lesser cult with few followers except among those nobles that hope to claim some kind of descent. In practice most of the nobility worship Alohim, while the serfs pray to Sara for plentiful harvests so that they can avoid the wrath of their masters and feed their families. The Dwarves in their small mountain holds worship Dorun.","culture":"","economics":"Economically, Kandor is a rural agriculturally based country that imports most finished goods. Its trade ties to Curinor cannot be over-emphasized, as the dwarves require regular imports of food to support their people, while they export large amounts of finished goods, particularly metalwork.","slavery":"Slavery is illegal, technically, but contracts of serfdom are commonplace, and such contracts are hereditary.","magic":"There is a small college of wizardry in Kaland, and a slightly larger one in Westport, but mages in Kandor tend to be reclusive, and the Kandori distrustful of them. Most mages try to avoid the more rural areas of the country, where 'disappearances' happen with frightening regularity.","property":"Property can be held by anyone who is not a serf, so long as the purchase and sale are approved by the local liege lord, who still has a certain amount of property rights over all land within his domain, such as the right to quarter troops, enforce taxation, or confiscate property for the 'good of the state'.","citizenship":"People not of Kandori descent are distrusted, although humans from Gerasalim or Dormania generally less so than others. Dwarves and Half-Dwarves can have partial citizenship status (the right to own property essentially) if they are born in one of the dwarf enclaves or holds within the country."},{"name":"Malinval","primelanguage":"","seclanguages":[],"coords":[28.035622160834343,61.130340902968896],"bordercoords":[[64.8588576088178,55.741141749618755],[66.83570556831708,69.61501622434774],[66.25386407845592,74.12865277694321],[65.03998671884757,82.25277781087344],[63.51458167234655,92.04640949538759],[54.85803483361683,92.8369268510883],[49.98699361915004,93.93486762289477],[45.98980600197725,86.1216262085378],[40.48925963597949,85.4189441145816],[37.866722853218626,86.7803906716217],[36.40470491509095,85.0673787007261],[33.23064686752627,84.89170817723705],[30.92225448145132,82.69582663362398],[29.63196490525779,79.27025142558766],[27.548459140257656,78.21622828465341],[24.46840062647489,74.79065307661706],[23.37314412370037,72.94229542920964],[19.860373042167716,71.25248357621508],[16.73156416658139,65.25671002656401],[14.403424442254751,62.21739696736275],[14.020021898965714,61.075538564683974],[12.908867400877071,59.40666859153808],[10.41285849649609,57.4742928331586],[7.983757710988173,55.55467830516692],[7.809643397973213,53.27096149980936],[7.940236025285963,50.94332706357955],[9.373870112162018,48.48393973473296],[9.417225890585126,46.902905023331556],[11.70670313424045,44.35568243274046],[12.951698393721799,41.652000368311356],[14.87113268879198,38.79735436161438],[18.532351347677107,35.67920256968388],[22.238895499613218,30.58475738850164],[25.74176610573814,27.764628914667817],[28.55678227774372,22.143172163018463],[33.25763758619377,29.201955184124614],[37.34450497634804,37.41455215723736],[40.288430386987976,37.502387418981904],[45.190264015431886,27.928343888829044],[50.1843731361829,29.158037553252324],[53.91121454964488,32.84711854652224],[49.87384022957383,44.26570257331004],[49.160603679993315,54.310230333158586],[57.87433972843447,59.36075788346858],[60.63582622096303,63.00592124586621],[62.6391349133703,60.5465339170196],[63.49497665139195,54.925077165370254]],"color":"#FF0000","map":"https://elthelas-images.herokuapp.com/maps/nations/Malinval.jpg","capitol":"Marinval","cities":["Mak'hol","Forbel","Makir","Parakas","Malgeth","Morda'serek'hai","Gulutheim","Ochre'ken"],"landmarks":["Desert of Despair","Glass Cliff","Blighted Gap","Rust Desert","Black Shard Pass","Golden Pass","Dal Okra"],"borders":["Eldoran","Demal Thor","Curinor","Gerasalim","Dormania","Arad","Terron","Seran","Nerim","Morrindim","Degak'Ta","Olda"],"population":20300000,"populationDistribution":[{"race":"Grunt Orcs","proportion":0.6},{"race":"Goblins","proportion":0.19},{"race":"Hobgoblins","proportion":0.06},{"race":"High Orcs","proportion":0.05},{"race":"Trollkin","proportion":0.04},{"race":"Neran Humans","proportion":0.03},{"race":"Kobolds","proportion":0.02},{"race":"Moon Elves","proportion":0.01}],"government":"Marinval's current government is a common subject of rumor. While historically it has been a relatively fractured nation, with civil wars common between different Orc warlords whose territory is constantly shifting, in recent years scouts and spies have reported that internal affairs have been relatively quiet, while the orcs' attacks against their neighbors have begun to increase. This has sparked rumors that either a particularly adept warlord has united the tribes, or the often-discounted possibility that the Prince of Fiends, a Sorceron long imprisoned in the mountain Dal Okra may have awakened. Nevertheless the local warlords still seem to be more or less in control of their own territory, and the best description of the government currently could probably be described as a despotic confederacy.\n\nRumors in recent months have continued to solidify on the reawakening of the Prince of Fiends.","ruler":"Believed to be the Prince of Fiends","history":"Malinval's size and strength have varied greatly over time depending on the strength of whatever warlords are in power and how fractured their outside enemies are. For example, when the Dormanian and Nerimese Empires were at their heights, Makir and Dal Okra formed the northern border while Makir and Gulutheim formed the eastern, leaving the country at nearly half of its current size. Nevertheless, the last 300 years have seen a slow but steady expansion for the Orcs. Only the imposing Fortress of Light and the difficulty in moving supplies across the Blighted Gap have stopped them from extending their borders possibly as far as Northport and the Moon Pass.\n\nThe orcs are a warlike people, and the land they live in shows the scars of nearly 3000 years of endless wars, including being the location for many major battles in the God's War. The Glass Cliff, the World Crack, and the Rust Desert are three such locations. Meanwhile Black Shard Pass was literally cut out of the mountains by the Dormanian Emperor's magi in order to provide an avenue of attack in his southward expansion, and the Blighted Gap was created when the Orcs burned and salted everything in their path in a major offensive 200 years ago. Old fortresses, both abandoned and in current use dot much of the landscape, built by both orcs and non-orcs, as well as cities that rose up and were likewise destroyed or abandoned in the face of advancing enemies.","gods":["Mat'raktha"],"worship":"While other Gods have often had cults among the people of Malinval, recently these have fallen into disfavor while Mat'raktha's worship has risen.","culture":"At the lowest level, Malinvan culture is one of survival of the strongest. Nevertheless there is an inherent discipline that comes with being a highly militaristic people used to obeying orders, and in the warband everyone has his place. The common misconception in the north has always been that the Orcs attack as frenzied berserkers with no thought for strategy, but no thought could be further from the truth. While Orc Berserker's are a fearsome sight, and one worth remembering, they are only one aspect of an orcish fighting force, and not really representative of the culture at large.\n\nIn fact, Malinval encompasses a wide variety of cultures. On the one hand you have the mining city of Parakas, a top down, highly regimented communistic city built entirely of steel (for which it is famous), while on the other you have Forbel, a tent city that has been the site of massive clan wars, as it is the center of the western cattle trade, and up to a dozen warlords have laid claim to it at one time. The capitol, Marinval, is a sprawling city of low sod and brick buildings, temporary fortifications, and castles.","economics":"Malinval is huge, and produces a great many goods for sale and use internally, however, generally the people are poor and overcrowded.  There is little to no trade with it's northern neighbors (that which exists is done entirely in the black market), but it exports a number of goods to Morrindim, Olda, Arad, Terron, and Seran,  particularly food and metal goods.","slavery":"Slavery is common in Malinval, and like in other orc dominated areas most slaves are goblins, with a small smattering of the descendants of Neran refugees and kobolds.","magic":"Magic is allowed, or at least there is no unified statute concerning its use. Youngsters who show promise are often encouraged in magical study, just so long as they are loyal to and do not prove a threat to the local warlord. Any mage considered a threat to power is usually hunted and executed.","property":"Property is usually what you can hold onto, although there is a certain amount of respect for women and children, and the custom is never to displace from their home a family with kids. This of course encourages breeding so as to avoid losing everything one has to someone stronger than oneself.","citizenship":"Most orcs would sooner die than follow someone not an orc. Thus almost all of the major warlords have been orcs, and even local captains. The closest analog to 'citizenship' is membership in a clan, and each clan determines its own rules for membership."},{"name":"Morrindim","primelanguage":"","seclanguages":[],"coords":[-22.388174382531723,-12.475608438940084],"bordercoords":[[-28.21970990898648,60.40283203125001],[-30.441570071519454,56.27197265625001],[-20.542793305264507,49.24072265625001],[-20.666195922002352,19.841308593750004],[-21.486296638453577,16.193847656250004],[-31.196356957735073,-8.811035156250002],[-28.103480741227443,-16.018066406250004],[-23.79037129915711,-19.291992187500004],[-13.565901714121072,-17.622070312500004],[-13.138328453077788,-9.008789062500002],[-20.452749362534945,-7.690429687500001],[-17.125042196260953,14.458007812500002],[-16.620401536146325,19.379882812500004],[-17.376852561045375,51.89941406250001]],"color":"#009999","map":"https://elthelas-images.herokuapp.com/maps/nations/Morrindim.jpg","capitol":"Morrind","cities":["Alados","Marinda"],"landmarks":["Serpent's Spine"],"borders":["Gnarra","Eldoran","Olda","Malinval","Degak'Ta","Nerim"],"population":600000,"populationDistribution":[{"race":"Morrind Dwarves","proportion":0.94},{"race":"Deran Humans","proportion":0.03},{"race":"Neran Humans","proportion":0.02}],"government":"The Nation of Morrindim is a republic governed by the council of captains. With a grand admiral who acts as a high judge. Matters on board a ship are handled by the captain as absolute ruler. The council of captains is made up of all the captains in the Morrindim fleet, in total something like 5000 souls.","ruler":"","history":"After the God's War a small group of dwarves found themselves marooned on an island far away from any other land. Over time they developed ships and took to the sea seeking other dwarves, however, by the time they did they found that they had adapted to the sea as most dwarves to their mountain homes. Since then the Morrindim have been generally neutral in wars (although they have had a few with Dera'Dragorim over trade rights) and generally trade peacefully with anyone. Including the orcish nations and others.","gods":["Maris","Trimala","Dorun"],"worship":"Maris and Trimala have the largest cults in Morrind, relating to their extreme dependence on trade and the seas. However, they also pay service regularly to Dorun, the patron God of the dwarves.","culture":"All of Morrind culture, even those on land, relates strongly to that of shipboard discipline. One obeys ones captain absolutely, and punishments tend to be severe. Loyalty is likewise strong among the Morrind. Morrind dwarves who live on land are still organized into 'ships' of 150-300 people who are commanded by a captain.","economics":"the Morrind are highly dependent on trade for their welfare, however they do produce a few goods for export, including advanced ships and fine porcelain.","slavery":"Slavery is illegal among the Morrind, but respect for others customs and ways is common, and people with slaves who come on board a Morrind ship are respected.","magic":"Magic is forbidden except by permission of the captain. Nevertheless most ships have a sorcerer or wizard on board.","property":"Personal property is generally limited to what can be carried in a chest. Land, ships, and other large items are owned by the captains, however, profits from ventures are distributed strictly throughout the crew by law, where the captain gets 5% and the rest is divided evenly.","citizenship":"Anyone who is accepted into a ships crew is considered a citizen.  Any Morrind citizen who purchases and outfits a ship or productive enterprise is considered a 'captain' and has voting rights in the council."},{"name":"Nerim","primelanguage":"","seclanguages":[],"coords":[-2.237895124716353,89.06195413772673],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Nerim.jpg","capitol":"Nerim","cities":[],"landmarks":["Fang","Iron Triangle","Titan's Peaks"],"borders":["Seran","Malinval","Morrindim","Degak'Ta"],"population":40000,"populationDistribution":[{"race":"Sand Orcs","proportion":0.97},{"race":"Neran Humans","proportion":0.02}],"government":"The Sand Orcs are a tribal people ruled by tribal chiefs, typically a hereditary position, although exceptions have been made if the current heir is incompetent to allow a different tribe member to become chief. They have no real central government, although they do come together now and then to trade at Mount Fang where a cave system provides ample shade, and underground springs, water. The Necromancers and their undead servants tend to have varying shifting alliances, but certainly no government.","ruler":"","history":"Nerim was once a proud empire that rivaled (and often warred with) the Elves of Eldoran. They worshiped the Death Goddess Nera, who granted her people mastery over death and the dead, and the ability to seek justice beyond death as a risen deathless. The Emperor, known as the Eternal One, lived for nearly 1000 years through the gifts of Nera, his body kept young and powerful. He thought himself immortal, but inevitably Nera's gift began to fade and he began to age. Fearing death, he devised a ritual whereby he could grant himself and all of his people immortality. Indeed it would grant even the beasts of the field and the birds of the air eternal life. He set his people to the task, and when it was ready, he personally cast the spell. When it was over, there was nothing left living for 500 miles around the capital, instead all were transformed into some form of undead, and the emperor a powerful lich. Overcome with rage at his new grotesque form, the emperor led his 'people' on a quest to destroy all life, but the Gods intervened. Building massive mountains around the remains of the empire and blessing those who still lived and fought back with powerful magic to fight undead. It was rumored that the Emperor himself was killed in the push back. The undead armies retreated, but they still remain, and are fought over by necromancers who travel there with the idea of capturing the greatest horde of undead ever seen possibly on any world.\n\nIt was some 200 years before the fall of Nerim that the first orcs emigrated to the Nerimese subcontinent, building small villages in the mostly uninhabited south. At that time the area was mostly wasteland tundra, and the Nerans were uninterested in it or the Orcs. When the fall happened the orcs found themselves just outside of the radius of the Emperor's spell, and soon they were attacked by the undead hordes. They fled to a nearby volcano, where the God Molton sheltered them in deep caves while raining fire on the undead that came against them. They hid in the caves for 10 years before returning to the surface, only to discover that the tundra they had called home was gone, replaced by scorching deserts and ringed with massive mountains. They have since wandered the desert, traveling from oasis to oasis in tribes, building their own traditions and strengths far different from their mainland kin.","gods":["Nera","Molton"],"worship":"The necromancers of the island and the sentient undead still generally practice a perverted form of the worship of Nera. Meanwhile the Sand Orcs worship Molton, the God of Fire, and constantly pray for his mercy to survive the desert heat.","culture":"The rest of the world typically sees Sand Orcs as just odd looking Grunt Orcs, blissfully unaware of their existence. Those scholars who are aware of their existence generally know little about them.\n\nThe Sand Orcs themselves likewise have little use for the outside world. They live in a world surrounded by enemies and where the land itself can kill in hours if one is not careful. Water and food are preserved carefully, and waste is considered the worst of sins. No animal is killed without being eaten, and even cannibalism has not been unheard of when times were bad.\n\nIn no other place are the ceremonies surrounding disposing of the dead more important. Dead bodies that are not eaten are immolated by each tribes Priest of Molton to avoid the latent magic of the land bringing them back as undead. Something that is all too common in Nerim. Even accidentally dismembered bodyparts are immolated to avoid being strangled by your own disembodied hand in the middle of the night.","economics":"The sand orcs have a subsistence, hunter-gatherer type economy.","slavery":"The sand orcs do not keep slaves themselves, but generally do not care about others keeping slaves. The Necromancers rarely care to feed slaves, preferring to kill them and raise them as undead servants.","magic":"Magic is rare, but unregulated among the sand orcs. The necromancers do not regulate magic among themselves.","property":"Property is tribal among the sand orcs. Necromancers have no laws.","citizenship":"tribal membership among the sand orcs is strictly hereditary."},{"name":"Olda","primelanguage":"","seclanguages":[],"coords":[20.017226126835062,-4.746105405422187],"bordercoords":[[24.33458444595871,-2.9223632812500004],[23.933544517431127,-8.986816406250002],[23.208533980911863,-9.206542968750002],[20.681614215933067,-8.635253906250002],[19.484718252643226,-7.844238281250001],[18.86210780968572,-6.96533203125],[17.5262016095855,-5.954589843750001],[17.400442119113684,-5.119628906250001],[17.77745871418289,-3.9331054687500004],[20.804904106750566,-2.7465820312500004],[23.04688005066613,-2.4829101562500004]],"color":"#000000","map":"https://elthelas-images.herokuapp.com/maps/nations/Olda.jpg","capitol":"Diya","cities":["Punbar","Barak"],"landmarks":[],"borders":["Shendarel","Eldoran","Gnarra","Morrindim","Malinval"],"population":3500000,"populationDistribution":[{"race":"Goblins","proportion":0.65},{"race":"Kobolds","proportion":0.2},{"race":"Trollkin","proportion":0.04},{"race":"High Orcs","proportion":0.04},{"race":"Grunt Orcs","proportion":0.07}],"government":"Olda is ruled by a loose confederation of High Orc nobility and landowners, who occasionally fight among themselves but for the most part seek to enrich themselves by exploiting the large slave population. On the occasions that they feel the country in total is threatened, they will meet in congress and appoint a warlord to lead them, but this has not happened in almost 70 years, as they consider the threat from Shendarel to be a joke (given Shendarel's population is about that of the High Orcs' trollkin mercenaries alone).","ruler":"","history":"Olda for most of history has been a fractured land. The orcs, goblins, and kobolds that lived there were once all slaves to various warring creatures, including Nagas, a group of Giants, and a rogue remaining Sorceron. A group of five mighty High Orc heroes changed all of this, managing to fight and kill their masters. The surviving Nagas were forced into the jungles and swamps, while the giants were wiped out, and the Sorceron killed. These 5 heroes are the ancestors of the modern High Orc nobility, and seeing (in their way) that the natural state of the goblins and kobolds at least was indeed slavery, they set out to be 'benevolent' masters and formed a compact of mutual defense. Soon after, as the population of slaves began to expand, they began importing their first trollkin mercenaries to keep them in check.","gods":["Mat'raktha","Maris","Voodoo Hedge Gods"],"worship":"To underestimate the power of the High Orc rulers would be a serious mistake, and priests do not practice in the country without the local lords approval, except for voodoo witches among the goblin and kobold slaves. Among the slaves no one has ever had a chance to hear much about any of the real Gods (and it all sounds like hogwash anyway, right?), so they rely on voodoo when they need divine aid, and worship a local pantheon of hedge gods that changes between local areas, sometimes as quickly as the next plantation over. The orcs tend to worship Mat'raktha or Maris, while the Trollkin tend to be antitheistic.","culture":"The high orcs tend to be highly cultured people, with many esoteric practices to keep the peace among themselves, while the Trollkin are there to do a job, and the slaves are more direct. The high orcs live in large mansions, with small houses nearby for their mercenaries and mud brick huts where the slaves live, surrounded by large plantations of rice, grapes, olives, and silkworms. The cities tend to be tiered, with the inner core of the city being the homes of the wealthy, ringed by the smaller homes of the mercenaries and large workhouses where finished products are made for sale. The outer ring of the cities are vast slums inhabited by slaves. Slaves are magically branded so that everyone knows who they belong to.","economics":"Olda is overall an incredibly wealthy state, exporting large amounts of rice, wine, silk, gems, and other luxury goods produced on the plantations and in the workhouses. However, this wealth is highly concentrated in a small percentage of the population, making that population incredibly wealthy indeed. It is estimated that the top 6 wealthiest people in the world are all High Orc lords living in Olda, and that is including Kings and Emperors.","slavery":"Slavery is the standard practice in Olda, and 9 in 10 residents are slaves. All goblins and kobolds in the country are either slaves, or are considered available for capture as slaves.","magic":"The High Orcs are big fans of learning and study, and many of them take up wizardry or other magical arts to impress the neighbors if nothing else.","property":"Ownership laws and property laws were outlined in the compact and have not changed since. Disputes of property are typically handled by a conference of local landowners. Occasionally disputes will lead to highly ritualized duels, usually to the first blood. If the issue remains unresolved, or if vengeance is sought, local wars do occasionally break out. The ownership of slaves is restricted to orcs, and the ownership of land to orcs and those in their service.","citizenship":"Political activity is restricted to Orcs in Olda by custom."},{"name":"Riftlan Wilds","primelanguage":"","seclanguages":[],"coords":[3.910839072696496,-98.02715337810398],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Riftlan.jpg","capitol":"","cities":[],"landmarks":[],"borders":["Zelfir","Dera","Dera'Dragorim","Dragonhome","Hisru'de'tan"],"population":50000,"populationDistribution":[{"race":"Genasi","proportion":0.5},{"race":"Aasimar","proportion":0.1},{"race":"Tieflings","proportion":0.1},{"race":"Dragonborn","proportion":0.08},{"race":"Deran Humans","proportion":0.06},{"race":"Hisru Humans","proportion":0.05},{"race":"Fey'ri","proportion":0.04}],"government":"","ruler":"","history":"The grasslands of the Riftlan Wilds are an incredibly dangerous place, filled with monsters and extraplanar beings.  Creatures with extraplanar origins often feel drawn to the area however, and small fortified settlements of Genasi, Aasimar, and Tieflings exist in isolated pockets throughout the wilds.","gods":[],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Sage","primelanguage":"","seclanguages":[],"coords":[-25.122905883812038,-44.09630266696781],"border-coords":[],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Sage.jpg","capitol":"Sage","cities":[],"landmarks":[],"borders":["Hisru'de'tan","Stagenheim"],"population":500000,"populationDistribution":[{"race":"Grunt Orcs","proportion":0.94},{"race":"Goblins","proportion":0.05}],"government":"Sage does not have a unified government, but the city-state proper does have a single warlord; however his control does not extend far beyond the city itself. Meanwhile smaller tribes with their own warlords live throughout the territory. The various tribes have shifting alliances, and often fight among themselves as much as against their neighbors.","ruler":"","history":"Sage has little to no recorded history, but scholars in Stagenheim record first contact with orcs on the continent about 800 years ago. It is theorized, given their close similarity to the common Grunt Orcs of Malinval, that it was established first as a colony, where the Grunt Orcs later killed the local High Orc rulers. It may also be possible that a small group of grunt orcs rebelled and left Malinval to escape retribution.","gods":["Malik","Mat'raktha"],"worship":"Worship methods and God of choice tend to vary by clan, but Malik is the most common God. Each clan tends to have at least 1 priest of their particular patron God, who often has one or two apprentices, that deals with all matters religious for the clan.","culture":"Tribal and warlike.","economics":"Sage is mostly a self-sufficient society, with few exports and imports (and few nations are very willing to trade with them).","slavery":"The more prosperous clans always tend to have a few goblin slaves around.","magic":"Magic is unregulated, and there are even a few orc wizards in the city, however most casters tend to be of the more spontaneous variety.","property":"There is no specific law on property, but generally things are owned by whoever can hold on to it.","citizenship":"Tribal membership is determined by the particular customs of a tribe, but it typically requires birth within the tribe or various arduous tasks."},{"name":"Seran","primelanguage":"","seclanguages":[],"coords":[14.309630880716188,94.50774036588705],"bordercoords":[[12.905520920167211,99.82177734375],[12.562606132061612,94.89990234375],[11.574216080310618,89.18701171875001],[13.760728046441224,90.24169921875001],[15.249739618721511,90.85693359375001],[16.306959445169188,91.69189453125001],[16.644086562020608,92.13134765625001],[16.98062170817597,92.65869140625001],[17.022646451950358,93.75732421875],[17.484291431493666,95.03173828125001],[16.433450811660506,96.65771484375001],[14.35753037551214,99.07470703125001]],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Seran.jpg","capitol":"Kimly","cities":[],"landmarks":["Titan's Peaks"],"borders":["Nerim","Malinval","Terron"],"population":150000,"populationDistribution":[{"race":"Neran Humans","proportion":0.83},{"race":"Lightfoot Halflings","proportion":0.14}],"government":"The king's authority in Seran is absolute. And he works through an appointed bureaucracy that handles most day-to-day issues.","ruler":"","history":"Seran is the only remaining bastion of human habitation on the sub-continent that once was the center of power for the Nerimese Empire. The population consists of those who refused to give up their homes and flee in the face of the advancing armies of undead. The kings are the descendants of a powerful pair of heroes who rallied the people to defend themselves, saving a remnant of the people.","gods":["Cora"],"worship":"The worship of Nera is strictly prohibited in Seran, and occasionally those suspected of worshiping the Death Goddess are lynched, stoned, or otherwise killed rather than being brought before a magistrate. The locals mostly worship Cora the Crusader, who blessed them in their last ditch defense of their homes.","culture":"Seran has a large standing army under the command of the king. Unlike most embattled nations, the Seranites place such great honor in defending ones homeland that the army is strictly on a volunteer basis, and those who join quickly become professional soldiers. Meanwhile Kimly has a large merchant class, and sends out the most trade ships per capita of any human nation.","economics":"Seran is largely uninhabited outside of gathered settlements, and the area immediately around Kimly. Food is mostly imported from Terron or Dormania. The woods in Seran however are known for their hardwoods, and unlike the elves, they don't feel any misgivings about cutting down trees beyond conservation of economic potential. While there are ample minerals, including very valuable veins of adamantine, mithril, and diamond in the Titan's Peaks, they go largely untouched, as building a mine in mountains filled with roaming undead armies generally leads to a quick death. The few mines that exist are highly fortified and employ large numbers of mercenaries.","slavery":"Slavery is illegal and few slaves remain slaves when they come there.","magic":"There is a small school of wizardry in Kimly, but Necromancy is never taught and is strictly prohibited on pain of death.","property":"All citizens in Seran are permitted to own property, however, the king has the right to confiscate any property necessary for the defense of the state.","citizenship":"Anyone who maintains a residence in Seran is considered a citizen (and is thus subject to taxation)."},{"name":"Shendarel","primelanguage":"","seclanguages":[],"coords":[25.841921351954845,-5.448787499378367],"bordercoords":[[24.33458444595871,-2.9223632812500004],[23.933544517431127,-8.986816406250002],[24.93376675938881,-8.811035156250002],[27.027324130533298,-8.239746093750002],[28.697815516328,-6.04248046875],[28.582109884356534,-4.504394531250001],[26.281102283903156,-3.27392578125]],"color":"#0099ff","map":"https://elthelas-images.herokuapp.com/maps/nations/Shendarel.jpg","capitol":"Swava","cities":[],"landmarks":[],"borders":["Olda","Eldoran","Gnarra"],"population":300000,"populationDistribution":[{"race":"Neran Humans","proportion":0.7},{"race":"Half-Elves","proportion":0.15},{"race":"High Elves","proportion":0.08},{"race":"Imperial Humans","proportion":0.05}],"government":"Shendarel has been ruled by a feudal-style monarchy for the past 1000 years, with a (mostly) unbroken line of kings and queens for that entire period (excluding certain cousins inheriting). The nobles are kept in line with the king by the ever-present need to defend their country from the land-hungry High Orcs and their servants. Most people in the country have served as soldiers at one point or another, and if you have not served your term of service it is impermissible to own property (of any kind).","ruler":"Queen Gretchen Strongheart","history":"Shendarel was originally settled as two separate colonies, which later merged into the city of Swava, about 1100 years ago: one by a group of Elves expanding south from Eldoran, and the other a human expedition sent from a now-disappeared nation somewhere around present day Kandor. The eventual intermingling of blood meant that the bulk of the nobility and the established population, as well as the royal line, were in fact Half-Elves. This remained the case until the disaster at Nerim, when a massive amount of refugees arrived, outnumbering the locals by almost 3 to 1. This influx of impoverished people led to a vast growth in the population of serfs.","gods":["Alohim","Amathera","Cora"],"worship":"The God most commonly worshiped differs primarily by social class, with most of the nobility worshiping Alohim, while their men-at-arms and other soldiers worship Cora. The serfs generally worship Amathera. Nevertheless almost all clerics and priests in Shendarel are schooled in war, and often ride out with the soldiers when the community is threatened.","culture":"War is a way of life in Shendarel. Serfs generally live in fear of both the nobility above them, and regular attacks by orcs, trollkin, and their goblin slaves. Meanwhile the only real way to get out of serfdom is to join the army, where the first possessions one owns for themselves are their weapons and armor.","economics":"Economically, Shendarel exports grains, vegetables, and many other food products far in excess of the needs of their population, but imports large amounts of weapons and armors, mostly elven made. In many ways economically they are still a colony of Eldoran.","slavery":"While slavery is technically illegal, serfdom in Shendarel is barely different. Serfs cannot own property of any kind, and leaving the land of their liege lord is almost impossible without being considered an outlaw.","magic":"Those who can use magic in Shendarel are typically forced into military service unless they are already people of property. Wizards are rare simply because few have the time for extensive study.","property":"Land ownership can only be granted rather than purchased. Other property can only be owned by people who have served in the military.","citizenship":"Citizenship is a misnomer in a land where rights are granted according to birth."},{"name":"Ssitsu","primelanguage":"Yuan-ti","seclanguages":["Hisru"],"coords":[-5.531244325359963,-139.08691406250003],"bordercoords":[[-11.525778716699989,-137.24121093750003],[-10.133820586900628,-141.08642578125003],[-7.223524433766947,-143.67919921875003],[-5.651518917890183,-146.44775390625003],[-5.695248967605625,-148.55712890625003],[-0.2554312827941686,-146.44775390625003],[0.3597998813133666,-146.40380859375003],[2.3366932873360393,-145.08544921875003],[3.916319427417973,-144.64599609375003],[5.274212797424882,-142.93212890625003],[5.6679180749727625,-142.14111328125003],[5.799094449996251,-141.13037109375003],[7.1962757851302035,-139.19677734375003],[8.15439934578613,-137.13134765625003],[7.936835699063598,-136.12060546875003],[7.109069143257817,-135.24169921875003],[4.924042188161782,-135.37353515625003],[-2.276317439687528,-133.79150390625003],[-2.9348120012606476,-129.57275390625003],[-4.075233901391136,-128.64990234375003],[-6.176054301961396,-129.74853515625003],[-6.7437137958173246,-131.02294921875003],[-8.442488428411199,-131.72607421875003],[-9.18073598316442,-132.64892578125003],[-9.874157904704258,-134.14306640625003],[-9.527623008537583,-135.37353515625003]],"color":"#007700","map":"","capitol":"","cities":[],"landmarks":[],"borders":[],"population":1200000,"populationDistribution":[{"race":"Yuan-ti","proportion":1}],"government":"","ruler":"","history":"","gods":["Serangga"],"worship":"Serangga is worshipped as the patron of the Yuan-ti","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Staelia","primelanguage":"","seclanguages":[],"coords":[-51.91547346517478,-50.94745308304046],"bordercoords":[[-46.792068161928825,-58.45717856158622],[-46.00411630923806,-54.855932830060844],[-46.58104651714895,-49.959428770347785],[-46.490356282464795,-46.3581830388224],[-45.94303320745295,-43.06436072340284],[-48.275424532187756,-43.06375172759258],[-49.403377839461896,-43.546845667187455],[-51.309584167140905,-45.040045116844325],[-52.395296481196844,-46.269738781267606],[-53.74180767610814,-48.863674847132664],[-54.30971374970154,-49.43460404847206],[-54.79395574200991,-50.22512140417275],[-55.19729143756638,-51.19130928336248],[-55.497138288785806,-51.6304855920851],[-56.11455289253102,-54.30946107529299],[-57.556733864952214,-56.94451892762865],[-56.91462516472214,-61.38321694315054],[-52.875346558162484,-58.30898278209231],[-49.489092435122366,-58.35290041296455]],"color":"#00FFFF","map":"https://elthelas-images.herokuapp.com/maps/nations/Staelia.jpg","capitol":"Instar","cities":["Kelas","Pelgan"],"landmarks":["Troll Pass","Ice Wastes"],"borders":["Gorgro Plateau","Stagenheim","Alfadir","Ice Wastes","Tiaov Coast"],"population":12000000,"populationDistribution":[{"race":"Staelic Humans","proportion":0.9},{"race":"Stagen Gnomes","proportion":0.05},{"race":"Morrind Dwarves","proportion":0.03}],"government":"Staelia is a feudal monarchy with a strong class of battle-hardened nobility that is incredibly loyal to king and country.","ruler":"","history":"Staelia has had little effect on history outside of their own region, as most of their history has been spent fighting with various monstrous races from Gorgro and the Ice Wastes. Although occasionally they have had minor skirmishes with the gnomes and the separatist colony of Alfadir.","gods":["Alohim","Amathera","Sara","Tock","Sneordra"],"worship":"Worship in Staelia is almost entirely determined by social class. The nobility all generally worship Alohim, while the commoners worship Amathera or Sara. Those gnomes who live in Staelia typically worship Tock. Many, particularly in the south, also pay homage to Sneordra in hopes that she will protect them from the harsh winters.","culture":"Staelia is a culture of chivalric ideals. Romantic love is glorified, serfs are effectively property, with the justification of 'protection' and combat follows strict rules, at least internally. Staelia does not lack for tacticians willing to bend the rules in favor of a better result when facing unconventional foes, as unconventional is rather typical here.\n\nBuildings in Staelia are almost always strongly fortified and built of stone, and the air of paranoia can become almost palpable as one approaches the Gorgro plateau. A raid can happen at anytime, anywhere, and everyone knows it. Every few years the King or one of the powerful Lords will organize a campaign into the plateau, where they will hunt and kill as many trolls, ogres, and giants as they can manage, but this usually does little to stem the tide. Also, unless the army is very lucky or very skilled, casualties are usually high, reducing the number of men available for the border forts.\n\nNevertheless, the people of Staelia persevere. They have singlehandedly fought back the trolls and giants for hundreds of years, and while they have not grown in power or gained real ground, they have not gone into decline or lost territory either. It is a culture of endless war that the people have come to accept as simply the way their world is.","economics":"Staelia has a weak economy that is mostly agrarian. They import most of their finished goods from Stagenheim or Alfadir. It is the bread basket of Atyrea.","slavery":"Slavery is illegal in Staelia, yet serfdom is a cultural institution.","magic":"Magic is not regulated, although magi are drafted at a much higher rate than most people.","property":"Property ownership is restricted to those of noble blood.","citizenship":"Serfs are born to their land, as are the nobility. It means entirely different things for each class, as the nobility own the land they are born to. Nevertheless, citizenship in Staelia can only be acquired by birth or by declaration of the king (usually through assignment of property)."},{"name":"Stagenheim","primelanguage":"","seclanguages":[],"coords":[-36.56039393337069,-45.50166685488014],"bordercoords":[[-30.627868021988988,-41.531728066567496],[-29.141966429841336,-47.416690603450434],[-28.692394666557494,-52.818199339577866],[-36.70531110774926,-53.53414093322117],[-39.664385162230374,-53.89803632684293],[-41.63135419009182,-55.0652787821586],[-46.00411630923806,-54.855932830060844],[-46.58104651714895,-49.959428770347785],[-46.490356282464795,-46.3581830388224],[-45.94303320745295,-43.06436072340284],[-45.111815521121336,-42.62518441468024],[-43.60376465190968,-38.361824743114504],[-40.67178518351826,-38.317907112242224],[-40.23708119770154,-42.0509057363844],[-38.744979645057434,-41.2603883806837],[-37.25601956056729,-41.304306011555965],[-37.08092785557601,-41.531091389129486],[-36.27029661150108,-40.69665640255653],[-34.87635513202252,-40.65273877168426],[-34.840295024025934,-40.8284092951733],[-33.274861346151496,-40.916244556917825],[-31.231004534414804,-41.17975034215141]],"color":"#FF0000","map":"https://elthelas-images.herokuapp.com/maps/nations/Stagenheim.jpg","capitol":"Craftheim","cities":["Gnoma","Ifritan"],"landmarks":["Fire Islands"],"borders":["Hisru'de'tan","Sage","Alfadir","Staelia"],"population":2000000,"populationDistribution":[{"race":"Stagen Gnomes","proportion":0.85},{"race":"Deep Dwarves","proportion":0.05},{"race":"Strongheart Halflings","proportion":0.04},{"race":"Imperial Gnomes","proportion":0.03},{"race":"Kobolds","proportion":0.02}],"government":"The Gnomes of Stagenheim are ruled by a king and an elected parliament. The parliament is in charge of the collection of taxes and troops, as well as enacting laws. The King is responsible for leading the armies, and enforcing the laws. Local governments are generally split between elected mayors and more traditional feudal lords.","ruler":"","history":"Stagenheim started out as a haven for gnome mages with unusual ideas in a network of caves provided to them by the God Tock. Over time they managed to overcome their various opponents and conquered a small nation of dwarves, as well as subdued several kobold tribes. When they managed to expand to the edge of Alfadir, their population exploded as they were able to import large quantities of food and other raw materials from throughout the continent.","gods":["Tock","Fanome","Molton","Vulcan"],"worship":"The priests of Tock are wealthy supporters of the many technologists in the country, and are in turn supported by those inventors who make it big with their support. Meanwhile the priests of Fanome serve as the emotional core of the country, as the single independent country of gnomish people. Vulcan is primarily worshiped by the people in the eastern Fire Islands who give offerings in the hope of avoiding his wrath in the form of volcanic eruptions.","culture":"The Stagen gnomes are technologists to the core, and strange contraptions both mundane and magical are common throughout Stagenheim.","economics":"Stagenheim is a huge consumer of raw materials, and an exporter of all sorts of finished contraptions, magical devices, furniture, and metal goods.","slavery":"Slavery is illegal, and foreigners who have slaves often have them 'liberated' by the local authorities.","magic":"Magic use requires a license that can be revoked if the ability is misused, but the licenses are cheap, oversight limited, and rules lax.","property":"While physical property is generally well-enforced, special distinctions have to be made for depth and purpose of use.","citizenship":"Only gnomes have voting rights in Stagenheim."},{"name":"Terron","primelanguage":"","seclanguages":[],"coords":[36.7762924811868,98.89950345311317],"bordercoords":[[47.468949677672484,97.07519531250001],[46.89586230605985,97.71240234375001],[45.43508099838452,98.63525390625],[44.97062759301016,99.51416015625001],[44.34545810301834,100.04150390625001],[42.72078596277834,100.43701171875],[40.78678041401646,101.93115234375001],[38.17559185481665,102.59033203125001],[36.92135192790115,102.54638671875001],[34.74838307098529,103.11767578125001],[32.99714648628775,102.41455078125001],[32.145385562629315,101.62353515625],[31.69779270531287,101.00830078125],[31.360673191606306,99.90966796875001],[30.114245744598513,99.25048828125],[29.42763722319321,98.19580078125001],[29.542398322601738,96.35009765625001],[32.07093815080466,94.19677734375001],[32.368363067704735,94.15283203125001],[33.40163829558251,94.32861328125],[34.928726792983845,93.62548828125],[36.10903359678316,93.62548828125],[37.96801944035648,94.06494140625001],[40.25228042623786,94.06494140625001],[41.2509675141624,94.59228515625001],[41.481833430076065,94.59228515625001],[42.978530155644734,95.69091796875001],[43.935483850319784,96.04248046875001],[44.40827836571936,95.73486328125001],[45.21880793965786,95.95458984375001],[46.322274857040256,96.48193359375001],[47.284818765649284,96.17431640625],[47.64133557512159,96.61376953125001]],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Terron.jpg","capitol":"Tenecha","cities":[],"landmarks":["World Crack"],"borders":["Arad","Seran","Dormania"],"population":600000,"populationDistribution":[{"race":"Neran Humans","proportion":0.85},{"race":"Imperial Humans","proportion":0.1}],"government":"Terron is ruled by the Council of Lords. The 27 seat assembly is hereditary, and members are banned from intermarriage. Terron is unusual in this way that the nobility are in fact required to marry non-nobles in order to preserve the separation of the noble houses and prevent power from becoming consolidated in a single individual.","ruler":"","history":"During the period leading up to the cataclysm of Nerim, 27 Lords from within Nerim opposed the Emperor's plan for immortality. They tried to curry influence with the church to build opposition and force the Emperor to back down, but they were betrayed. Fearing for their lives they fled and met up on the island colony Terron. It was while they were meeting there that the cataclysm occurred. Horrified by the masses of undead they believed resulted from the use of Nera's power, they gave up the worship of Nera and took up the worship of Cora. Once the ensuing war ended, the 27 Lords split the island into 27 estates, and vowed to govern jointly rather then ever let one man have enough power to repeat an event like the cataclysm.","gods":["Cora","Sara"],"worship":"The nobility have traditionally worshiped Cora ever since the cataclysm, and many of the common people do as well. Sara also has a strong following among the agrarian class.","culture":"The culture of Terron is influenced by a strong sense of personal freedom and a distrust of powerful people. Laws are designed to protect individuals rights and limit the power of the great. It is the only country in the world with a progressive tax system.\n\nTerron's poor tend to be subsistence farmers or miners up in the mountains. While no one of them has much, they all help each other as much as they can, and to refuse aid to someone in need is considered the worst of manners.","economics":"Terron is a poor country of subsistence farmers and miners. The lords of the land typically have control of larger plantations and trading interests, but even they are usually only comparable to a middling noble or regional merchant in Dormania or Eldoran.\n\nThe mountains are dotted with small mines built by entrepaneuring prospectors. They tend to have big dreams, and not much capital, so their mines rarely get far beneath the surface, yet the rumors of large deposits of valuable gemstones and veins of silver and gold regularly draw them up into the mountains. Occasionally foreigners, particularly dwarves who hear the rumors, will find their way to Terron to try their luck, but the locals have a strong distaste for such outsiders 'who come to strip our land and carry away everything we have'.","slavery":"Slavery is illegal in Terron","magic":"Magic is closely regulated, and most high level magic is strictly illegal. One man should never be allowed so much power is the view in Terron.","property":"While any citizen can own property in Terron, there are restrictions on how much, although the nobility are the only ones that get close to pushing that boundary. Anyone who owns too much property is liable to have the extra portion of his estates confiscated and distributed to poor homesteaders.","citizenship":"An oath of opposition to tyranny and the Goddess Nera is required for citizenship in Terron."},{"name":"Tiaov Coast","primelanguage":"","seclanguages":[],"coords":[-52.45433567512184,-74.31163270708319],"border-coords":[],"color":"#222200","map":"","capitol":"","cities":[],"landmarks":[],"borders":["Alfadir","Staelia","Zelfir","Gorgro Plateau","Ice Wastes"],"population":50000,"populationDistribution":[],"government":"The southwestern coastal lands of Atyrea, while home to a few scattered Staelic settlements, are a largely ungoverned area populated by scattered tribes of gnolls and lizardfolk. The fertile farmland of the coast keeps bringing new settlers in from Alfadir, Zelfir, and Staelia, but the regular raids and the distance from major population centers have so far kept any government from imposing its will on the territory.","ruler":"","history":"","gods":[],"worship":"","culture":"","economics":"","slavery":"","magic":"","property":"","citizenship":""},{"name":"Waelin","primelanguage":"","seclanguages":[],"coords":[47.07199249565323,18.9694152655986],"bordercoords":[[62.8805099605879,24.118527290782605],[60.0706649887424,32.199371371278566],[55.98032952249634,34.527005807508374],[53.91121454964488,32.84711854652224],[50.1843731361829,29.158037553252324],[45.190264015431886,27.928343888829044],[40.288430386987976,37.502387418981904],[37.34450497634804,37.41455215723736],[33.25763758619377,29.201955184124614],[28.55678227774372,22.143172163018463],[31.67325224096816,18.01807056658823],[34.39897808891371,15.646518499486131],[36.47541104282962,15.47084797599709],[38.01455819225335,13.889813264595691],[40.330842639095756,12.396613814938831],[42.56167860586976,11.161386738823223],[46.506427047278464,11.600563047545844],[50.93809444305038,13.664691698542113],[53.28533204571649,13.928197483775653],[54.80741287246441,12.522833295863293],[55.56009756408095,10.853963322717394],[55.93112542893324,8.789834671721165],[56.63848346696102,8.391890875980083],[57.332822348363315,9.094572969936282],[57.99099584291889,13.79375947326815],[60.02678442879232,18.22944019136648],[62.08877950737382,21.78676829201961]],"color":"#9900FF","map":"https://elthelas-images.herokuapp.com/maps/nations/Eldoran.jpg","capitol":"Estapor","cities":["Sofala","Storvel"],"landmarks":["Glass Cliff","Mithral Hills","Moon Pass"],"borders":["Gnarra","Curinor","Demal Thor","Malinval","Shendarel","Olda"],"population":900000,"populationDistribution":[{"race":"Wood Elves","proportion":0.72},{"race":"High Elves","proportion":0.08},{"race":"Half-Elves","proportion":0.18}],"government":"Waelin is led by a council of Dukes who elect a leader from their own ranks, currently the Duchess of Estapor, Malorin Sadefa. Because their declaration of independence is so new, there is very little central government in place, and laws are mostly what was in place in Eldoran already.","ruler":"Duchess Malorin Sadefa","history":"Waelin is currently considered by most nations to be a rebellious province of Eldoran. However, as the months of the rebellion have gone on it has become increasingly clear to merchants and common folk that Eldoran's attempts to bring the province in line are unlikely to succeed without outside intervention, and they have begun to consider it a new nation state of its own. The Illustrious Guild of Merchants and Fine Artisans (colloquially IGoMFA) has recently sent an official representative to Duchess Sadefa's court to negotiate rules of trade for its members in Waelin separate from greater Eldoran.\n\nThe rebellion in Waelin began as a secession dispute, with the Dukes of Waelin disputing the secession of Darendel to the throne of Eldoran following the sudden death of the old king and his immediate heirs. This was compounded by the fact that Darendel had recently married a half-elf of questionable birth, meaning future heirs to the throne would not be pure-blooded elves, and by his subsequent mismanagement of the war effort, diverting critical resources to finding and executing a half-dwarf adventurer that had not been seen in months. Rumors likewise began to spread that the new queen had aligned herself with one or more demon lords, and it did not take long for political insiders to see the power she wielded over her husband.\n\nAfter formal protests with the new king about his queen and his use of resources fell on deaf ears, the Waelin dukes, also those hit hardest by the war effort and distant from Loridesa's political control, met in secret to determine a plan. Led by Duchess Sadefa, the Dukes determined that independence was the only viable option, and in concert with the Church of Sylvan, put for a proclomation that the Royal House of Se'la'mer had lost the blessing of Sylvan, and as such no elf was subject to their rule, and until such time as Sylvan chose a new King of the Elves, the Duchies of Waelin would heed no order from Darendel Se'la'mer or any of his representatives. Civil war had begun.","gods":["Gaian","Amathera","Sylvan"],"worship":"The elves worship Gaian and Amathera as nature God and protector. However Sylvan is worshipped the most as patron God of the Elves, who spent the God's War protecting her people rather than actively fighting. The elven royal house was chosen specifically by Sylvan to rule, and that divine right has prevented most civil conflict in Eldoran until now.","culture":"The elves love nature, and it shows in their practices and architecture. Aged trees are protected, and most smaller villages are actually built in the canopy of the trees, while the larger cities are built among them and around them. Farmers specifically grow crops that thrive in the shade and the elves tend to live far apart from each other (Eldoran has one of the lowest population densities of any country.)","economics":"The elves export specialty woods, spices, fine furniture, art, fine steel and mithril. They are also the world's largest exporter of magical goods such as scrolls, wands, and other enchanted items.","slavery":"Slavery is abhorrent to the elves.","magic":"Magic comes naturally to the elves and is highly commonplace. The regulations for its use are highly esoteric to outsiders, often dictating specific times when specific spells can be used. (For example the mage armor spell can only be cast when one feels threatened, and is considered a threat in itself).","property":"Trees are protected, and the removal of wood is usually done by special magic or the cutting of low branches rather than by cutting them down. Otherwise any elf can own property in Eldoran.","citizenship":"Any elf except moon elves are considered citizens. Although the only real difference between citizens and non-citizens is whether they are counted when seeking members of the council of elders."},{"name":"Zelfir","primelanguage":"","seclanguages":[],"coords":[-39.196076813671674,-87.48692196876138],"bordercoords":[[-37.46559360090851,-73.42008032398967],[-36.19940396139785,-73.81533900184002],[-35.62995388200713,-75.98153127123878],[-35.48695192624446,-77.2990601974066],[-33.05414097418502,-81.16572174647955],[-32.648047629886634,-83.09809750485903],[-31.718238135178932,-83.93076086725665],[-27.00958468012515,-90.93179564211535],[-29.486827145697518,-95.71881740719178],[-31.15582081025537,-101.51594468233019],[-33.75117696054486,-107.18131906485183],[-39.29126562559483,-100.09898189239509],[-40.771701870577616,-97.06866536220907],[-41.63135419009182,-93.86267830853406],[-43.156607944138194,-91.22673464411075],[-44.36264221327065,-89.82137045619842],[-45.328495924228626,-87.58157128171312],[-45.23573400797202,-86.2640423555453],[-43.47634212965924,-83.23372582535929],[-43.412529890757305,-80.59866797302367],[-40.97108508961965,-78.49062169115514],[-40.00184595114704,-76.64608119452019],[-37.813581246980014,-75.1437744893371]],"color":"#FFFF00","map":"https://elthelas-images.herokuapp.com/maps/nations/Zelfir.jpg","capitol":"Zelfin","cities":["Mandon","Last Watch"],"landmarks":["Sorcerer's Prison","Veldt"],"borders":["Hisru'de'tan","Alfadir","Dragonhome"],"population":3000000,"populationDistribution":[{"race":"Hisru Humans","proportion":0.8},{"race":"Deran Humans","proportion":0.07},{"race":"Staelic Humans","proportion":0.06},{"race":"Strongheart Halflings","proportion":0.05}],"government":"Three archmagi serve as judges and make executive decisions by majority vote. They are elected by the council of wizards, a legislative body of 23 arcane casters elected by arcanists residing within 22 political districts plus one extra appointed by the high priest of Amathera. Elections for archmage are done proportionally, where the top 3 candidates get a seat. Local districts are ruled by a district governor appointed by the archmagi, and serving at their pleasure. Similarly the archmagi serve until a majority of the council votes to replace them or they lose their seat in that council. Council members serve a maximum of three 6-year terms. The voting eligible population consists of approximately 10,000 arcanists with a registered residence and license to practice magic within the country.","ruler":"","history":"At the time of the compact of Gods, only a few of the Sorceron people remained on Elthelas, most of them having either died in the war, or retreated to other planes of existence. One of those, whose name has been lost to history, maintained a kingdom of slaves to serve his every whim in the south of the western continent. Some of his slaves he trained in wizardry to provide additional conveniences. This proved his undoing. Some hundreds of years after the compact, these wizards, having managed to shake off the compulsion of their master, divined a method to imprison him. They lured him away from the kingdom, and their cast a spell that entrapped him forever with only the few slaves he had brought with him within an impenetrable magical barrier. However, when they returned to the city they found that their fellow slaves were confused, and did not know what to do. So they elected from amongst themselves rulers to guide the nation.\n\nZelfir has traditionally been a peaceful nation, although there occasionally have been wars with outside forces from Hisru'de'tan and Alfadir, and once a war with Dera that lasted for nearly a dozen years. Most of the army's time is spent hunting down stray beasts that wander south from the veldt or extraplanar incursions.","gods":["Amathera"],"worship":"Amathera is worshiped with monotheistic zeal, and is considered the liberator and protector of their people, to the point of her high priest selecting the only seat in the governing council filled by appointment. Her temples in Zelfir tend to be lavish, while the priests themselves live as paupers, giving donations to the temple to the poor.","culture":"","economics":"Zelfir is primarily agrarian and rural, producing large amounts of wheat, barley, and other grains, as well as vegetables for export. In the wet east pepper is the primary good produced for export, while in the eastern mountains they mine iron and other minerals.","slavery":"Slavery is strictly illegal, as is serfdom.","magic":"One must have a license to practice magic in Zelfir, and enchantment magic is strictly forbidden. Similarly evocation spells and necromancy spells may only be cast with special dispensation from the local district governor.","property":"All people are allowed to own property, and property disputes are handled by the district governors, with possibility of appeal to the archmagi.","citizenship":"Voting rights requires the ability to cast arcane magic, a proper license to do so, and a permanent residence. However, anyone with a permanent residence in the country has the right of appeal to the local district governor to resolve disputes as well as further appeal to the council of archmagi."}]}