{"model":"Organization","documents":[{"id":"amatherasshield","title":"Amathera's Shield","description":"Amathera's Shield is an organization of knights, paladins, and others dedicated to defending the helpless and uplifting the poor and downtrodden.  \n\nIt has two branches, the militaristic branch seeks out war zones, building and defending refugee camps, and setting up defenses in communities likely to be subject to raids or attack.  The charitable branch goes into communities to distribute food, supplies and education.\n\nBoth branches have a heirarchical ranking system based on knightly orders, with new initiates referred to as pages, followed by squires.  Senior members are called 'shieldmaiden' or 'shieldwarden' depending on their gender.\n\nAmathera's Shield is sponsored by the church of Amathera, and is greatly respected everywhere Amathera is worshipped.  Their headquarters is in the city of Mandon in Zelfir, but they have chapterhouses in many major cities throughotu the world.","nations":["zelfir","deradragorim","alfadir","staelia","eldoran","gerasalim","kandor","dormania","terron","shendarel","seran","curinor","morrindim"],"cities":["malidal","desadorel","farengar","kaland","eastguard","strovenguard","granitebluff","storval","torinhammer","tenecha","kimly","swava","alados","kelas","dieel","fradae","damat","mandon","zelfin","lastwatch","portsmith","vashna","delan"],"rules":["Defend the weak and provide refuge.","Don't start conflicts, finish them.","Provide charity for the poor."],"ranks":[{"index":0,"name":"Volunteer","minDisposition":0,"description":"You have volunteered to aid the order."},{"index":1,"name":"Squire","minDisposition":2,"description":"You have been accepted by a knight of the order for training, in return for service."},{"index":2,"name":"Knight","minDisposition":4,"description":"You have been recognized for your skill and valor, and have been granted title as a knight."},{"index":3,"name":"Guardian","minDisposition":8,"description":"Your reknown in defense of the downtrodden precedes you wherever you go."}],"features":[{"minrank":1,"name":"Defense","description":"You gain proficiency with shields and a +1 Shield with the insignia of Amathera on it."},{"minrank":2,"name":"Protector","description":"When gain the protection fighting style. If you already have this fighting style, pick another fighting style of your choice."},{"minrank":3,"name":"Magic Refuge","description":"You can cast the spell Ottiluke's Resilient Sphere 1/day without using a spell slot.  When cast in this way you can only target a willing target."}]},{"id":"blacksun","title":"Black Sun","description":"The Black Sun is a loose international organization of thieves, cutthroats, assassins, and bandits.  They have a presence in most major cities throughout the world, however there is no strong central leadership.  Each local branch will typically have it's own guildmaster, and it's own call signs and codes in addition to the more global thieve's cant.  Members who travel can usually expect to find safeharbor in local chapterhouses, but little trust or aid.\n\nSimilarly it is not uncommon for different branches of the Black Sun to work at cross purposes. It is common for branches to be clandestinely payed for espionage work by one government, only for their opponents to pay a different branch for the same work.\n\nMembership in the Black Sun is membership for life, in that if you try and leave or betray the Black Sun they will hunt you down and kill you.","nations":["eldoran","dormania","gerasalim","curinor","kandor","demalthor","terron","malinval","seran","degakta","morrindim","olda","shendarel","deradragorim","zelfir","hisrudetan","sage","stagenheim","alfadir","staelia"],"cities":["malidal","poron","desadorel","falak","farengar","sreppe","northport","strovenguard","eastguard","purs","kaland","westport","highhammer","granitebluff","curinkeep","torinhammer","stromforde","storval","aridhem","sofala","estapor","makhol","forbel","marinval","makir","parakas","malgeth","mordaserekhai","gulutheim","ochreken","tenecha","kimly","sunra","alados","morrind","diya","punbar","barak","swava","milan","loridesa","dima","vasha","vashna","delan","portsmith","tarum","shodal","sage","craftheim","gnoma","ifritan","atyrao","fradae","damat","dieel","kelas","instar","pelgan","mandon","zelfin"],"rules":["Never betray the Black Sun.","Profit by any means.","Contribute to the Guild's coffers regularly"],"ranks":[{"index":0,"name":"Associate","description":"You get chosen for the most dangerously stupid missions, and are the first to be blamed when they go wrong, but you are part of the team.","minDisposition":1},{"index":1,"name":"Footpad","description":"You've been pulled off the high risk missions to do the even riskier missions, but at least they are willing to train you now.","minDisposition":4},{"index":2,"name":"Black Cap","description":"You've been invited to join the real thieves in the conference room.","minDisposition":6},{"index":3,"name":"Operative","description":"You're good, and you know it. No one else trusts you, but for good reason.","minDisposition":8},{"index":4,"name":"Master","description":"You've seen, and stolen, it all. You're still expendable, but at least now you know it.","minDisposition":10}],"features":[{"minrank":0,"name":"Access","description":"You have access to guild merchants and fences who can sell you black market goods or purchase your stolen goods. You also gain access to any... helpful... members of the local watch who may be willing to look the other way for properly expressed gratitude."},{"minrank":1,"name":"Pickpocket","description":"You gain proficiency in the slight of hand skill, if you already have proficiency, gain proficiency in a skill of your choice from the following list: acrobatics, athletics, deception, intimidation, investigation, perception, stealth"},{"minrank":2,"name":"Tools of the Trade","description":"You gain a set of magical thieves' tools. You get a +1 bonus to any thieves' tools check when you are using your magical tools."},{"minrank":3,"name":"Contacts","description":"You are trusted with the lists of contacts to other Black Suns guild houses. You can track down the guild house in any town you go to, and are welcomed there (as much as thieves' ever are) and they can provide you with information on the local situation or leads to quests or marks."},{"minrank":4,"name":"Mastery","description":"You are the undisputed master of your trade, you gain expertise in a skill or tool of your choice with which you are proficient."}]},{"id":"blackwolfirregulars","title":"Black Wolf Irregulars","description":"The Black Wolf Irregulars are a mercenary organization that has existed in northern [Elathia](/geo/continents/elathia) for the last 200 years or so, hiring themselves out by company to various militaries. They have a history of taking in those who don't fit into a standard military structure and coming up with unusual tactics designed to take advantage of them. After the formation of the [Alliance of 6 Nations](/org/allianceof6nations) they were hired en masse by the same to be a cross-national force that worked strictly for the Alliance as a whole. The Irregulars typically work in small squads on the peripheries of major battles, handling scouting missions, infiltration missions, and other missions that require unusual or specialized training for a small number of individuals.\n\nDespite their reputation for success and loyalty to their contractors, they still tend to be distrusted by national professional militaries.","nations":["eldoran","demalthor","curinor","gerasalim","kandor","dormania"],"cities":["strovenguard","eastguard","purs","sreppe","desadorel","aridhem","estapor","storval","highhammer","granitebluff","loridesa"],"rules":["Complete the objective  you are given, even if it means working outside of typical means and methods.","Keep in contact with your commanding officer.","Leave no man behind.  Work as a team with your squad and don't leave anyone in enemy hands."],"ranks":[{"index":0,"name":"Camp Follower","description":"They let you follow them around. You don't get a cut of the loot though, and you probably aren't invited into combat.","minDisposition":2},{"index":1,"name":"Irregular","description":"You are respected enough to finally get a cut of the loot. Not much of course, but some.","minDisposition":4},{"index":2,"name":"Black Wolf","description":"You are now a trusted member of the irregulars, you are called upon for most missions, and get a decent portion of the loot.","minDisposition":8}],"features":[{"minrank":0,"name":"Informed","description":"You are always given information related to the Black Wolves location, and their current missions and objectives."},{"minrank":0,"name":"Equipped","description":"The irregulars supply you with basic equipment to the tune of 100 gp of gear."},{"minrank":1,"name":"Cut of the Loot","description":"You gain a +1 weapon or a wand for a 1st level spell of your choice."},{"minrank":2,"name":"Advanced Training","description":"Add +1 to one ability score of your choice. Also pick 1 skill you are proficient in, you gain expertise in that skill."}]},{"id":"championsofcora","title":"Champions of Cora","description":"The Champions of Cora are an unofficial offshoot of the [Church of Cora](/ref/gods/cora). They are a group of adventurers who travel the world, either individually or in small groups, finding hopeless situations to turn around for the cause of good. The champions were a largely unknown organization until the [Neran Cataclysm](/history/nerimcataclysm), when the Champions were the first, and most successful, respondants to the crisis. They successfully organized the evacuation of thousands of survivors, while delaying the advance of the undead hordes. Their intervention enabled the nations of the world to mount an organized response, and it was rumored that it was in fact a Champion of Cora who fought the once Emperor of [Nerim](/geo/nations/nerim), turned Lich King, in single combat. Defeating him before succumbing to his wounds.\n\nChampions of Cora are almost always welcomed in any good aligned community in which they arrive, although governments often resent their interventions.","nations":["dormania","gerasalim","curinor","seran","shendarel","eldoran","demalthor","terron","staelia","malinval"],"cities":["malidal","eastguard","strovenguard","highhammer","granitebluff","kimly","swava","estapor","loridesa","aridhem","tenecha","pelgan","instar","kelas","gulutheim"],"rules":["Defend the weak at all costs","No cause is without hope","Evil must be destroyed","Never choose the lesser evil"],"ranks":[{"index":0,"name":"Brave","minDisposition":2,"description":"The Champions of Cora have recognized you for your bravery, and provided you with provisional membership into the order, as well as a blessing from Cora."},{"index":1,"name":"Fearless","minDisposition":6,"description":"The blessings of Cora have been placed upon you, and you are prepared to defend the weak even against impossible odds."},{"index":2,"name":"Champion","minDisposition":10,"description":"You have become reknowned for your bravery and selflessness. Cora is your guiding light, and it is the wicked who shall know fear, not the weak."}],"features":[{"minrank":0,"name":"Hope Springs Eternal","description":"Whenever you are reduced to 0 hit points you can roll a d10 + your level and heal by that many hit points.  After you use this feature you cannot use it again until after a short or long rest."},{"minrank":1,"name":"Fearless","description":"You are immune to fear"},{"minrank":2,"name":"First Strike of the Faithful","description":"You have advantage on initiative checks."}]},{"id":"church","title":"Official Church of a God","description":"Each of the Gods of Elthelas have an established priesthood that has priveleges in nations that worship that God.","nations":[],"cities":[],"rules":["Follow the tenets of your God.","Spread the faith with others.","Serve those of a higher rank, and follow the instructions of your God."],"ranks":[{"index":0,"name":"Acolyte","minDisposition":1,"description":"You have been hired to work for the church as an acolyte."},{"index":1,"name":"Deacon","minDisposition":3,"description":"You have been assigned to the service of members of the faith in the field."},{"index":2,"name":"Priest","minDisposition":5,"description":"You have been granted control of a rural church or a particular mission for a larger church."},{"index":3,"name":"Bishop","minDisposition":8,"description":"You are in control of the churches functions in a set of villages or a moderately sized town."},{"index":4,"name":"High Priest","minDisposition":12,"description":"You have control over the churches functions over a significant area, city, or even a small country."}],"features":[{"minrank":0,"name":"Shelter of the Faithful","description":"As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.\n\nYou might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."},{"minrank":1,"name":"Ear of the Faithful","description":"The followers of your God turn to you for advice and guidance. If an NPC is a follower of your God they are likely to be friendly to you, and you have advantage on charisma checks to influence them."},{"minrank":2,"name":"Service of the Faithful","description":"You are in command of a small group of deacons and acolytes who work for the local church. So long as your orders are reasonable and within the tenets of your God these followers will do as you command."},{"minrank":3,"name":"Tithes","description":"You receive and decide how to spend the tithes from the worshippers of your God in your assigned area, and have control of a church or shrine where those tithes are given."},{"minrank":4,"name":"Voice of God","description":"You are the Voice of your God in your area. You learn the Commune spell, and can cast it 1/day without expending a spell slot."}]},{"id":"demalthorpeacefulrenewalfront","title":"Demal'Thor Peaceful Renewal Front","description":"The DPRF is a new organization formed after the war with the primary goal of encouraging the Moon Elf Diaspora to return to Demal'Thor. Additionally, they take an active role in politics within and outside Demal'Thor advocating for the end to wars, peaceful resolution to conflict between races, and the abandonment of warmongering \"Geeater\" Gods such as Mat'raktha and Alohim, and the renewal of culture through the arts and the worship of the Gods of the Arts such as Adonna, Kamin, and Bragi.","nations":["demalthor","eldoran","gerasalim"],"cities":["Aridhem"],"rules":["Avoid conflict when you can, fight only in self-defense.","Pracice artistic pursuits to uplift those around you.","Provide for the people of Demal'Thor to return home and return to their traditional way of life.","Give no assistance to the Gods of War"],"ranks":[{"index":0,"name":"Volunteer Artist","minDisposition":0,"description":"Volunteers are always needed."},{"index":1,"name":"Coordinator","minDisposition":3,"description":"You are responsible enough to be placed in charge of managing aid shipments for a local village or area."},{"index":2,"name":"Diplomat","minDisposition":6,"description":"Your missions are sending you further and further afield, securing aid and support for the renewal front."},{"index":3,"name":"Ambassador","minDisposition":10,"description":"You've been setup as lead ambassador to a major power."}],"features":[{"minrank":0,"name":"Artistic Training","description":"Gain one free proficiency in a musical instrument or a set of tools used for artistic pursuits (such as sculpting, caligraphy, or painting). Add that musical instrument or set of tools to your inventory."},{"minrank":1,"name":"Persuasive Speaker","description":"You gain proficiency in Persuasion, if you are already proficient you gain expertise instead."},{"minrank":2,"name":"Conflict Resolution","description":"You learn the spell calm emotions. Charisma is your casting stat for this spell. You can cast calm emotions once without using a spell slot, and when cast in this way creatures have disadvantage on the saving throw to avoid the effects of the spell. You regain the ability to cast the spell this way when you finish a long rest."},{"minrank":3,"name":"Strength in Peace","description":"You gain a special action, called meditate. When you use this action, you gain the following benefits for one minute or until you make an attack, cast an offensive spell, or take damage:\n\n* Your healing spells heal for an additional 1d6 hp.\n* Your AC increases by 1\n* Any spell you cast on a willing target that has a range other than self can target one additional creature within range.\n\nYou can use this action a number of times equal to your proficiency bonus, and recover all expended uses when you finish a long rest."}]},{"id":"elathianrangers","title":"Elathian Rangers","description":"Reknowned explorers and adventurers, The Elathian Rangers are a loose organization dedicated to exploring unknown haunts.  They sponsor outfitters in cities close to remote locations that act as the gatekeepers to the organization.  These outfitters compile maps and information brought in by the rangers, creating guide books and outfitting kits.","nations":["eldoran","demalthor","gerasalim","morrindim","terron","dormania","kandor","curinor"],"cities":["seldan","dima","estapor","aridhem","eastguard","pelgan","morrind"],"rules":["To stay in one place is to fail to grow, I must always be finding new places","The frontiers are dangerous and I must always strive to make them safer for others","I must attempt to preserve natural beauty where I find it"],"ranks":[{"index":0,"name":"Hunter","minDisposition":1,"description":"Your wilderness skills are enough to get you some basic recognition from the local rangers."},{"index":1,"name":"Scout","minDisposition":3,"description":"You have ventured into the wilderness and come back alive and with tales to tell."},{"index":2,"name":"Explorer","minDisposition":5,"description":"You've been places no one else has ever been before, and been recognized for the effort."}],"features":[{"minrank":0,"name":"Hunter's Mark","description":"Add the spell hunter's mark to your spells known or spellbook.  You gain the ability to cast hunter's mark 1/day as a first level spell without expending a spell slot."},{"minrank":1,"name":"Favored Terrain","description":"You gain a favored terrain.  See the ranger feature by the same name, if you already have a favored terrain you may pick an additional one."},{"minrank":2,"name":"Master Hunter","description":"When you cast hunter's mark the spell no longer requires concentration."}]},{"id":"guild","title":"Guild of Merchants or Artisans","description":"You are a member of a local guild specializing in a particular trade.","nations":[],"cities":[],"rules":["Be proficient with the tools of the trade.","Do not undercut the prices of fellow members.","Only sell quality work."],"ranks":[{"index":0,"name":"Apprentice","minDisposition":0,"description":"You have been hired to work, and learn from, a master tradesman."},{"index":1,"name":"Journeyman","minDisposition":2,"description":"You have progressed and learned until you are able to handle projects on your own."},{"index":2,"name":"Master","minDisposition":5,"description":"You are now a master of your trade, with the skills and expertise"}],"features":[{"minrank":0,"name":"Guild Membership","description":"As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings. Guilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might require the donation of money or magic items to the guild’s coffers. You must pay dues of 5 gp per month to the guild. If you miss payments, you must make up back dues to remain in the guild’s good graces."},{"minrank":1,"name":"Tool Proficiency","description":"You gain proficiency in a set of tools related to your guilds work. If your guild does not use artisan's tools (such as a guild of merchants) you instead gain proficiency in one skill related to your guilds work. (such as Persuasion or Insight for a guild of merchants)."},{"minrank":1,"name":"Loans","description":"You have the ability to take loans from the guild at a favorable interest rate so long as you have paid off any previous loans taken. The size of loan you are able to take depends on what sort of collateral you can provide. The maximum is either 1000 gp or twice the value of the collateral."},{"minrank":2,"name":"Tool Expertise","description":"You gain expertise in one set of tools related to your guilds work with which you are already proficient, allowing you to add double your proficiency bonus when making checks with those tools. If your guild does not use artisan's tools (such as a guild of merchants) you instead gain expertise in one skill related to your guilds work with which you are already proficient. (such as Persuasion or Insight for a guild of merchants)."}]},{"id":"inevitables","title":"The Inevitables","description":"The Inevitables are a group of bounty hunters that emulate the true Inevitables, immortal machines created by Tock to hunt those who break their oaths, or seek to destroy the most basic tenets of order in the universe, like mortality and the immutability of time. The lowest ranks of the Inevitables serve as thief takers, hunting those who have broken the law on behalf of local authorities, the upper echelons of the society seek greater prey however. Creatures that seek to break the bonds of mortality, such as a lich, or mortals that seek to ascend to godhood face the wrath of the mortal inevitables.\n\nThe Inevitables are an organization shrouded in mystery. They do not report to governments or other earthly entities but to the celestial constructs themselves. Their strict interpretation of law and order often makes even kings and sherriffs uncomfortable.","nations":[],"cities":[],"rules":["The 5 most important laws of order are be strickly enforced. These laws are: \n\n* The law of oaths - That all oaths are inevitably kept.\n* The law of Justice - That all who escape justice will inevitably be face it.\n* The law of Death - That all who live will Inevitably die.\n* The law of Godhood - That all who attempt to attain Godhood shall Inevitably fail.\n* The law of Space and Time - That all who attempt to Alter Fate will inevitably meet that same fate.","Your goals are Inevitable, nothing will stop the goal from being fulfilled.","Those who are set to be punished, whether they are to be captured or killed, will meet that exact fate.","Those who are innocent of any crime cannot be harmed by you, or coerced into crime."],"ranks":[{"index":0,"name":"Thief Taker","minDisposition":2,"description":"You have been contacted by the Inevitables and granted your first missions as a thief taker and bounty hunter."},{"index":1,"name":"Punisher","minDisposition":4,"description":"You have been recognized for your skill and loyalty with more difficult missions, and gifts from the Inevitables."},{"index":2,"name":"Herald of Mechanus","minDisposition":8,"description":"You have reached the upper ranks of the Inevitables, and are feared by criminals, rogue magi, and other agents of chaos."},{"index":3,"name":"Inevitable","minDisposition":12,"description":"You are inevitable."}],"features":[{"minrank":0,"name":"Equipped for Battle","description":"Your patron knight is willing to take a risk on you and give you 100 gp worth of combat equipment."},{"minrank":1,"name":"Robotic implants","description":" You gain darkvision up to 60ft. If you already have darkvision, the vision distance is doubled."},{"minrank":2,"name":"Hunt the Lawbreaker","description":"You can cast Locate Creature once a day without expending a spell slot."},{"minrank":3,"name":"Cybernetic Enhancement","description":"Your physical capabilities are enhanced by cybernetic implants in your arms and legs. You gain proficiency in the athletics and acrobatics skills. If you are already proficient, you gain expertise instead."}]},{"id":"military","title":"National Military Organization","description":"You are part of a national military organization, such as an army or navy, that reports to a central government.","nations":[],"cities":[],"rules":["Follow orders.","Do not aid the enemy.","Defend the national honor."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"Welcome to the Army."},{"index":1,"name":"Private","minDisposition":2,"description":"You have finished basic training and have been assigned to the field."},{"index":2,"name":"Sergeant","minDisposition":4,"description":"You have responsibilities, and men who report to you, the pay bump is nice though."},{"index":3,"name":"Leiutenant","minDisposition":6,"description":"As a leiutenant your job has shifted from direct command of a small squad to an advisory role for a platoon captain."},{"index":4,"name":"Captain","minDisposition":10,"description":"You have command of a platoon, made up of several squads."}],"features":[{"minrank":0,"name":"Equipped","description":"The army supplies you with basic equipment to the tune of 100 gp of standardized gear. Don't break it, it (and you) belong to the army now."},{"minrank":1,"name":"Well Trained","description":"You gain proficiency with martial weapons if you did not already have it. If you already had such proficiency, you instead gain one tool or vehicle proficiency related to your service (such as Vehicles (water) if you were in the navy, or Blacksmith's tools if you were a quartermaster)."},{"minrank":2,"name":"Officer","description":"You have a military rank. Soldiers loyal to your military organization recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."},{"minrank":3,"name":"Expert Combatant","description":"You learn one fighting style available to the Fighter Class. If you already have a fighting style you cannot pick the same fighting style twice."},{"minrank":4,"name":"War Veteran","description":"The are so used to wearing armor that you feel strange when you take it off. You gain a +1 bonus to AC while wearing armor."}]},{"id":"militia","title":"Local Militia","description":"You are part of a regional militia, city watch, or other limited scope self-defense focused military organization.","nations":[],"cities":[],"rules":["Follow orders.","Seek out and stop criminals and bandits.","Protect the city."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"Welcome to the Watch, the night is long and full of terrors."},{"index":1,"name":"Watchman","minDisposition":2,"description":"You have finished basic training and have been assigned to the field."},{"index":2,"name":"Sergeant","minDisposition":4,"description":"You have responsibilities, and men who report to you, the pay bump is nice though."},{"index":3,"name":"Leiutenant","minDisposition":8,"description":"As a leiutenant your job has shifted from direct command of a small squad to an advisory role for a platoon captain."},{"index":4,"name":"Captain","minDisposition":12,"description":"You have command of a platoon, made up of several squads."}],"features":[{"minrank":0,"name":"Equipped","description":"The militia supplies you with basic equipment to the tune of 100 gp of standardized gear."},{"minrank":1,"name":"Trained","description":"You gain proficiency with martial weapons if you did not already have it. If you already had such proficiency, you instead gain one tool or vehicle proficiency related to your service (such as Vehicles (water) if you were in the navy, or Blacksmith's tools if you were a quartermaster)."},{"minrank":2,"name":"Watcher's Eye","description":"Your experience in enforcing the law, and dealing with lawbreakers, gives you a feel for local laws and criminals. You can easily find the local outpost of the watch or a similar organization, and just as easily pick out the dens of criminal activity in a community, although you're more likely to be welcome in the former locations rather than the latter."},{"minrank":3,"name":"Officer","description":"You have a military rank. Watchmen loyal to your militia organization recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."},{"minrank":4,"name":"Master of the Wall","description":"You have learned to inspire your compatriots to feats of greatness in defense of their home. When a creature other than yourself who can hear you is hit by an attack, you can use your reaction to add +5 to their AC for that attack, potentially causing the attack to miss."}]},{"id":"noblehouse","title":"Noble House","description":"There are countless noble houses in nations throughout the world. Members of these houses have priveleges and social ranks within the country. That being said, not all countries have a noble class. The nations listed below are the ones that have a landed nobility. Not all members of a noble house are members of the noble family themselves. Many are hirelings or longtime friends, who while not being inheritors of the title, have abilities and priveleges to act on behalf of the family. The highest ranks of this organization are not reachable by normal means.","nations":["Eldoran","Waelin","Curinor","Terron","Dormania","Kandor","Curinor","Malinval","Federated Alliance Territories","Shendarel","Olda","Dera'Dragorim","Stagenheim","Staelia","Hisru'de'tan","Asuran Confederacy"],"cities":[],"rules":["Promote the interests of the house","Follow the orders of the house leaders","Protect the noble family at all costs"],"ranks":[{"index":0,"name":"Hireling","minDisposition":0,"description":"You have been hired to work for the noble house, trust is limited, but for now they seem to need you."},{"index":1,"name":"Aide/Minor Family Member","minDisposition":3,"description":"You are trusted enough to be assigned to a particular member of the house as a permanent aide, with access to priveleged information."},{"index":2,"name":"Courtier/Influential Family Member","minDisposition":5,"description":"You have been brought into the inner circle of the ranking member of the family."},{"index":3,"name":"Heir Apparent","minDisposition":20,"description":"You are so well trusted by the ranking member of the family that you have been adopted and named heir apparent."},{"index":4,"name":"Lord","minDisposition":99,"description":"You are the Lord of the House, and command all the resources at the houses disposal, including estates, courtiers, aides, and hirelings. Your voice has weight in the government of the country. This rank can only be achieved if you are the Heir Apparent and the previous Lord dies or resigns."}],"features":[{"minrank":0,"name":"Equipped","description":"Your house is willing to supply funds to aid in equipping you for duty to the tune of 100 gp worth of equipment."},{"minrank":1,"name":"Influence","description":"You have an intimate knowledge of not only your own house, but other noble houses within your nation. You have advantage on history and persuasion checks related to the nobility or made to influence them."},{"minrank":1,"name":"Position of Privilege","description":"Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."},{"minrank":2,"name":"Powerful Backers","description":"You are a prominent and powerful person in local politics, and your words and actions have weight. You are able to command lesser members of your house, and they will assist you however they can. Members of other houses and guards within your nation and nations friendly to it recognize your sigil and give you deference."},{"minrank":4,"name":"Lord","description":"You have control of the houses estates, and the command of the houses members. Your voice has weight in the halls of power."}]},{"id":"royalguard","title":"Royal Guard","description":"You are a member of an elite order of knights dedicated to the defense of a ruler, their family, and closest confidants. Some notable examples of Royal Guard organizations are the Silver Dragon Knights of Dera'Dragorim and the Dormanian Imperial Guard in Dormania.","nations":[],"cities":[],"rules":["I must abide no threat to the King's life, or the life of members of his family or court.","I must maintain vigilance in my duty at all times. Enforcing the will of the king.","The kingdom is an extension of the king, and must be protected from harm."],"ranks":[{"index":0,"name":"Squire","minDisposition":2,"description":"You have been accepted by a knight of the order for training, in return for service."},{"index":1,"name":"Knight","minDisposition":4,"description":"You have been recognized for your skill and valor, and have been granted title as a knight."},{"index":2,"name":"High Knight","minDisposition":8,"description":"You are known to be reliable and capable, and worthy of the trust of the King. You have been assigned to his personal bodyguard, or to execute missions of high importance to the throne."}],"features":[{"minrank":0,"name":"Equipped for Battle","description":"Your patron knight is willing to take a risk on you and give you 100 gp worth of combat equipment."},{"minrank":1,"name":"Guard the Door","description":"You gain proficiency in the perception skill.  If you are already proficient you gain expertise instead."},{"minrank":2,"name":"Guard the Body","description":" You gain the protection fighting style, if you already have the protection fighting style choose another fighting style from your class list.  Also you get a +1 bonus to AC while wearing a shield and you have an adjacent ally."}]},{"id":"trollkinmercenarycorps","title":"Trollkin Mercenary Corps","description":"The Trollkin Mercenary Corps is the official diplomatic arm of Degak'Ta, but membership is not restricted to citizens of Degak'Ta or Trollkin.  They are an elite group of mercenaries who will sign up for any conflict for the right price, even different sides of the same conflict. Once contracted they are known to be extremely loyal and impartial, governed by the contract they are given until it expires.  Further they are known to be among the best warriors in the world, so being able to afford Trollkin Mercenaries is considered extremely prestigious.","nations":["degakta"],"cities":["sunra"],"rules":["My contract is law.  Failing to fulfill the contract I agree to is never acceptable for any reason.","Never work without payment.  We are not a charity organization","Avoid religious entanglements.  Many employers have particular religious beliefs, and one should avoid offending future employers.  I must never engage in public displays of religion or work directly for a religious organization."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"You are a new recruit. Execute your contracts with honor and they may just let you stay."},{"index":1,"name":"Bravo","minDisposition":2,"description":"You have been recognized as a skilled mercenary, and have been issued a letter of rank."},{"index":2,"name":"Veteran","minDisposition":6,"description":"You are known to be reliable and capable. Good work soldier."},{"index":3,"name":"Elite","minDisposition":10,"description":"Pips on the shoulder mark you out as someone who has been around the block more than once."}],"features":[{"minrank":0,"name":"Equipped for Battle","description":"The corps is willing to take a huge risk on you and give you 100 gp worth of combat equipment."},{"minrank":1,"name":"Battle Master","description":"The advance training the Corps provides has paid off and you are able to do more damage with every swing of your sword or shot of your bow.  You get +1d4 damage on all weapon attack rolls."},{"minrank":2,"name":"Advance Payment","description":"People who give you contracted missions are willing to pay in advance whenever they are able.  The reputation of the Mercenary Corps preceeds you."},{"minrank":3,"name":"Grit","description":"You've been through hell, and are quite sure you can do it again. You gain the Tough feat."}]},{"id":"unionofwizardscolleges","title":"Union of Wizard's Colleges","description":"The Union of Wizard's Colleges is an international organization dedicated to the sharing of magical knowledge.  Unlike the Artificer's, who hoard artifacts and technical expertise, the Union is dedicated to training young wizards, sorcerers, bards, and others to use their magical abilities responsibly.  Founded first by the colleges in Zelfir's major cities as a way to prevent magical accidents and misuse of magic, the Union has since spread across the globe. It's members vow to always use magic responsibly, avoiding collateral damage, and educating the public on the benefits of accepting magic users into the community. The Union is involved in licensing users of arcane magic in several countries, including Zelfir, Kandor, Gerasalim, Eldoran, Dera'Dragorim, Staelia, and Dormania. Licensed wizard's do not need to be members of the Union, but the Union has contracts with governments to obtain special policing powers to police their own.","nations":["Dera'Dragorim","Dormania","Eldoran","Gerasalim","Kandor","Staelia","Zelfir"],"cities":["Zelfin","Mandon","Last Watch","Malidal","Desadorel","Kalland","Strovenguard","Loridesa","Instar","Milan","Estapor"],"rules":["Avoid hurting bystanders with magic or other collateral damage to your activities","Share your knowledge with others","Obey the laws around magic use in whatever country you are in","Enforce the laws around magic use when others break them"],"ranks":[{"index":0,"name":"Apprentice","minDisposition":0,"description":"You have joined a local wizards college as a new apprentice and have been assigned a mentor to learn from. Good luck!"},{"index":1,"name":"Adept","minDisposition":4,"description":"You have proven you are skilled enough to no longer need a mentor."},{"index":2,"name":"Magi","minDisposition":8,"description":"You have been recognized as a skilled mage and teacher."},{"index":3,"name":"High Magi","minDisposition":12,"description":"Your skill and dedication have been recognized by the college, and other Magi now regularly seek out your guidance and advice."}],"features":[{"minrank":0,"name":"Library Access","description":"You have been assigned to a local mage as an apprentice, and given access to the local magical library."},{"minrank":1,"name":"Practiced Spells","description":"Learn a cantrip from the wizard or sorcerer lists. The casting stat for that cantrip depends on the list you chose it from, intelligence for wizard, charisma for sorcerer."},{"minrank":2,"name":"Apprentice","description":"You have been assigned an apprentice who accompanies you and can perform simple tasks for you in return for education. This apprentice is a character who shares a spellcasting class with you, at least 4 levels lower than you are. For example, if you are a 7th level wizard, your apprentice is a wizard with a maximum level of 3."},{"minrank":3,"name":"Knowledge Exchange","description":"The Union shares knowledge with you regularly. Every ten days the union magically sends you a random spell scroll of a level you can cast (maximum 5th level) and on your classes spell list. Additionally you are recognized for your skill by most magi you encounter. Your Library Access feature now extends to any library owned or associated with the Union."}]},{"id":"voidbringers","title":"Voidbringers","description":"The voidbringers are a collection of worshippers of Trolka, Malik, and various unspeakable evils from beyond the edge of existence who are dedicated to returning the world of Elthelas to the void.  The continued existence of the mortal plane is seen as an affrontory to the beauty of pure chaos, and so it must be brought to an end.","nations":[],"cities":[],"rules":["Governments and organized religions represent the natural order.  I must never work for them, and should try to undermine them where possible.","If I have multiple ways I could solve a problem, I should choose the most violent or destructive method"],"ranks":[{"index":0,"name":"Known","minDisposition":1,"description":"Your actions have marked you for consideration by the Voidbringers. They are watching you."},{"index":1,"name":"Initiate","minDisposition":3,"description":"You have been contacted by a Master Voidbringer. Now is your chance to prove yourself."},{"index":2,"name":"Touched","minDisposition":5,"description":"You have been touched by the void."},{"index":3,"name":"Master of Nothing","minDisposition":7,"description":"You have been called to lead a cell of voidbringers. For the Void!"},{"index":4,"name":"Weaver of Chaos","minDisposition":10,"description":"You are the ultimate enemy of order, you will bring the end. They will thank you for it in the end."}],"features":[{"minrank":1,"name":"Blood Sacrifice","description":"You can spend 1 hour performing unholy rights and sacrifice a living creature on an altar to your God, gaining a +1 bonus to all d20 rolls you make for the next 24 hours."},{"minrank":2,"name":"Insanity","description":"You have been touched by the eternal void, and your mind will never be the same again.  Your dedication to chaos gives you advantage on saves against charm and fear."},{"minrank":3,"name":"Extraplanar","description":"You are a senior agent of your God, and he speaks to you.  You can cast Contact Outer Plane once per day without using a spell slot so long as you use it to contact Trolka, Malik, or an outer evil whom you revere."},{"minrank":4,"name":"Blood of My Enemies","description":"When you reduce a creature within 5 feet of you to 0 hit points you can declare them a blood sacrifice, per the Blood Sacrifice feature, but without requiring an altar or an hour of rites."}]},{"id":"wildernessguards","title":"Wilderness Guards","description":"The Wilderness Guards are a mercenary group employed primarily by local governments on the borders of the Riftlan Wilds. They specialize in fighting the dangerous monstrosities and extraplanar entities that occasionally drift into the material plane in those areas, protecting local settlements from attack. Similarly they protect the creatures of the natural world from both habitat destruction by civilization, and the appetites of those same extraplanar entities. Rangers of all stripes, druids, oath of the watcher paladins, and many fighters get recruited by the Guards. The guards generally act as individuals or in small squads rather than as an organized military force.","nations":["zelfir","deradragorim"],"cities":["seldan","lastwatch","portsmith"],"rules":["I must protect civilization from the dangers of the frontier.","I must preserve the natural world from the worst exploitations of civilization and the extreme nature of extraplanar entities."],"ranks":[{"index":0,"name":"Recruit","minDisposition":0,"description":"As a new recruit you are assigned to a veteran guard for training."},{"index":1,"name":"Guard","minDisposition":2,"description":"Your wilderness skills are enough to get you some basic recognition from the locals."},{"index":2,"name":"Protector","minDisposition":6,"description":"You have ventured into the wilderness and come back alive and with tales to tell."},{"index":3,"name":"Guard Captain","minDisposition":10,"description":"You've been places no one else has ever been before, and been recognized for the effort."}],"features":[{"minrank":0,"name":"Equipped","description":"The Wilderness Guards are willing to help equip you and provide 100 gp worth of equipment."},{"minrank":1,"name":"Hunter's Mark","description":"Add the spell hunter's mark to your spells known or spellbook.  You gain the ability to cast hunter's mark 1/day as a first level spell without expending a spell slot."},{"minrank":2,"name":"Selfless Protector","description":"Your experience has taught you ways to protect others in battle. You gain the Protection fighting style. If you already have that fighting style choose another fighting style that you do not already have."},{"minrank":3,"name":"Resistant","description":"You gain resistance to one damage type of your choice from this list: Fire, Cold, Lightning, Poison, Acid"}]}]}