{
  "name": "Cloistered Scholar",
  "description": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Elthelas's great institutes of learning, where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home-not to abandon it, but to quest for new lore to add to its storehouse of knowledge.",
  "skills": [
    "History",
    "Choose one from among Arcana, Nature, and Religion"
  ],
  "tools": [],
  "languages": 2,
  "equipment": "The scholar's robes of your cloister, a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife), a borrowed book on the subject of your current study, and a pouch containing 10 gp",
  "feature": {
    "name": "Library Access",
    "description": "Though others must often endure extensive interviews and significant fees to gain access to even the most common archives in your library, you have free and easy access to the majority of the library, though it might also have repositories of lore that are too valuable, magical, or secret to permit anyone immediate access.\n\nYou have a working knowledge of your cloister's personnel and bureaucracy, and you know how to navigate those connections with some ease.\n\nAdditionally, you are likely to gain preferential treatment at other libraries across the Realms, as professional courtesy shown to a fellow scholar."
  },
  "characteristics": "Use the tables for the sage background in the Player's Handbook as the basis for your traits and motivations, modifying the entries when appropriate to suit your identity as a cloistered scholar.\n\nYour bond is almost certainly associated either with the place where you grew up or with the knowledge you hope to acquire through adventuring. Your ideal is no doubt related to how you view the quest for knowledge and truth-perhaps as a worthy goal in itself, or maybe as a means to a desirable end."
}