[
  {
    "name": "Actor",
    "prereq": "4th level",
    "description": "Skilled at mimicry and dramatics, you gain the following benefits:\n\n* Increase your Charisma score by 1, to a maximum of 20.\n* You have advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass yourself off as a different person.\n* You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that the effect is faked."
  },
  {
    "name": "Alert",
    "prereq": "",
    "description": "Always on the lookout for danger, you gain the following benefits:\n\n* When you roll initiative, you can add your proficiency bonus to the roll.\n* Immediately after you roll initiative, you can swap your initiative with the initiative of one willing ally in the same combat. You can't make this swap if you or the ally is incapacitated."
  },
  {
    "name": "Armor Adept",
    "prereq": "Proficiency with light armor, 4th level",
    "description": "You have practiced moving in armor to gain the following benefits:\n\n* Wearing armor doesn’t impose disadvantage on your Dexterity (Stealth) checks.\n* When you wear armor, the AC for that armor increases by 2."
  },
  {
    "name": "Armored Bulwark",
    "prereq": "Proficiency with heavy armor, 4th level",
    "description": "You can use your armor to deflect strikes that would kill others. You gain the following benefits:\n\n* Increase your Strength or Constitution score by 1, to a maximum of 20.\n* While you are wearing heavy armor, increase the Protection Points per level of that armor by 2."
  },
  {
    "name": "Artificer Initiate",
    "prereq": "4th level",
    "description": "You've learned some of an artificer's inventiveness:\n\n* Increase your intelligence score by 1, to a maximum of 20.\n* You learn one cantrip of your choice from the artificer spell list, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells.\n* You can cast this feat's 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.\n* You gain proficiency with one type of artisan's tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability."
  },
  {
    "name": "Athlete",
    "prereq": "4th level",
    "description": "You have undergone extensive physical training to gain the following benefits:\n\n* Increase your Strength, Dexterity, or Constitution score by 1, to a maximum of 20.\n* You gain a climb speed equal to your speed.\n* When you are prone, you can right yourself with only 1m of movement.\n* You have advantage on any ability check you make for the jump action."
  },
  {
    "name": "Charger",
    "prereq": "4th level",
    "description": "You have trained to charge headlong into battle, gaining the following benefits:\n\n* Increase your Strength or Dexterity score by 1, to a maximum of 20.\n* When you take the Dash Action, your Speed increases by 3m for that action.\n* If you move at least 3m in a straight line immediately before hitting with an attack as part of the attack action on your turn, choose one of the following effects: gain a +1d8 bonus to the attack's damage roll, or push the target up to 3m, provided the target you want to push is no more than one Size larger than you. You can use this benefit only once on each of your turns."
  },
  {
    "name": "Chef",
    "prereq": "4th level",
    "description": "Time spent mastering the culinary arts has paid off, granting you the following benefits:\n\n* Increase your Constitution or Wisdom score by 1, to a maximum of 20.\n* You gain proficiency with the cook's utensils if you don't already have it.\n* As part of a short rest, you can cook special food, provided you have ingredients and cook's utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra 1d8 hit points.\n* With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your proficiency bonus."
  },
  {
    "name": "Crafter",
    "prereq": "",
    "description": "Having honed your talents at crafting, you gain the following benefits:\n\n* You gain proficiency with three types of artisan's tools of your choice.\n* Whenever you buy a nonmagical item, you receive a 20 percent discount on it.\n* When you craft an item using a tool with which you are proficient, the required crafting time is reduced by 20 percent."
  },
  {
    "name": "Crossbow Expert",
    "prereq": "4th level",
    "description": "Thanks to extensive practice with the crossbow, you gain the following benefits:\n\n* Increase your Dexterity score by 1, to a maximum of 20.\n* You ignore the loading quality of crossbows with which you are proficient.\n* Being within reach of a hostile creature doesn’t impose disadvantage on attack rolls with crossbows.\n* When you use Two-Weapon fighting, you can add your Ability Modifier to the damage of the extra attack so long as you make that attack with a crossbow."
  },
  {
    "name": "Crusher",
    "prereq": "4th level",
    "description": "You are practiced in the art of crushing your enemies, granting you the following benefits:\n\n* Increase your Strength or Constitution by 1, to a maximum of 20.\n* Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 1m to an unoccupied space, provided the target is no more than one size larger than you.\n* When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn."
  },
  {
    "name": "Defensive Duelist",
    "prereq": "Dexterity 13 or higher, 4th level",
    "description": "You've learned to deftly parry attacks, granting you the following benefits:\n\n* Increase your dexterity score by 1, to a maximum of 20.\n*When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you."
  },
  {
    "name": "Dual Wielder",
    "prereq": "4th level",
    "description": "You master fighting with two weapons, gaining the following benefits:\n\n* Increase your strength or dexterity score by 1, to a maximum of 20.\n* You can use two-weapon fighting even when the one-handed melee weapon you are wielding in your main hand isn’t light.\n* You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one."
  },
  {
    "name": "Dual Flurry",
    "prereq": "8th level, Dual Wielder feat",
    "description": "You have become exceptionally quick at attacking with two weapons. You gain the following:\n\n* +1 to strength or dexterity.\n* On any turn where you use the attack action while wielding a separate melee weapon in each hand and make an extra attack with your off-hand weapon, if you hit with at least 2 attacks you can make another attack with the off-hand weapon as part of the same action."
  },
  {
    "name": "Dungeon Delver",
    "prereq": "",
    "description": "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:\n\n* You have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.\n* You have advantage on saving throws made to avoid or resist traps.\n* You have resistance to the damage dealt by traps.\n* Traveling at a fast pace doesn’t impose the normal −5 penalty on your passive Wisdom (Perception) score."
  },
  {
    "name": "Durable",
    "prereq": "4th level",
    "description": "Hardy and resilient, you gain the following benefits:\n\n*Increase your Constitution score by 1, to a maximum of 20.\n* You have advantage on Death Saving Throws.\n* As a bonus action, you can expend on of your hit dice, roll the die, and regain a number of hit points equal to the roll."
  },
  {
    "name": "Eldritch Adept",
    "prereq": "Spellcasting or Pact Magic feature, 4th level",
    "description": "Studying occult lore, you have unlocked eldritch power within yourself: \n* Increase your charisma by 1, to a maximum of 20.\n* You learn one Eldritch Invocation option of your choice from the warlock class. If the invocation has a prerequisite of any kind, you can choose that invocation only if you're a warlock who meets the prerequisite.Whenever you gain a level, you can replace the invocation with another one from the warlock class."
  },
  {
    "name": "Elemental Adept",
    "prereq": "The ability to cast at least one spell, 4th level",
    "description": "In your spellcasting, you can harness a particular form of energy with deadly mastery, granting you the following benefits:\n\n* Increase your intelligence, wisdom, or charisma score by 1, to a maximum of 20.\n* Choose one of the following damage types: acid, cold, fire, lightning, or thunder. Spells you cast ignore resistance to the damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2."
  },
  {
    "name": "Fey Touched",
    "prereq": "4th level",
    "description": "Your exposure to the Feywild's magic has changed you, granting you the following benefits:\n\n* Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n* You learn the misty step spell and one 1st-level spell of your choice. The 1st-level spell must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat."
  },
  {
    "name": "Fighting Initiate",
    "prereq": "Proficiency with a martial weapon, 4th level",
    "description": "Your martial training has helped you develop a particular style of fighting. \n\n* Increase your strength or dexterity score by 1, to a maximum of 20.\n* You learn one Fighting Style option of your choice from the fighter class. If you already have a style, the one you choose must be different.\n\nWhenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat's fighting style with another one from the fighter class that you don't have."
  },
  {
    "name": "Grappler",
    "prereq": "Strength 13 or higher, 4th level",
    "description": "You're an accomplished wrestler, granting you the following benefits:\n\n* Increase your strength or dexterity score by 1, to a maximum of 20.\n* You have advantage on attack rolls against a creature grappled by you.\n* You aren't slowed when you move a creature grappled by you, provided the creature is your size or smaller.\n* When you hit a creature with an unarmed strike as part of the attack action on your turn, you can deal damage to the target and also grapple it. You can use this benefit only once per turn."
  },
  {
    "name": "Great Weapon Master",
    "prereq": "4th level",
    "description": "You’ve learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\n\n* Increase your strength score by 1, to a maximum of 20.\n* On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.\n* When you hit a creature with a heavy weapon as part of the attack action on your turn, you can cause the weapon to deal extra damage to the target equal to your proficiency bonus.\n* You no longer suffer disadvantage for wielding a heavy weapon as a small character."
  },
  {
    "name": "Oversized Weapon Master",
    "prereq": "8th level, Great Weapon Master feat, STR 15",
    "description": "You've further enhanced your ability to use extra large weapons, giving you the following benefits:\n\n* Increase your strength score by 1, to a maximum of 20.\n* You can wield weapons meant for a large creature without disadvantage. These weapons generally do an extra die of the damage compared to those made for a small or medium creature.\n* When you make an attack with the bonus action as specified in the Great Weapon Master feat, you can make 2 additional attacks instead of one."
  },
  {
    "name": "Gunner",
    "prereq": "4th level",
    "description": "You have a quick hand and keen eye when employing firearms, granting you the following benefits:\n\n* Increase your Dexterity score by 1, to a maximum of 20.\n* You gain proficiency with firearms.\n* You ignore the loading property of firearms.\n* Being within reach of a hostile creature doesn't impose disadvantage on your ranged attack rolls with firearms.\n* When you use Two-Weapon fighting, you can add your Ability Modifier to the damage of the extra attack so long as you make that attack with a firearm."
  },
  {
    "name": "Healer",
    "prereq": "",
    "description": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:\n* If you have a healer's kit, you can expend one use of it and tend to a creature within 1m of you as an action. That creature can expend one of its Hit Dice, and you then roll that die. The creature regains a number of Hit Points equal to the roll plus your Proficiency Bonus.\n* Whenever you roll a die to determine the number of hit points you restore with a spell or ability, including the feature provided by this feat, you can reroll the die if it rolls a 1, and you must use the new roll."
  },
  {
    "name": "Heavily Armored",
    "prereq": "Proficiency with medium armor, 4th level",
    "description": "You have trained to master the use of heavy armor, gaining the following benefits:\n\n* Increase your Constitution or Strength score by 1, to a maximum of 20.\n* You gain proficiency with heavy armor."
  },
  {
    "name": "Inspiring Leader",
    "prereq": "Wisdom or Charisma 13 or higher, 4th level",
    "description": "You are adept at encouraging others, granting you the following benefits:\n\n* Increase your wisdom or charisma score by 1, to a maximum of 20.\n* At the end of a short or long rest you can give an inspiring performance: a speech, a song, or a dance. When you do so, choose up to six friendly creatures (which can include yourself) within 9m of you who witness the performance. The chosen creatures each gain temporary hit points equal to 2d4 + your proficiency bonus."
  },
  {
    "name": "Keen Mind",
    "prereq": "4th level",
    "description": "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits.\n* Increase your Intelligence score by 1, to a maximum of 20.\n* Choose two of the following skills: Arcana, History, Investigation, Nature, or Religion. If you lack proficiency in the chosen skill, you gain proficiency in it, and if you have proficiency in it, you gain expertise in it."
  },
  {
    "name": "Lightly Armored",
    "prereq": "",
    "description": "You have trained to master the use of armor, gaining the following benefits:\n\n* You gain proficiency with light armor, medium armor, and shields."
  },
  {
    "name": "Linguist",
    "prereq": "4th level",
    "description": "You have studied languages and codes, gaining the following benefits:\n* Increase your Intelligence score by 1, to a maximum of 20.\n* You learn three languages of your choice.\n* You can ably create written ciphers. Others can’t decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it."
  },
  {
    "name": "Lucky",
    "prereq": "",
    "description": "You have inexplicable luck that seems to kick in at just the right moment.\n\nYou have a number of Luck Points equal to your proficiency bonus. You can spend the points on the benefits below, and you regain your expended Luck Points when you finish a long rest.\n* Immediately after you roll a d20 for an attack roll, ability check, or saving throw, you can spend 1 Luck Point to give yourself advantage on the roll.\n* When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose disadvantage on that roll."
  },
  {
    "name": "Mage Slayer",
    "prereq": "4th level",
    "description": "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:\n\nIncrease your strength or dexterity score by 1, to a maximum of 20.\n* When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.\n* If you fail an intelligence, wisdom, or charisma saving throw, you can cause yourself to succeed instead. Once you use this benefit, you can't use it again until you finish a long rest."
  },
  {
    "name": "Magic Initiate",
    "prereq": "",
    "description": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class’s spell list.\n\nIn addition, choose one 1st-level spell to learn from that same list. Using this feat, you can cast the spell once at its lowest level, and you must finish a long rest before you can cast it in this way again. You can also cast this spell with any spell slots you have.\nYour spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid: or Intelligence for wizard."
  },
  {
    "name": "Martial Adept",
    "prereq": "4th level",
    "description": "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:\n\n* You learn two maneuvers of your choice from among those available to the Battle Master archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver’s effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n* You gain two superiority dice, which are d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest."
  },
  {
    "name": "Musician",
    "prereq": "",
    "description": "You are a practiced musician, granting you the following benefits.\n\n* You gain proficiency with three musical instruments of your choice.\n* As you finish a short or long rest, you can play a song on a musical instrument with which you have proficiency and give inspiration to allies who hear the song. The number of allies you can affect in this way equals your proficiency bonus."
  },
  {
    "name": "Metamagic Adept",
    "prereq": "Spellcasting or Pact Magic feature, 4th level",
    "description": "You've learned how to exert your will on your spells to alter how they function:\n\n* Add 1 to your Charisma score, to a maximum of 20.\n* You learn one Metamagic option of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace this Metamagic option with another one from the sorcerer class.\n\n* You gain 4 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source). You regain all spent sorcery points when you finish a long rest."
  },
  {
    "name": "Mobile",
    "prereq": "4th level",
    "description": "You are exceptionally speedy and agile. You gain the following benefits:\n\n* Your speed increases by 3m.\n* When you use the Dash action, difficult terrain doesn’t cost you extra movement on that turn.\n* When you make a melee attack against a creature, you don’t provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not."
  },
  {
    "name": "Mounted Combatant",
    "prereq": "4th level",
    "description": "You are a dangerous foe to face while mounted. You gain the following benefits:\n\n* Increase your strength, dexterity, or wisdom score by 1, to a maximum of 20.\n* You have advantage on Animal Handling checks made to handle or train horses and other beasts employed as mounts.\n* While mounted, you have advantage on attack rolls against any creature that is within reach of your mount and at least one size smaller than it.\n* If you mount is subjected to an effect that allows it to make a dexterity saving throw or take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails. For your mount to gain this benefit, you must be riding it, and neither of you can be incapacitated.\n* While mounted, you can use your reaction to force an attack that hits your mount to hit you instead."
  },
  {
    "name": "Observant",
    "prereq": "Intelligence or Wisdom of 13 or higher, 4th level",
    "description": "Quick to notice details of your environment, you gain the following benefits:\n\n* Increase your Intelligence or Wisdom score by 1, to a maximum of 20.\n* Choose two of the following skills: Insight, Investigation, or Perception. If you lack proficiency with the chosen skill, you gain proficiency in it, and if you have proficiency in it you gain expertise instead."
  },
  {
    "name": "Piercer",
    "prereq": "4th level",
    "description": "You have achieved a penetrating precision in combat, granting you the following benefits:\n\n* Increase your Strength or Dexterity by 1, to a maximum of 20.\n* Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.\n* When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes."
  },
  {
    "name": "Poisoner",
    "prereq": "4th level",
    "description": "You can prepare and deliver deadly poisons, granting you the following benefits.\n\n* When you make a damage roll that deals poison damage, it ignores resistance to poison damage.\n* You can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.\n* You gain proficiency with the poisoner's kit if you don't already have it. With one hour of work using a poisoner's kit and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take 2d8 poison damage and become poisoned until the end of your next turn."
  },
  {
    "name": "Polearm Master",
    "prereq": "4th level",
    "description": "You can keep your enemies at bay with reach weapons. You gain the following benefits:\n\n* Increase your strength score by 1, to a maximum of 20.\n* When you take the Attack action and attack with only a weapon that has the polearm property you can use a bonus action to make a melee attack with the opposite end of the weapon. The weapon’s damage die for this attack is a d4, and the attack deals bludgeoning damage.\n* While you are wielding a weapon that has the polearm property other creatures provoke an opportunity attack from you when they enter your reach."
  },
  {
    "name": "Readied Fighter",
    "prereq": "4th level",
    "description": "* Increase your Strength or Dexterity by 1, to a maximum of 20.\n* While you are wielding a melee weapon, other creatures provoke an opportunity attack from you when they enter your reach."
  },
  {
    "name": "Resilient",
    "prereq": "4th level",
    "description": "Choose one ability score. You gain the following benefits:\n* Increase the chosen ability score by 1, to a maximum of 20.\n* You gain proficiency in saving throws using the chosen ability."
  },
  {
    "name": "Ritual Caster",
    "prereq": "Intelligence or Wisdom 13 or higher, 4th level",
    "description": "You have studied ritual magic, granting you the following benefits:\n\n* Increase your intelligence, wisdom, or charisma score by 1, to a maximum of 20.\n* Choose two 1st-level spells that have the ritual tag from any spell list. You always have those two spells prepared, and you can cast them as rituals as well as with any spell slots you have. The spells spellcasting ability is the ability increased by this feat.\n* You can cast a ritual spell that you have prepared using its regular casting time, rather than the extended casting time for a ritual. Doing so doesn't require a spell slot, but once you cast the spell in this way, you can't do so again until you finish a long rest."
  },
  {
    "name": "Savage Attacker",
    "prereq": "",
    "description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon’s damage dice and use either total."
  },
  {
    "name": "Sentinel",
    "prereq": "4th level",
    "description": "You have mastered techniques to take advantage of every drop in any enemy’s guard, gaining the following benefits:\n\n* Increase your strength or dexterity score by 1, to a maximum of 20.\n* Immediately after a creature within your reach takes the disengage action or hits a target other than you with an attack, you can make an opportunity attack against that creature.\n* When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn."
  },
  {
    "name": "Shadow Touched",
    "prereq": "4th level",
    "description": "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:\n\nIncrease your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n\nYou learn the invisibility spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spell's spellcasting ability is the ability increased by this feat."
  },
  {
    "name": "Sharpshooter",
    "prereq": "4th level",
    "description": "You can make shots that others find impossible, granting you the following abilities:\n\n* Increase your dexterity score by 1, to a maximum of 20.\n* Your ranged attacks with weapons ignore half cover and three-quarters cover.\n* Being within reach of an enemy doesn't impose disadvantage on your ranged attack rolls with weapons.\n* Attacking at long range doesn't impose disadvantage on your ranged attack rolls with weapons."
  },
  {
    "name": "Shield Master",
    "prereq": "4th level",
    "description": "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a shield:\n* Increase your Strength or dexterity score by 1, to a maximum of 20.\n* If you take the Attack action on your turn, you can use make an attack with your shield as a bonus action (see Shield (Bash) in weapons). This bonus attack does not count as two-weapon fighting or reduce the bonus to AC provided by your shield.\n* If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect."
  },
  {
    "name": "Shield Expertise",
    "prereq": "8th level, Shield Master feat",
    "description": "You have mastered the use of a shield in combat. You gain the following benefits while you are wielding a shield:\n* Increase your Strength or dexterity score by 1, to a maximum of 20.\n* The bonus to AC of a shield you are wielding is increased by 1."
  },
  {
    "name": "Skill Expert",
    "prereq": "4th level",
    "description": "You have honed your proficiency with particular skills, granting you the following benefits:\n\n* Increase one ability score of your choice by 1, to a maximum of 20.\n* You gain proficiency in one skill of your choice.\n* Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus."
  },
  {
    "name": "Tricky Character",
    "prereq": "4th level",
    "description": "You have mastered certain aspects of your skills, you gain the following benefits:\n\n* Increase one ability score of your choice by 1, to a maximum of 20.\n* You learn two skill tricks (see the rogue feature). You must meet the proficiency requirements of the skill tricks you choose."
  },
  {
    "name": "Skilled",
    "prereq": "",
    "description": "You gain proficiency in any combination of three skills or tools of your choice."
  },
  {
    "name": "Skulker",
    "prereq": "Dexterity 13 or higher, 4th level",
    "description": "You are expert at slinking through shadows. You gain the following benefits:\n* Increase your dexterity score by 1, to a maximum of 20.\n* You have blindsight with a range of 3m.\n* Exploiting the distractions of battle, you have advantage on any stealth check you make as part of the hide action during combat.\n* If you make an attack roll while hidden and the roll misses, making the attack roll doesn't end the hidden condition on you."
  },
  {
    "name": "Slasher",
    "prereq": "4th level",
    "description": "You've learned where to cut to have the greatest results, granting you the following benefits:\n\n* Increase your Strength or Dexterity by 1, to a maximum of 20.\n* Once per turn when you hit a acreature with an attack that deals slashing damage, you can reduce the speed of the target by 3m until the start of your next turn.\n* When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls."
  },
  {
    "name": "Speedster",
    "prereq": "4th level",
    "description": "You possess exceptional speed and stamina, granting you the following benefits:\n\n* Increase your dexterity or constitution score by 1, to a maximum of 20.\n* Your speed increases by 3m while yo uaren't wearing heavy armor.\n* When you take the dash action on your turn, difficult terrain doesn't cost you extra movement for the rest of the turn."
  },
  {
    "name": "Spell Sniper",
    "prereq": "The ability to cast at least one spell, 4th level",
    "description": "You have learned techniques to enhance your attacks with certain kinds o f spells, gaining the following benefits:\n\n* Increase your intelligence, wisdom, or charisma score by 1 to a maximum of 20.\n* Your attack rolls for spells ignore half cover and three-quarters cover.\n* Being within reach of an enemy doesn't impose disadvantage on your attack rolls with spells.\nWhen you cast a spell that has a range of at least 3m that requires you to make an attack roll, you can increase the spells range by 18m."
  },
  {
    "name": "Tavern Brawler",
    "prereq": "",
    "description": "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:\n\n* When you hit with your unarmed strike and deal damage, you can deal bludgeoning damage equal to 1d4 + your Strength modifier, instead of the normal damage of an unarmed strike.\n* Whenever you roll a damage die for your unarmed strike, you can reroll the die if it rolls a 1, and you must use the new roll.\n* When you hit a creature with an unarmed strike as part of the attack action on your turn, you can deal damage to the target and also push it 1m away.\n* You can wield furniture as a weapon with which you are proficient and does 1d8 damage on a hit."
  },
  {
    "name": "Telekinetic",
    "prereq": "4th level",
    "description": "You learn to move things with your mind, granting you the following benefits:\n\n* Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n* You learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 9m when you cast it. Its spellcasting ability is the ability increased by this feat.\n* As a bonus action, you can try to telekinetically shove one creature you can see within 9m of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 1m toward you or away from you. A creature can willingly fail this save."
  },
  {
    "name": "Telepathic",
    "prereq": "4th level",
    "description": "You awaken the ability to mentally connect with others granting you the following benefits:\n\n* Increase your Inteligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n* You can speak telepathically to any creature you can see within 18m of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.\n* You can cast the detect thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them."
  },
  {
    "name": "Tough",
    "prereq": "",
    "description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
  },
  {
    "name": "War Caster",
    "prereq": "The ability to cast at least one spell, 4th level",
    "description": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n\n* Increase your intelligence, wisdom, or charisma score by 1, to a maximum of 20.\n* You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\n* You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\n* When a hostile creature’s movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."
  },
  {
    "name": "Weapon Training",
    "prereq": "4th level",
    "description": "You have practiced extensively with a variety of weapons, gaining the following benefits:\n* Increase your Strength or Dexterity score by 1, to a maximum o f 20.\n* You gain proficiency with martial weapons."
  },
  {
    "name": "Bountiful Luck",
    "prereq": "Halfling, 4th level",
    "description": "Your people have extraordinary luck, which you have learned to mystically lend to your companions when you see them falter. You’re not sure how you do it; you just wish it, and it happens. Surely a sign of fortune’s favor!\n\nWhen an ally you can see within 9m of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.\n\nWhen you use this ability, you can’t use your Lucky racial trait before the end of your next turn."
  },
  {
    "name": "Dragon Fear",
    "prereq": "Dragonborn, 4th level",
    "description": "When angered, you can radiate menace. You gain the following benefits:\n\n* Increase your Strength, Constitution, or Charisma score by 1, to a maximum of 20.\n* Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 9m of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). A target automatically succeeds on the save if it can’t hear or see you.\n\nOn a failed save, a target becomes frightened of you for 1 minute. If the frightened target takes any damage, it can repeat the saving throw, ending the effect on itself on a success."
  },
  {
    "name": "Dragon Hide",
    "prereq": "Dragonborn or Kobold, 4th level",
    "description": "You manifest scales and claws reminiscent of your draconic ancestors. You gain the following benefits:\n\n* Increase your Strength, Constitution, or Charisma score by 1, to a maximum of 20.\n* Your scales harden. While you aren’t wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.\n* You grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike."
  },
  {
    "name": "Dragon Wings",
    "prereq": "Dragonborn or Kobold, 4th level",
    "description": "You grow a pair of scaly wings.\n\n* Increase your strength, dexterity, or constitution score by 1, to a maximum of 20.\n* You gain a fly speed equal to your speed. You cannot use this fly speed while heavily encumbered or wearing heavy armor."
  },
  {
    "name": "Drow High Magic",
    "prereq": "Elf (drow), 4th level",
    "description": "You learn more of the magic typical of dark elves. You learn the detect magic spell and can cast it at will, without expending a spell slot. You also learn levitate and dispel magic, each of which you can cast once without expending a spell slot. You regain the ability to cast those two spells in this way when you finish a long rest. Charisma is your spellcasting ability for all three spells."
  },
  {
    "name": "Dwarven Fortitude",
    "prereq": "Dwarf or Half-Dwarf, 4th level",
    "description": "You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:\n\n* Increase your Constitution score by 1, to a maximum of 20.\n* Whenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1)."
  },
  {
    "name": "Elven Accuracy",
    "prereq": "Elf, Fey'ri, or half-elf, 4th level",
    "description": "The accuracy of elves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:\n\n* Increase your Dexterity, Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n* Whenever you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once."
  },
  {
    "name": "Fade Away",
    "prereq": "Gnome, 4th level",
    "description": "Your people are Clever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:\n\n* Increase your Dexterity or Intelligence score by l, to a maximum of 20.\n* Immediately after you take damage, you can use a reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force someone to make a saving throw. Once you use this ability, you can’t do so again until you finish a short or long rest."
  },
  {
    "name": "Fey Teleportation",
    "prereq": "Elf (high or wild), 4th level",
    "description": "Your study of high elven lore has unlocked fey power that few other elves possess, except your eladrin cousins. Drawing on your fey ancestry, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:\n\n* Increase your Intelligence or Charisma score by 1, to a maximum of 20.\n* You learn to speak, read, and write Sylvan.\n* You learn the misty step spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a short or long rest. Intelligence is your spellcasting ability for this spell."
  },
  {
    "name": "Flames of Phlegethos",
    "prereq": "Tiefling, 4th level",
    "description": "You learn to call on hellfire to serve your commands. You gain the following benefits:\n\n* Increase your Intelligence or Charisma score by 1, to a maximum of 20.\n* When you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.\n* Whenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don’t harm you or your possessions, and they shed bright light out to 9m and dim light for an additional 9m. While the flames are present, any creature within 2m of you that hits you with a melee attack takes 1d4 fire damage."
  },
  {
    "name": "Infernal Constitution",
    "prereq": "Tiefling or Fey'ri, 4th level",
    "description": "Fiendish blood runs strong in you, unlocking a resilience akin to that possessed by some fiends. You gain the following benefits:\n\n* Increase your Constitution score by l, to a maximum of 20.\n* You have resistance to cold damage and poison damage.\n* You have advantage on saving throws against being poisoned."
  },
  {
    "name": "Orcish Fury",
    "prereq": "Orc, 4th level",
    "description": "Your inner fury burns tirelessly. You gain the following benefits:\n\n* Increase your Strength or Constitution score by l, to a maximum of 20.\n* When you hit with an attack using a simple or martial weapon, you can roll one of the weapon’s damage dice an additional time and add it as extra damage of the weapon’s damage type. Once you use this ability, you can’t use it again until you finish a short or long rest.\n* Immediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack."
  },
  {
    "name": "Prodigy",
    "prereq": "Half-elf, half-dwarf, human, 4th level",
    "description": "You have a knack for learning new things. You gain the following benefits:\n\n* Increase one ability score of your choice by 1, to a maximum of 20\n* You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.\n* Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn’t already benefiting from a feature, such as Expertise, that doubles your proficiency bonus."
  },
  {
    "name": "Second Chance",
    "prereq": "Halfling, 4th level",
    "description": "Fortune favors you when someone tries to strike you. You gain the following benefits:\n\n* Increase your Dexterity, Constitution, or Charisma score by 1, to a maximum of 20.\n* When a creature you can see hits you with an attack roll, you can use your reaction to force that creature to reroll. Once you use this ability, you can’t use it again until you roll initiative at the start of combat or until you finish a short or long rest."
  },
  {
    "name": "Squat Nimbleness",
    "prereq": "Dwarf, halfling, kobold, gnome, goblin, faelin, or half-dwarf, 4th level",
    "description": "You are uncommonly nimble for your race. You gain the following benefits:\n\n* Increase your Strength or Dexterity score by l, to a maximum of 20.\n* Increase your walking speed by 2m.\n* You gain proficiency in the Acrobatics or Athletics skill (your choice).\n* You have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled."
  },
  {
    "name": "Wood Elf Magic",
    "prereq": "Elf (wood), 4th level",
    "description": "You learn the magic of the primeval woods, which are revered and protected by your people. You learn one druid cantrip of your choice. You also learn the long strider and pass Without trace spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
  },
  {
    "name": "Child of Fire",
    "prereq": "Child of Molton, 4th level",
    "description": "The fire in your blood has grown in strength, giving you an unrivaled affinity for fire, giving you the following abilities.\n* You learn the create bonfire and firebolt cantrips. Charisma is your casting stat for these cantrips.\n* You are immune to fire damage."
  },
  {
    "name": "Trollkin Regeneration",
    "prereq": "Trollkin, 4th level",
    "description": "Your troll blood gives you the ability to shrug off injuries and heal quickly, even to regenerate limbs over time. \n\n* Increase your strength or constitution score by 1 up to maximum of 20. \n* You gain the ability to regenerate from wounds. As long as you are conscious you regain 1 hit point every minute.\n* If you suffer an injury to your body such as a lost limb, finger, or broken bones, that can be healed with the regenerate spell, you can recover completely from that wound in 1 week without any other intervention."
  }
]