[
 {
   "Item": "Gauntlets of the Immortal Fist",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (monk)",
   "Effect": "These gauntlets increase the hitting power of a monk's attacks.  Whenever you make an attack with an unarmed strike or a monk weapon, your martial arts damage is considered to be higher than it normally would be.  If you normally would do 1d4 damage, you instead do 1d6. 1d6 becomes 1d8, 1d8 becomes 1d10 and 1d10 becomes 1d12."
 },
 {
   "Item": "Improved Gauntlets of the Immortal Fist",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes (monk)",
   "Effect": "These gauntlets increase the hitting power of a monk's attacks.  Whenever you make an attack with an unarmed strike or a monk weapon, your martial arts damage is considered to be higher than it normally would be.  If you normally would do 1d4 damage, you instead do 1d8. 1d6 becomes 1d10, 1d8 becomes 1d12 and 1d10 becomes 2d8."
 },
 {
   "Item": "Superior Gauntlets of the Immortal Fist",
   "Type": "Wondrous Item",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (monk)",
   "Effect": "These gauntlets increase the hitting power of a monk's attacks.  Whenever you make an attack with an unarmed strike or a monk weapon, your martial arts damage is considered to be higher than it normally would be.  If you normally would do 1d4 damage, you instead do 1d10. 1d6 becomes 1d12, 1d8 becomes 2d8 and 1d10 becomes 2d10."
 },
 {
   "Item": "Ever-Burning Fire Solution",
   "Type": "Single Use",
   "Cost (gp)": "300",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Upon being lit on fire, this liquid burns for 1 minute unless dispersed or smothered, dealing 2d6 fire damage to any creature or object in contact with it.  Water cannot extinguish the flames."
 },
 {
   "Item": "Alchemy Jug",
   "Type": "Misc. Equipment",
   "Cost (gp)": "500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This ceramic jug appears to be able to hold a gallon of liquid and weighs 12 pounds whether full or empty. Sloshing sounds can be heard from within the jug when it is shaken, even if the jug is empty.\nYou can use an action and name one liquid from the table below to cause the jug to produce the chosen liquid. Afterward, you can uncork the jug as an action and pour that liquid out, up to 2 gallons per minute. The maximum amount of liquid the jug can produce depends on the liquid you named.\nOnce the jug starts producing a liquid, it can't produce a different one, or more of one that has reached its maximum, until the next dawn.  The jug can produce 8 ounces of acid, 1/2 an ounce of basic poison, 4 gallons of beer, 1 gallon of honey, 2 gallons of mayonnaise, 1 quart of oil, 2 gallons of vinegar, 8 gallons of fresh water, 12 gallons of salt water, or 1 gallon of wine."
 },
 {
   "Item": "+1 Arrows (20 arrows)",
   "Type": "Ammunition",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Attack and damage rolls made with these arrows have a +1 bonus."
 },
 {
   "Item": "+2 Arrows  (20 arrows)",
   "Type": "Ammunition",
   "Cost (gp)": "400",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "Attack and damage rolls made with these arrows have a +2 bonus."
 },
 {
   "Item": "+3 Arrows  (20 arrows)",
   "Type": "Ammunition",
   "Cost (gp)": "800",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "Attack and damage rolls made with these arrows have a +3 bonus."
 },
 {
   "Item": "Amulet of Health",
   "Type": "Misc. Equipment",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "Your Constitution score is 19 while you wear this amulet. It has no effect on you if your Constitution is already 19 or higher."
 },
 {
   "Item": "Amulet of Proof against Detection and Location",
   "Type": "Misc. Equipment",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this amulet, you are hidden from divination magic. You can't be targeted by such magic or perceived through magical scrying sensors."
 },
 {
   "Item": "Amulet of the Planes",
   "Type": "Misc. Equipment",
   "Cost (gp)": "12000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this amulet, you can use an action to name a location that you are familiar with on another plane of existence. Then make a DC 15 Intelligence check. On a successful check, you cast the plane shift spell. On a failure, you and each creature and object within 15 feet of you travel to a random destination. Roll a dlOO. On a 1- 60, you travel to a random location on the plane you named. On a 61- 100, you travel to a randomly determined plane of existence."
 },
 {
   "Item": "Animated Shield",
   "AC": 2,
   "Weight": 6,
   "Type": "Shield",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While holding this shield, you can speak its command word as a bonus action to cause it to animate. The shield leaps into the air and hovers in your space to protect you as if you were wielding it, leaving your hands free. The shield remains animated for 1 minute, until you use a bonus action to end this effect, or until you are incapacitated or die, at which point the shield falls to the ground or into your hand if you have one free."
 },
 {
   "Item": "Arrow-Catching Shield",
   "AC": 2,
   "Weight": 6,
   "Type": "Shield",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "You gain a +2 bonus to AC against ranged attacks while you wield this shield. This bonus is in addition to the shield's normal bonus to AC. In addition, whenever an attacker makes a ranged attack against a target within 5 feet of you, you can use your reaction to become the target of the attack instead."
 },
 {
   "Item": "Arrow of Slaying (20 arrows)",
   "Type": "Ammunition",
   "Cost (gp)": "6000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "An arrow of slaying is a magic weapon meant to slay a particular kind of creature. Some are more focused than others; for example, there are both arrows of dragon slaying and arrows of blue dragon slaying. If a creature belonging to the type, race, or group associated with an arrow of slaying takes damage from the arrow, the creature must make a DC 17 Constitution saving throw, taking an extra 6d10 piercing damage on a failed save, or half as much extra damage on a successful one.\nOnce an arrow of slaying deals its extra damage to a creature, it becomes a nonmagical arrow. Other types of magic ammunition of this kind exist, such as bolts of slaying meant for a crossbow, though arrows are most common."
 },
 {
   "Item": "Bag of Holding",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Container": true,
   "Capacity": 500,
   "weightCounts": false,
   "Weight": 15,
   "Attunement": "No",
   "Effect": "This bag has an interior space considerably larger than its outside dimensions, roughly 2 feet in diameter at the mouth and 4 feet deep. The bag can hold up to 500 pounds, not exceeding a volume of 64 cubic feet. The bag weighs 15 pounds, regardless of its contents. Retrieving an item from the bag requires an action. If the bag is overloaded, pierced, or torn, it ruptures and is destroyed, and its contents are scattered in the Astral Plane. If the bag is turned inside out, its contents spill forth, unharmed, but the bag must be put right before it can be used again. Breathing creatures inside the bag can survive up to a number of minutes equal to 10 divided by the number of creatures (minimum 1 minute), after which time they begin to suffocate.\nPlacing a bag of holding inside an extradimensional space created by a Heward's handy haversack, portable hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it to a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened."
 },
 {
   "Item": "Bag of Tricks",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This ordinary bag, made from gray, rust, or tan cloth, appears empty. Reaching inside the bag, however, reveals the presence of a small, fuzzy object. The bag weighs 1/2 pound.\nYou can use an action to pull the fuzzy object from the bag and throw it up to 20 feet. When the object lands, it transforms into a creature you determine by rolling a d8 and consulting the table that corresponds to the bag's color. See the Monster Manual for the creature's statistics.\n The creature is friendly to you and your companions, and it acts on your turn. You can use a bonus action to command how the creature moves and what action it takes on its next turn, or to give it general orders, such as to attack your enemies. In the absence of such orders, the creature acts in a fashion appropriate to its nature. \nOnce three fuzzy objects have been pulled from the bag, the bag can't be used again until the next dawn."
 },
 {
   "Item": "Bead of Force (1 bead)",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This small black sphere measures 3/4 of an inch in diameter and weighs an ounce. Typically, 1d4 + 4 beads of force are found together. \nYou can use an action to throw the bead up to 60 feet. The bead explodes on impact and is destroyed. Each creature within a 10-foot radius of where the bead landed must succeed on a DC 15 Dexterity saving throw or take 5d4 force damage. A sphere of transparent force then encloses the area for 1 minute. Any creature that failed the save and is completely within the area is trapped inside this sphere. Creatures that succeeded on the save, or are partially within the area, are pushed away from the center of the sphere until they are no longer inside it. Only breathable air can pass through the sphere's wall. No attack or other effect can.\n An enclosed creature can use its action to push against the sphere's wall, moving the sphere up to half the creature's walking speed. The sphere can be picked up, and its magic causes it to weigh only 1 pound, regardless of the weight of creatures inside."
 },
 {
  "Item": "Bead of Nourishment (1 bead)",
   "Type": "Single Use",
   "Cost (gp)": "10",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This spongy, flavorless, gelatinous bead dissolves on your tongue and provides as much nourishment as 1 day of rations."
 },
 {
  "Item": "Bead of Refreshment (1 bead)",
   "Type": "Single Use",
   "Cost (gp)": "5",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This spongy, flavorless, gelatinous bead dissolves in liquid, transforming up to a pint of the liquid into fresh, cold drinking water. The head has no effect on magical liquids or harmful substances such as poison."  
 },
 {
  "Item": "Boots of False Tracks",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "Only humanoids can wear these boots. While wearing the boots, you can choose to have them leave tracks like those of another kind of humanoid of your size."  
 },
 {
  "Item": "Candle of the Deep",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "The flame of this candle is not extinguished when immersed in water. It gives off light and heat like a normal candle."  
 },
 {
  "Item": "Charlatan's Die",
   "Type": "Wondrous Item",
   "Cost (gp)": "250",
   "Rarity": "Common",
   "Attunement": "Yes",
   "Effect": "Whenever you roll this six—sided die, you can control which number it rolls."  
 },
 {
  "Item": "Cloak of Billowing",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While wearing this cloak, you can use a bonus action to make it billow dramatically."  
 },
 {
  "Item": "Cloak of Many Fashions",
   "Type": "Wondrous Item",
   "Cost (gp)": "250",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While wearing this cloak, you can use a bonus action to change the style, color, and apparent quality of the garment. The cloak’s weight doesn’t change. Regardless of its appearance, the cloak can’t be anything but a cloak. Although it can duplicate the appearance of other magic cloaks, it doesn’t gain their magical properties."    
 },
 {
  "Item": "Clockwork Amulet",
   "Type": "Wondrous Item",
   "Cost (gp)": "250",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This copper amulet contains tiny interlocking gears and is powered by magic from Mechanus, a plane of clockwork predictability. A creature that puts an ear to the amulet can hear faint ticking and whirring noises coming from within.\n\nWhen you make an attack roll while wearing the amulet, you can forgo rolling the d20 to get a 10 on the die. Once used. this property can’t be used again until the next dawn."  
 },
 {
  "Item": "Clothes of Mending",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This elegant outfit of traveler’s clothes magically mends itself to counteract daily wear and tear. Pieces of the outfit that are destroyed can’t be repaired in this way."  
 },
 {
  "Item": "Dark Shard Amulet",
   "Type": "Wondrous Item",
   "Cost (gp)": "200",
   "Rarity": "Common",
   "Attunement": "Yes (warlock)",
   "Effect": "This amulet is fashioned from a single shard of resilient extraplanar material originating from the realm of your warlock patron. While you are wearing it, you gain the following benefits:\n\n*You can use the amulet as a spellcasting focus for your warlock spells.\n*You can try to cast a cantrip that you don’t know. The cantrip must be on the warlock spell list, and you must make a DC 10 Intelligence (Arcana) check. If the check succeeds, you cast the spell. If the check fails, so does the spell, and the action used to cast the spell is wasted. In either case, you can’t use this property again until you finish a long rest."  
 },
 {
  "Item": "Dread Helm",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This fearsome steel helm makes your eyes glow red while you wear it."
 },
 {
  "Item": "Ear Horn of Hearing",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While held up to your ear, this horn suppresses the effects of the deafened condition on you, allowing you to hear normally."
 },
 {
  "Item": "Enduring Spellbook",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This spellbook, along with anything written on its pages, can’t be damaged by fire or immersion in water. In addition, the spellbook doesn't deteriorate with age."
 },
 {
  "Item": "Ersatz Eye",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "Yes",
   "Effect": "This artificial eye replaces a real one that was lost or removed. While the ersata eye is embedded in your eye socket, it can’t be removed by anyone other than you, and you can see through the tiny orb as though it were a normal eye."
 },
 {
  "Item": "Hat of Vermin",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This hat has 3 charges. While holding the hat, you can use an action to expend 1 of its charges and speak a command word that summons your choice ofa hat, a frog, or a rat (see the Player’s Handbook or the Monster Manual for statistics). The summoned creature magically appears in the hat and tries to get away from you as quickly as possible. The creature is neither friendly nor hostile, and it isn’t under your control. It behaves as an ordinary creature of its kind and disappears after 1 hour or when it drops to 0 hit points. The hat regains all expended charges daily at dawn."
 },
 {
  "Item": "Hat of Wizardry",
   "Type": "Wondrous Item",
   "Cost (gp)": "200",
   "Rarity": "Common",
   "Attunement": "Yes (wizard)",
   "Effect": "This antiquated, cone—shaped hat is adorned with gold crescent moons and stars. While you are wearing it, you gain the following benefits:\n\n*You can use the hat as a spellcasting focus for your wizard spells.\n*You can try to cast a cantrip that you don’t know. The cantrip must be on the wizard spell list, and you must make a DC 10 Intelligence (Arcana) check. If the check succeeds, you cast the spell. If the check fails, so does the spell, and the action used to cast the spell is wasted. In either case, you can’t use this property again until you finish a long rest."  
 },
 {
  "Item": "Heward's Handy Spice Pouch",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This belt pouch appears empty and has 10 charges. While holding the pouch, you can use an action to expend l of its charges, speak the name of any nonmagical food seasoning (such as salt, pepper, saffron, or cilantro), and remove a pinch of the desired seasoning from the pouch. A pinch is enough to season a single meal. The pouch regains 1d6 + 4 expended charges daily at dawn."  
 },
 {
  "Item": "Horn of Silent Alarm",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This horn has 4 charges. When you use an action to blow it, one creature of your choice can hear the horns blare, provided the creature is within 600 feet of the horn and not deafened. No other creature hears sound coming from the horn. The horn regains ld4 expended charges daily at dawn."
 },
 {
  "Item": "Instrument of Illusions",
   "Type": "Wondrous Item",
   "Cost (gp)": "200",
   "Rarity": "Common",
   "Attunement": "Yes",
   "Effect": "While you are playing this musical instrument, you can create harmless, illusory visual effects within a 5—foot—radius sphere centered on the instrument. If you are a bard, the radius increases to 15 feet. Sample Visual effects include luminous musical notes, a spectral dancer, butterflies, and gently falling snow. The magical effects have neither substance nor sound, and they are obviously illusory. The effects end when you stop playing."
 },
 {
  "Item": "Instrument of Scribing",
   "Type": "Wondrous Item",
   "Cost (gp)": "200",
   "Rarity": "Common",
   "Attunement": "Yes",
   "Effect": "This musical instrument has 3 charges. While you are playing it, you can use an action to expend 1 charge from the instrument and write a magical message on a nonmagical object or surface that you can see within 30 feet of you. The message can be up to six words long and is written in a language you know. If you are a bard, you can scribe an additional seven words and choose to make the message glow faintly, allowing it to be seen in nonmagical darkness. Casting dispel magic on the message erases it. Otherwise, the message fades away after 24 hours.\n\nThe instrument regains all expended charges daily at dawn."
 },
 {
  "Item": "Lock of Trickery",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This lock appears to be an ordinary lock (of the type described in chapter 5 of the Player’s Handbook) and comes with a single key. The tumblers in this lock magically adjust to thwart burglars. Dexterity checks made to pick the lock have disadvantage."
 },
 {
  "Item": "Mystery Key",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "A question mark is worked into the head of this key. The key has a 5 percent chance of unlocking any lock into which it’s inserted. Once it unlocks something, the key disappears."
 },
 {
  "Item": "Orb of Direction",
   "Type": "Wondrous Item",
   "Cost (gp)": "150",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While holding this orb, you can use an action to determine which way is north. This property functions only on the Material Plane."
 },
 {
  "Item": "Orb of Time",
   "Type": "Wondrous Item",
   "Cost (gp)": "150",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While holding this orb, you can use an action to determine whether it is morning, afternoon, evening, or nighttime outside. This property functions only on the Material Plane."
 },
 {
  "Item": "Perfume of Bewitching",
   "Type": "Single Use",
   "Cost (gp)": "30",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This tiny vial contains magic perfume, enough for one use. You can use an action to apply the perfume to yourself, and its effect lasts 1 hour. For the duration, you have advantage on all Charisma checks directed at humanoids of challenge rating 1 or lower. Those subjected to the perfume’s effect are not aware that they’ve been influenced by magic."
 },
 {
  "Item": "Pipe of Smoke Monsters",
   "Type": "Wondrous Item",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While smoking this pipe, you can use an action to exhale a puff of smoke that takes the form of a single creature, such as a dragon, a flumph, or a froghemoth. The form must be small enough to fit in a 1-foot cube and loses its shape after a few seconds, becoming an ordinary puff of smoke."
 },
 {
  "Item": "Pole of Angling",
   "Type": "Wondrous Item",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While holding this 10—foot pole, you can speak a command word and transform it into a fishing pole with a hook, a line, and a reel. Speaking the command word again changes the fishing pole back into a normal 10—foot pole."
 },
 {
  "Item": "Pole of Collapsing",
   "Type": "Wondrous Item",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "While holding this 10—foot pole, you can use an action to speak a command word and cause it to collapse into a l-foot-long rod, for ease of storage. The poles weight doesn’t change. You can use an action to speak a different command word and cause the rod to revert to a pole; however, the rod will elongate only as far as the surrounding space allows."
 },
 {
  "Item": "Pot of Awakening",
   "Type": "Single Use",
   "Cost (gp)": "150",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "If you plant an ordinary shrub in this lO-pound clay pot and let it grow for 30 days, the shrub magically transforms into an awakened shrub (see the Monster Manual for statistics) at the end of that time. When the shrub awakens, its roots break the pot, destroying it.\n\nThe awakened shrub is friendly toward you. Absent commands from you, it does nothing."
 },
 {
  "Item": "Rope of Mending",
   "Type": "Wondrous Item",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "You can cut this 50-foot coil of hempen rope into any number of smaller pieces, and then use an action to speak a command word and cause the pieces to knit back together. The pieces must be in contact with each other and not otherwise in use. A rope ofmending is forever shortened if a section of it is lost or destroyed."
 },
 {
  "Item": "Ruby of the War Mage",
   "Type": "Wondrous Item",
   "Cost (gp)": "175",
   "Rarity": "Common",
   "Attunement": "Yes (spellcaster)",
   "Effect": "Etched with eldritch runes, this l—inch-diameter ruby allows you to use a simple or martial weapon as a spellcasting focus for your spells. For this property to work, you must attach the ruby to the weapon by pressing the ruby against it for at least 10 minutes. Thereafter, the ruby can’t be removed unless you detach it as an action or the weapon is destroyed. Not even an antimagic fieid causes it to fall off. The ruby does fall off the weapon if your attunement to the ruby ends."
 },
 {
  "Item": "Shield of Expression",
  "AC": 2,
  "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "The front of this shield is shaped in the likeness of a face. While bearing the shield, you can use a bonus action to alter the faces expression."
 },
 {
  "Item": "Staff of Adornment",
   "Type": "Staff",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "If you place an object weighing no more than 1 pound (such as a shard of crystal, an egg, or a stone) above the tip of the staff while holding it, the object floats an inch from the staff’s tip and remains there until it is removed or until the staff is no longer in your possession. The staff can have up to three such objects floating over its tip at any given time. While holding the staff, you can make one or more of the objects slowly spin or turn in place."
 },
 {
  "Item": "Staff of Birdcalls",
   "Type": "Staff",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wooden staff is decorated with bird carvings. It has 10 charges. While holding it, you can use an action to expend 1 charge from the staff and cause it to create one of the following sounds out to a range of 60 feet: a finch’' chirp, a raven's caw, a duck’s quack, a chicken’s cluck, a goose's book, a loon's call, a turkey's gobble, a seagull's cry, an owl’s hoot, or an eagle’s shriek.\n\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff explodes in a harmless cloud of bird feathers and is lost forever."
 },
 {
  "Item": "Staff of Flowers",
   "Type": "Staff",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wooden staff has 10 charges. While holding it, you can use an action to expend 1 charge from the staff and cause a flower to sprout from a patch of earth or soil within 5 feet of you, or from the staff itself. Unless you choose a specific kind of flower, the staff creates a mild-scented daisy. The flower is harmless and nonmagical, and it grows or withers as a normal flower would.\n\nThe staff regains 1d6 + 4 expended charges daily at dawn. Ifyou expend the last charge, roll a d20. On a 1, the staff turns into flower petals and is lost forever."
 },
 {
  "Item": "Talking Doll",
   "Type": "Wondrous Item",
   "Cost (gp)": "75",
   "Rarity": "Common",
   "Attunement": "Yes",
   "Effect": "While this stuffed doll is within 5 feet of you, you can spend a short rest telling it to say up to six phrases, none of which can be more than six words long, and set a condition under which the doll speaks each phrase. You can also replace old phrases with new ones. Whatever the condition, it must occur within 5 feet of the doll to make it speak. For example, whenever someone picks up the doll, it might say, “I want a piece of candy.” The doll’s phrases are lost when your attunement to the doll ends."
 },
 {
  "Item": "Tankard of Sobriety",
   "Type": "Wondrous Item",
   "Cost (gp)": "125",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This tankard has a stern face sculpted into one side. You can drink ale, wine, or any other nonmagical alcoholic beverage poured into it without becoming inebriated. The tankard has no effect on magical liquids or harmful substances such as poison."
 },
 {
  "Item": "Unbreakable Arrow",
   "Type": "Ammunition",
   "Cost (gp)": "25",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This arrow can't be broken, except when it is within an antimagic field."
 },
 {
  "Item": "Veteran's Cane",
   "Type": "Wondrous Item",
   "Cost (gp)": "125",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "When you grasp this walking cane and use a bonus action to speak the command word, it transforms into an ordinary longsword and ceases to be magical."
 },
 {
  "Item": "Walloping Ammunition",
   "Type": "Ammunition",
   "Cost (gp)": "40",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This ammunition packs a wallop. A creature hit by the ammunition must succeed on a DC 10 Strength saving throw or be knocked prone."
 },
 {
  "Item": "Wand of Conducting",
   "Type": "Wand",
   "Cost (gp)": "100",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wand has 3 charges. While holding it, you can use an action to expend 1 of its charges and create orchestral music by waving it around. The music can be heard out to a range of 60 feet and ends when you stop waving the wand.\n\nThe wand regains all expended charges daily at dawn. If you expend the wand’s last charge, roll a d20. On a 1, a sad tuba sound plays as the wand crumbles to dust and is destroyed."
 },
 {
  "Item": "Wand of Lesser Pyrotechnics",
   "Type": "Wand",
   "Cost (gp)": "125",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wand has 7 charges. While holding it, you can use an action to expend 1 of its charges and create a harmless burst of multicolored light at a point you can see up to 60 feet away. The burst of light is accompanied by a crackling noise that can be heard up to 300 feet away. The light is as bright as a torch flame but lasts only a second.\n\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand’s last charge, roll a d20. On a 1, the wand erupts in a harmless pyrotechnic display and is destroyed."
 },
 {
  "Item": "Wand of Scowls",
   "Type": "Wand",
   "Cost (gp)": "125",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wand has 3 charges. While holding it, you can use an action to expend 1 of its charges and target a humanoid you can see within 30 feet of you. The target must succeed on a DC 10 Charisma saving throw or be forced to scowl for 1 minute.\n\nThe wand regains all expended charges daily at dawn. If you expend the wand’s last charge, roll a d20. On a 1, the wand transforms into a wand of smiles."
 },
 {
  "Item": "Wand of Smiles",
   "Type": "Wand",
   "Cost (gp)": "125",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "This wand has 3 charges. While holding it, you can use an action to expend 1 of its charges and target a humanoid you can see within 30 feet of you. The target must succeed on a DC 10 Charisma saving throw or be forced to smile for 1 minute.\n\nThe wand regains all expended charges daily at dawn. If you expend the wand’s last charge, roll a d20. On a 1, the wand transforms into a wand of scowls."
 },
 {
   "Item": "Belt of Dwarvenkind",
   "Type": "Wondrous Item",
   "Cost (gp)": "8000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt, you gain the following benefits:\n\n*Your Constitution score increases by 2, to a maximum of 20.\n*You have advantage on Charisma (Persuasion) checks made to interact with dwarves.\n*In addition, while attuned to the belt, you have a 50 percent chance each day at dawn of growing a full beard if you're capable of growing one, or a visibly thicker beard if you already have one. If you aren't a dwarf, you gain the following additional benefits while wearing the belt:\n*You have advantage on saving throws against poison, and you have resistance against poison damage.\n*You have darkvision out to a range of 60 feet.\n*You can speak, read, and write Dwarvish."
 },
 {
   "Item": "Belt of Hill Giant Strength",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt, your Strength score changes to 21. If your Strength is already equal to or greater than 21, the item has no effect on you."
 },
 {
   "Item": "Belt of Stone/Frost Giant Strength",
   "Type": "Wondrous Item",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt, your Strength score changes to 23. If your Strength is already equal to or greater than 23, the item has no effect on you."
 },
 {
   "Item": "Belt of Fire Giant Strength",
   "Type": "Wondrous Item",
   "Cost (gp)": "22000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt, your Strength score changes to 25. If your Strength is already equal to or greater than 25, the item has no effect on you."
 },
 {
   "Item": "Boots of Elvenkind",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While you wear these boots, your steps make no sound, regardless of the surface you are moving across. You also have advantage on Dexterity (Stealth) checks that rely on moving silently."
 },
 {
   "Item": "Boots of Levitation",
   "Type": "Wondrous Item",
   "Cost (gp)": "7500",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you wear these boots, you can use an action to cast the levitate spell on yourself at will."
 },
 {
   "Item": "Boots of Speed",
   "Type": "Wondrous Item",
   "Cost (gp)": "7500",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you wear these boots, you can use a bonus action and click the boots' heels together. If you do, the boots double your walking speed, and any creature that makes an opportunity attack against you has disadvantage on the attack roll. If you click your heels together again, you end the effect.\nWhen the boots' property has been used for a total of 10 minutes, the magic ceases to function until you finish a long rest."
 },
 {
   "Item": "Boots of Striding and Springing",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you wear these boots, your walking speed becomes 30 feet, unless your walking speed is higher, and your speed isn't reduced if you are encumbered or wearing heavy armor. In addition, you can jump three times the normal distance, though you can't jump farther than your remaining movement would allow."
 },
 {
   "Item": "Boots of the Winterlands",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "These furred boots are snug and feel quite warm. While you wear them, you gain the following benefits:                                            You have resistance to cold damage.                       You ignore difficult terrain created by ice or snow.                       You can tolerate temperatures as low as -50 degrees Fahrenheit without any additional protection. If you wear heavy clothes, you can tolerate temperatures as low as -100 degrees Fahrenheit."
 },
 {
   "Item": "Boots of Spider Climbing",
   "Type": "Wondrous Item",
   "Cost (gp)": "2500",
   "Rarity": "Uncommon",
   "Attunement": "yes",
   "Effect": "While wearing these boots you have a climbing speed of 30 feet."
 },
 {
   "Item": "Bowl of Commanding Water Elementals",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "While this bowl is filled with water, you can use an action to speak the bowl's command word and summon a water elemental, as if you had cast the conjure elemental spell. The bowl can't be used this way again until the next dawn. The bowl is about 1 foot in diameter and half as deep. It weighs 3 pounds and holds about 3 gallons."
 },
 {
   "Item": "Bracers of Archery",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing these bracers, you have proficiency with the longbow and shortbow, and you gain a +2 bonus to damage rolls on ranged attacks made with such weapons."
 },
 {
   "Item": "Bracers of Defense",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing these bracers, you gain a +2 bonus to AC if you are wearing no armor and using no shield."
 },
 {
   "Item": "Brazier of Commanding Fire Elementals",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "While a fire burns in this brass brazier, you can use an action to speak the brazier's command word and summon a fire elemental, as if you had cast the conjure elemental spell. The brazier can't be used this way again until the next dawn. The brazier weighs 5 pounds."
 },
 {
   "Item": "Brooch of Shielding",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this brooch, you have resistance to force damage, and you have immunity to damage from the magic missile spell."
 },
 {
   "Item": "Broom of Flying",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This wooden broom, which weighs 3 pounds, functions like a mundane broom until you stand astride it and speak its command word. It then hovers beneath you and can be ridden in the air. It has a flying speed of 50 feet. It can carry up to 400 pounds, but its flying speed becomes 30 feet while carrying over 200 pounds. The broom stops hovering when you land.\nYou can send the broom to travel alone to a destination within 1 mile of you if you speak the command word, name the location, and are familiar with that place. The broom comes back to you when you speak another command word, provided that the broom is still within 1 mile of you."
 },
 {
   "Item": "Candle of Invocation",
   "Type": "Wondrous Item",
   "Cost (gp)": "18000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This slender taper is dedicated to a deity and shares that deity's alignment. The candle's alignment can be detected with the detect evil and good spell. The DM chooses the god and associated alignment or determines the alignment randomly.\nThe candle's magic is activated when the candle is lit, which requires an action. After burning for 4 hours, the candle is destroyed. You can snuff it out early for use at a later time. Deduct the time it burned in increments of 1 minute from the candle's total burn time.\nWhile lit, the candle sheds dim light in a 30-foot radius. Any creature within that light whose alignment matches that of the candle makes attack rolls, saving throws, and ability checks with advantage. In addition, a cleric or druid in the light whose a lignment matches the candle's can cast 1st-level spells he or she has prepared without expending spell slots, though the spell's effect is as if cast with a 1st-level slot.\n Alternatively, when you light the candle for the first time, you can cast the gate spell with it. Doing so destroys the candle."
 },
 {
   "Item": "Cap of Water Breathing",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this cap underwater, you can speak its command word as an action to create a bubble of air around your head. It allows you to breathe normally underwater. This bubble stays with you until you speak the command word again, the cap is removed, or you are no longer underwater."
 },
 {
   "Item": "Cape of the Mountebank",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This cape smells faintly of brimstone. While wearing it, you can use it to cast the dimension door spell as an action. This property of the cape can't be used again until the next dawn.\nWhen you disappear, you leave behind a cloud of smoke, and you appear in a similar cloud of smoke at your destination. The smoke lightly obscures the space you left and the space you appear in, and it dissipates at the end of your next turn. A light or stronger wind disperses the smoke."
 },
 {
   "Item": "Carpet of Flying",
   "Type": "Wondrous Item",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "You can speak the carpet's command word as an action to make the carpet hover and fly. It moves according to your spoken directions, provided that you are within 30 feet of it.\nFour sizes of carpet of flying exist. The DM chooses the size of a given carpet or determines it randomly.\nA carpet can carry up to twice the weight shown on the table, but it flies at half speed if it carries more than its normal capacity."
 },
 {
   "Item": "Censer of Controlling Air Elementals",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "While incense is burning in this censer, you can use an action to speak the censer's command word and summon an air elemental, as if you had cast the conjure elemental spell. The censer can't be used this way again until the next dawn.\nThis 6-inch-wide, 1-foot-high vessel resembles a chalice with a decorated lid. It weighs 1 pound."
 },
 {
   "Item": "Chime of Opening",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This hollow metal tube measures about 1 foot long and weighs 1 pound. You can strike it as an action, pointing 1t at an object within 120 feet of you that can be opened, such as a door, lid, or lock. The chime issues a clear tone, and one lock or latch on the object opens unless the sound can't reach the object. If no locks or latches remain, the object itself opens. The chime can be used ten times. After the tenth time it cracks and becomes useless."
 },
 {
   "Item": "Circlet of Blasting",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this circlet, you can use an action to cast the scorching ray spell with it. When you make the spell's attacks, you do so with an attack bonus of +5. The circlet can't be used this way again until the next dawn."
 },
 {
   "Item": "Cloak of Arachnida",
   "Type": "Wondrous Item",
   "Cost (gp)": "16000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This fine garment is made of black silk interwoven with faint silvery threads. While wearing it, you gain the following benefits:                                            You have resistance to poison damage.                       You have a climbing speed equal to your walking speed.You can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free.                       You can't be caught in webs of any sort and can move through webs as if they were difficult terrain.                       You can use an action to cast the web spell (save DC 13). The web created by the spell fills twice its normal area. Once used, this property of the cloak can't be used again until the next dawn."
 },
 {
   "Item": "Cloak of Displacement",
   "Type": "Wondrous Item",
   "Cost (gp)": "8000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you wear this cloak, it projects an illusion that makes you appear to be standing in a place near your actual location, causing any creature to have disadvantage on attack rolls against you. If you take damage, the property ceases to function until the start of your next turn. This property is suppressed while you are in-capacitated, restrained, or otherwise unable to move."
 },
 {
   "Item": "Cloak of Elvenkind",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you wear this cloak with its hood up, Wisdom (Perception) checks made to see you have disadvantage and you have advantage on Dexterity (Stealth) checks made to hide, as the cloak's color shifts to camouflage you. Pulling the hood up or down requires an action."
 },
 {
   "Item": "Cloak of Protection",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "You gain a +1 bonus to AC and saving throws while you wear this cloak."
 },
 {
   "Item": "Cloak of Shadows",
   "Type": "Wondrous Item",
   "Cost (gp)": "2500",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this cloak you have advantage on dexterity(stealth) checks made to hide in dim light or darkness."
 },
 {
   "Item": "Cloak of the Bat",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this cloak, you have advantage on Dexterity (Stealth) checks. In an area of dim light or darkness, you can grip the edges of the cloak with both hands and use it to fly at a speed of 40 feet. If you ever fail to grip the cloak's edges while flying in this way, or if you are no longer in dim light or darkness, you lose this flying speed.\nWhile wearing the cloak in an area of dim light or darkness, you can use your action to cast polymorph on yourself, transforming into a bat. While you are in the form of the bat, you retain your Intelligence, Wisdom, and Charisma scores. The cloak can't be used this way again until the next dawn."
 },
 {
   "Item": "Cloak of the Manta Ray",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this cloak with its hood up, you can breathe underwater, and you have a swimming speed of 60 feet. Pulling the hood up or down requires an action."
 },
 {
   "Item": "Crystal Ball",
   "Type": "Wondrous Item",
   "Cost (gp)": "18000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "The typical crystal ball, a very rare item, is about 6 inches in diameter. While touching it, you can cast the scrying spell (save DC 17) with it."
 },
 {
   "Item": "Daern's Instant Fortress",
   "Type": "Wondrous Item",
   "Cost (gp)": "11000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You can use an action to place this l-inch metal cube on the ground and speak its command word. The cube rapidly grows into a fortress that remains until you use an action to speak the command word that dismisses it, which works only if the fortress is empty. The fortress is a square tower, 20 feet on a side and 30 feet high, with arrow slits on all sides and a battlement atop it. Its interior is divided into two floors with a ladder running along one wall to connect them. The ladder ends at a trapdoor leading to the roof. When activated, the tower has a small door on the side facing you. The door opens only at your command, which you can speak as a bonus action. It is immune to the knock spell and similar magic, such as that of a chime of opening.\nEach creature in the area where the fortress appears must make a DC 15 Dexterity saving throw, taking lOdlO bludgeoning damage on a failed save, or half as much damage on a successful one. In either case, the creature is pushed to an unoccupied space outside but next to the fortress. Objects in the area that aren't being worn or carried take this damage and are pushed automatically.\nThe tower is made of adamantine, and its magic prevents it from being tipped over. The roof, the door, and the walls each have 100 hit points, immunity to damage from nonmagical weapons excluding siege weapons, and resistance to all other damage. Only a wish spell can repair the fortress (this use of the spell counts as replicating a spell of 8th level or lower). Each casting of wish causes the roof, the door, or one wall to regain 50 hit points."
 },
 {
   "Item": "Decanter of Endless Water",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This stoppered flask sloshes when shaken, as if it contains water. The decanter weighs 2 pounds. You can use an action to remove the stopper and speak one of three command words, whereupon an amount of fresh water or salt water (your choice) pours out of the flask. The water stops pouring out at the start of your next turn. Choose from the following options:                                            \"Stream\" produces 1 gallon of water.                       \"Fountain\" produces 5 gallons of water.                       \"Geyser\" produces 30 gallons of water that gushes forth in a geyser 30 feet long and 1 foot wide. As a bonus action while holding the decanter, you can aim the geyser at a creature you can see within 30 feet of you. The target must succeed on a DC 13 Strength saving throw or take 1d4 bludgeoning damage and fall prone. Instead of a creature, you can target an object that isn't being worn or carried and that weighs no more than 200 pounds. The object is either knocked over or pushed up to 15 feet away from you."
 },
 {
   "Item": "Dimensional Shackles",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You can use an action to place these shackles on an incapacitated creature. The shackles adjust to fit a creature of Small to Large size. In addition to serving as mundane manacles, the shackles prevent a creature bound by them from using any method of extradimensional movement, including teleportation or travel to a different plane of existence. They don't prevent the creature from passing-through an interdimensional portal.\nYou and any creature you designate when you use the shackles can use an action to remove them. Once every 30 days, the bound creature can make a DC 30 Strength Athletics) check. On a success, the creature breaks free and destroys the shackles."
 },
 {
   "Item": "Driftglobe",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This small sphere of thick glass weighs 1 pound. If you are within 60 feet of it, you can speak its command word and cause it to emanate the light or daylight spell. Once used, the daylight effect can't be used again until the next dawn.\nYou can speak another command word as an action to make the illuminated globe rise into the air and float no more than 5 feet off the ground. The globe hovers in this way until you or another creature grasps it. If you move more than 60 feet from the hovering globe, it follows you until it is within 60 feet of you. It takes the shortest route to do so. If prevented from moving, the globe sinks gently to the ground and becomes inactive, and its light winks out."
 },
 {
   "Item": "Dust of Disappearance",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Found in a small packet, this powder resembles very fine sand. There is enough of it for one use. When you use an action to throw the dust into the air, you and each creature and object within 10 feet of you become invisible for 2d4 minutes. The duration is the same for all subjects, and the dust is consumed when its magic takes effect. If a creature affected by the dust attacks or casts a spell, the invisibility ends for that creature."
 },
 {
   "Item": "Dust of Dryness",
   "Type": "Single Use",
   "Cost (gp)": "500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This small packet contains 1d6 + 4 pinches of dust. You can use an action to sprinkle a pinch of it over water. The dust turns a cube of water 15 feet on a side into one marble-sized pellet, which floats or rests near where the dust was sprinkled. The pellet's weight is negligible. Someone can use an action to smash the pellet against a hard surface, causing the pellet to shatter and release the water the dust absorbed. Doing so ends that pellet's magic. \nAn elemental composed mostly of water that is exposed to a pinch of the dust must make a DC 13 Constitution saving throw, taking 10d6 necrotic damage on a failed save, or half as much damage on a successful one."
 },
 {
   "Item": "Dwarven Plate",
   "AC": 20,
   "Weight": 65,
   "Type": "Armor(plate)",
   "Cost (gp)": "20000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "While wearing this armor, you gain a +2 bonus to AC. In addition, if an effect moves you against your will along the ground, you can use your reaction to reduce the distance you are moved by up to 10 feet."
 },
 {
   "Item": "Dwarven Thrower",
   "Damage": "1d8/1d10 bludgeoning",
   "Weight": "2 lb",
   "Properties": "versatile",
   "Type": "Weapon(warhammer)",
   "Cost (gp)": "28000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (Dwarf only)",
   "Effect": "You gain a +3 bonus to attack and damage rolls made with this magic weapon. It has the thrown property with a normal range of 20 feet and a long range of 60 feet. When you hit with a ranged attack using this weapon, it deals an extra ld8 damage or, if the target is a giant, 2d8 damage. Immediately after the attack, the weapon flies back to your hand."
 },
 {
   "Item": "Elemental Gem",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This gem contains a mote of elemental energy. When you use an action to break the gem, an elemental is summoned as if you had cast the conjure elemental spell, and the gem's magic is lost. The type of gem determines the elemental summoned by the spell."
 },
 {
   "Item": "Elixer of Health",
   "Type": "Single Use",
   "Cost (gp)": "250",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, it cures any disease afflicting you, and it removes the blinded, deafened, paralyzed, and poisoned conditions. The clear red liquid has tiny bubbles of light in it."
 },
 {
   "Item": "Elven Chain",
   "AC": 14,
   "Weight": 20,
   "Type": "Armor(chain shirt)",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You gain a +1 bonus to AC while you wear this armor. You are considered proficient with this armor even if you lack proficiency with medium armor."
 },
 {
   "Item": "Eversmoking Bottle",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Smoke leaks from the lead-stoppered mouth of this brass bottle, which weighs 1 pound. When you use an action to remove the stopper, a cloud of thick smoke pours out in a 60-foot radius from the bottle. The cloud's area is heavily obscured. Each minute the bottle remains open and within the cloud, the radius increases by 10 feet until it reaches its maximum radius of 120 feet.\nThe cloud persists as long as the bottle is open. Closing the bottle requires you to speak its command word as an action. Once the bottle is closed, the cloud disperses after 10 minutes. A moderate wind (11 to 20 miles per hour) can also disperse the smoke after 1 minute, and a strong wind (21 or more miles per hour) can do so after 1 round."
 },
 {
   "Item": "Eyes of Charming",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "These crystal lenses fit over the eyes. They have 3 charges. While wearing them, you can expend 1 charge as an action to cast the charm person spell (save DC 13) on a humanoid within 30 feet of you, provided that you and the target can see each other. The lenses regain all expended charges daily at dawn."
 },
 {
   "Item": "Eyes of Minute Seeing",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "These crystal lenses fit over the eyes. While wearing them, you can see much better than normal out to a range of 1 foot. You have advantage on Intelligence (Investigation) checks that rely on sight while searching an area or studying an object within that range."
 },
 {
   "Item": "Eyes of the Eagle",
   "Type": "Misc. Equipment",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "These crystal lenses fit over the eyes. While wearing them, you have advantage on Wisdom (Perception) checks that rely on sight. In conditions of clear visibility, you can make out details of even extremely distant creatures and objects as small as 2 feet across."
 },
 {
   "Item": "Folding Boat",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This object appears as a wooden box that measures 12 inches long, 6 inches wide, and 6 inches deep. It weigh 4 pounds and floats. It can be opened to store items inside. This item also has three command words, each requiring you to use an action to speak it.\nOne command word causes the box to unfold into a boat 10 feet long, 4 feet wide, and 2 feet deep. The boat has one pair of oars, an anchor, a mast, and a lateen sail. The boat can hold up to four Medium creatures comfortably.\nThe second command word causes the box to unfold into a ship 24 feet long, 8 feet wide; and 6 feet deep. The ship has a deck, rowing seats, five sets of oars, a steering oar, an anchor, a deck cabin, and a mast with a 5quare sail. The ship can hold fifteen Medium creatures comfortably.\nWhen the box becomes a vessel, its weight becomes that of a normal vessel its size, and anything that was stored in the box remains in the boat.\nThe third command word causes the folding boat to fold back into a box, provided that no creatures are aboard. Any objects in the vessel that can't fit inside the box remain outside the box as it folds. Any objects in the vessel that can fit inside the box do so."
 },
 {
   "Item": "Gauntlets of Ogre Power",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "Your Strength score is 19 while you wear these gauntlets. They have no effect on you if your Strength is already 19 or higher."
 },
 {
   "Item": "Gem of Brightness",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This prism has 50 charges. While you are holding it, you can use an action to speak one of three command words to cause one of the following effects:                                            The first command word causes the gem to shed bright light in a 30-foot radius and dim light for an additional 30 feet. This effect doesn't expend a charge. It lasts until you use a bonus action to repeat the command word or until you use another function of the gem.                       The second command word expends 1 charge and causes the gem to fire a brilliant beam of light at one creature you can see within 60 feet of you. The creature must succeed on a DC 15 Constitution saving throw or become blinded for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.                       The third command word expends 5 charges and causes the gem to flare with blinding light in a 30-foot cone originating from it. Each creature in the cone must make a saving throw as if struck by the beam created with the second command word.                                          When all of the gem's charges are expended, the gem becomes a non magical jewel worth 50 gp."
 },
 {
   "Item": "Gem of Seeing",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This gem has 3 charges. As an action, you can speak the gem's command word and expend 1 charge. For the next 10 minutes, you have truesight out to 120 feet when you peer through the gem.\nThe gem regains 1d3 expended charges daily at dawn"
 },
 {
   "Item": "Glamoured Studded Leather",
   "AC": 13,
   "Weight": 13,
   "Type": "Armor (studded leather)",
   "Cost (gp)": "7000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "While wearing this armor, you gain a +1 bonus to AC. You can also use a bonus action to speak the armor's command word and cause the armor to assume the appearance of a normal set of clothing or some other kind of armor. You decide what it looks like, including color, style, and accessories, but the armor retains its normal bulk and weight. The illusory appearance lasts until you use this property again or remove the armor."
 },
 {
   "Item": "Gloves of Missile Snaring",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "These gloves seem to almost meld into your hands when you don them. When a ranged weapon attack hits you while you're wearing them, you can use your reaction to reduce the damage by 1d10 +your Dexterity modifier. provided that you have a free hand. If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in that hand."
 },
 {
   "Item": "Gloves of Swimming and Climbing",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing these gloves, climbing and swimming don't cost you extra movement, and you gain a +5 bonus to Strength (Athletics) checks made to climb or swim."
 },
 {
   "Item": "Gloves of Thievery",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "These gloves are invisible while worn. While wearing them, you gain a +5 bonus to Dexterity (Sleight of Hand) checks and Dexterity checks made to pick locks."
 },
 {
   "Item": "Goggles of Night",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing these dark lenses, you have darkvision out to a range of 60 feet. If you already have darkvision, wearing the goggles increases its range by 60 feet."
 },
 {
   "Item": "Greater Wand of Pure Magic",
   "Type": "Wand",
   "Cost (gp)": "20000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While you are attuned to this wand your maximum number of spell slots of levels 1 through 5 is increased by 1.  You must have a spell slot of a particular level for the wand to grant you an additional spell slot of that level."
 },
 {
   "Item": "Hat of Disguise",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this hat, you can use an action to cast the disguise self spell from it at will. The spell ends if the hat is removed."
 },
 {
   "Item": "Headband of Intellect",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "Your Intelligence score is 19 while you wear this headband. It has no effect on you if your Intelligence is already 19 or higher."
 },
 {
   "Item": "Helm of Brilliance",
   "Type": "Wondrous Item",
   "Cost (gp)": "11000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This dazzling helm is set with 1d10 diamonds, 2d10 rubies, 3d10 fire opals, and 4d10 opals. Any gem pried from the helm crumbles to dust. When all the gems are removed or destroyed, the helm loses its magic.\n You gain the following benefits while wearing it:\n\n* You can use an action to cast one of the following spells (save DC 18), using one of the helm's gems of the specified type as a component: daylight (opal), fireball (fi re opal), prismatic spray (diamond), or wall of fire (ruby). The gem is destroyed when the spell is cast and disappears from the helm.\n* As long as it has at least one diamond, the helm emits dim light in a 30-foot radius when at least one undead is within that area. Any undead that starts its turn in that area takes 1d6 radiant damage.\n* As long as the helm has at least one ruby, you have resistance to fire damage.\n* As long as the helm has at least one fire opal, you can use an action and speak a command word to cause one weapon you are holding to burst into flames. The flames emit bright light in a 10-foot radius and dim light for an additional 10 feet. The flames are harmless to you and the weapon. When you hit with an attack using the blazing weapon, the target takes an extra 1d6 fire damage. The flames last until you use a bonus action to speak the command word again or until you drop or stow the weapon.\n* Roll a d20 if you are wearing the helm and take fire damage as a result of failing a saving throw against a spell. On a roll of 1, the helm emits beams of light from its remaining gems. Each creature within 60 feet of the helm other than you must succeed on a DC 17 Dexterity saving throw or be struck by a beam, taking radiant damage equal to the number of gems in the helm. The helm and its gems are then destroyed."
 },
 {
   "Item": "Helm of Comprehending Languages",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this helm, you can use an action to cast the comprehend languages spell from it at will."
 },
 {
   "Item": "Helm of Telepathy",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this helm , you can use an action to cast the detect thoughts spell (save DC 13) from it. As long as you maintain concentration on the spell, you can use a bonus action to send a telepathic message to a creature you are focused on. It can reply-using a bonus action to do so- while your focus on it continues.\nWhile focusing on a creature with detect thoughts, you can use an action to cast the suggestion spell (save DC 13) from the helm on that creature. Once used, the suggestion property can't be used again until the next dawn."
 },
 {
   "Item": "Helm of Teleportation",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This helm has 3 charges. While wearing it, you can use an action and expend 1 charge to cast the teleport spell from it. The helm regains 1d3 expended charges daily at dawn."
 },
 {
   "Item": "Heward's Handy Haversack",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Container": true,
   "Capacity": 120,
   "weightCounts": false,
   "Weight": 5,
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This backpack has a central pouch and two side pouches, each of which is an extradimensional space. Each side pouch can hold up to 20 pounds of material, not exceeding a volume of 2 cubic feet. The large central pouch can hold up to 8 cubic feet or 80 pounds of material. The backpack always weighs 5 pounds, regardless of its contents. \nPlacing an object in the haversack follows the normal rules for interacting with objects. Retrieving an item from the haversack requires you to use an action. When you reach into the haversack for a specific item, the item is always magically on top. \nThe haversack has a few limitations. If it is overloaded, or if a sharp object pierces it or tears it, the haversack ruptures and is destroyed. If the haversack is destroyed, its contents are lost forever, although an artifact always turns up again somewhere. If the haversack is turned inside out, its contents spill forth, unharmed, and the haversack must be put right before it can be used again. If a breathing creature is placed within the haversack, the creature can survive for up to 10 minutes, after which time it begins to suffocate.\n Placing the haversack inside an extradimensional space created by a bag of holding, portable hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10-feet of the gate is sucked through it and deposited in a random location on the Astral Plane. The gate then closes. The gate is one way only and can't be reopened."
 },
 {
   "Item": "Horn of Blasting",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You can use an action to speak the horn's command word and then blow the horn, which emits a thunderous blast in a 30-foot cone that is audible 600 feet away. Each creature in the cone must make a DC 15 Constitution saving throw. On a failed save, a creature takes 5d6 thunder damage and is deafened for 1 minute. On a successful save, a creature takes half as much damage and isn't deafened. Creatures and objects made of glass or crystal have disadvantage on the saving throw and take 10d6 thunder damage instead of 5d6.\nEach use of the horn's magic has a 20 percent chance of causing the horn to explode. The explosion deals 10d6 fire damage to the blower and destroys the horn."
 },
 {
   "Item": "Horseshoes of a Zephyr",
   "Type": "Wondrous Item",
   "Cost (gp)": "12000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "These iron horseshoes come in a set of four. While all four shoes are affixed to the hooves of a horse or similar creature, they allow the creature to move normally while floating 4 inches above the ground. This effect means the cre.ature can cross or stand above nonsolid or unstable surfaces, such as water or lava. The creature leaves no tracks and ignores difficult terrain. In addition, the creature can move at normal speed for up to 12 hours a day without suffering exhaustion from a forced march."
 },
 {
   "Item": "Horseshoes of Speed",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "These iron horseshoes come in a set of four. While all four shoes are affixed to the hooves of a horse or similar creature, they increase the creature's walking speed by 30 feet."
 },
 {
   "Item": "Immovable Rod",
   "Type": "Rod",
   "Cost (gp)": "1500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This flat iron rod has a button on one end. You can use an action to press the button, which causes the rod to become magically fixed in place. Until you or another creature uses an action to push the button again, the rod doesn't move, even if it is defying gravity. The rod can hold up to 8,000 pounds of weight. More weight causes the rod to deactivate and fall. A creature can use an action to make a DC 30 Strength check, moving the fixed rod up to 10 feet on a success."
 },
 {
   "Item": "Iron Bands of Bilarro",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This rusty iron sphere measures 3 inches in diameter and weighs 1 pound. You can use an action to speak the command word and throw the sphere at a Huge or smaller creature you can see within 60 feet of you. As the sphere moves through the air, it opens into a tangle of metal bands. \nMake a ranged attack roll with an attack bonus equal to your Dexterity modifier plus your proficiency bonus. On a hit, the target is restrained until you take a bonus action to speak the command word again to release it. Doing so, or missing with the attack, causes the bands to contract and become a sphere once more. \nA creature, including the one restrained, can use an action to make a DC 20 Strength check to break the iron bands. On a success, the item is destroyed, and the restrained creature is freed. If the check fails, any further attempts made by that creature automatically fail until 24 hours have elapsed. Once the bands are used, they can't be used again until the next dawn."
 },
 {
   "Item": "Javelin of Lightning",
   "Type": "Weapon (javelin)",
   "Damage": "1d6 piercing",
   "Weight": "2 lb",
   "Properties": "light, thrown (range 30/120)",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This javelin is a magic weapon. When you hurl it and speak its command word, it transforms into a bolt of lightning, forming a line 5 feet wide that extends out from you to a target within 120 feet. Each creature in the line excluding you and the target must make a DC 13 Dexterity saving throw, taking 4d6 lightning damage on a failed save, and half as much damage on a successful one. The lightning bolt turns back into a javelin when it reaches the target. Make a ranged weapon attack against the target. On a hit, the target takes damage from the javelin plus 4d6 lightning damage. \nThe javelin's property can't be used again until the next dawn. In the meantime, the javelin can still be used as a magic weapon."
 },
 {
   "Item": "Keoghtom's Ointment",
   "Type": "Single Use",
   "Cost (gp)": "2500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This glass jar, 3 inches in diameter, contains 4 doses of a thick mixture that smells faintly of aloe. The jar and its contents weigh 1/2 pound. As an action, one dose of the ointment can be swallowed or applied to the skin. The creature that receives it regains 2d8 + 2 hit points, ceases to be poisoned, and is cured of any disease."
 },
 {
   "Item": "Lantern of Revealing",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While lit, this hooded lantern burns for 6 hours on 1 pint of oil, shedding bright light in a 30-foot radius and dim light for an additional 30 feet. Invisible creatures and objects are visible as long as they are in the lantern's bright light. You can use an action to lower the hood, reducing the light to dim light in a 5-foot radius."
 },
 {
   "Item": "Lesser Wand of Pure Magic",
   "Type": "Wand",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you are attuned to this wand your maximum number of 1st level spell slots is increased by 1.  You must have a spell slot of a particular level for the wand to grant you an additional spell slot of that level."
 },
 {
   "Item": "Mace of Disruption",
   "Damage": "1d6 bludgeoning",
   "Weight": "4 lb",
   "Properties": "-",
   "Type": "Weapon (mace)",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "When you hit a fiend or an undead with this magic weapon, that creature takes an extra 2d6 radiant damage. If the target has 25 hit points or fewer after taking this damage, it must succeed on a DC 15 Wisdom saving throw or be destroyed. On a successful save, the creature becomes frightened of you until the end of your next turn.\nWhile you hold this weapon, it sheds bright light in a 20-foot radius and dim light for an additional 20 feet."
 },
 {
   "Item": "Mace of Smiting",
   "Damage": "1d6 bludgeoning",
   "Weight": "4 lb",
   "Properties": "-",
   "Type": "Weapon (mace)",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. The bonus increases to +3 when you use the mace to attack a construct. When you roll a 20 on an attack roll made with this weapon, the target takes an extra 7 bludgeoning damage, or an extra 14 bludgeoning damage if it's a construct. If a construct has 25 hit points or fewer after taking this damage, it is destroyed."
 },
 {
   "Item": "Mace of Terror",
   "Damage": "1d6 bludgeoning",
   "Weight": "4 lb",
   "Properties": "-",
   "Type": "Weapon (mace)",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This magic weapon has 3 charges. While holding it, you can use an action and expend 1 charge to release a wave of terror. Each creature of your choice in a 30-foot radius extending from you must succeed on a DC 15 Wisdom saving throw or become frightened of you for 1 minute. While it is frightened in this way, a creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action it can use only the Dash action or try to escape from an effect that prevents it from moving. If it has nowhere it can move, the creature can use the Dodge action. At the end of each of its turns, a creature can repeat the saving throw, ending the effect on itself on a success.\nThe mace regains 1d3 expended charges daily at dawn."
 },
 {
   "Item": "Mantle of Spell Resistance",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "You have advantage on saving throws against spells while you wear this cloak."
 },
 {
   "Item": "Manual of Bodily Health",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book contains health and diet tips, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying the book's contents and practicing its guidelines, your Constitution score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Manual of Gainful Exercise",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book describes fitness exercises, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying the book's contents and practicing its guidelines, your Strength score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Manual of Quickness of Action",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book contains coordination and balance exercises, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying The book's contents and practicing its guidelines, your Dexterity score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Mariner's Armor",
   "Type": "Armor",
   "Cost (gp)": "2000 + armor cost",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this armor, you have a swimming speed equal to your walking speed. In addition, whenever you start your turn underwater with 0 hit points, the armor causes you to rise 60 feet toward the surface. The armor is decorated with fish and shell motifs."
 },
 {
   "Item": "Medallion of Thoughts",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "The medallion has 3 charges. While wearing it, you can use an action and expend 1 charge to cast the detect thoughts spell (save DC 13) from it. The medallion regains 1d3 expended charges daily at dawn."
 },
 {
   "Item": "Mirror of Life Trapping",
   "Type": "Wondrous Item",
   "Cost (gp)": "25000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "When this 4-foot-tall mirror is viewed indirectly, its surface shows faint images of creatures. The mirror weighs 50 pounds, and it has AC 11, 10 hit points, and vulnerability to bludgeoning damage. It shatters and is destroyed when reduced to 0 hit points. \nIf the mirror is hanging on a vertical surface and you are within 5 feet of it, you can use an action to speak its command word and activate it. It remains activated until you use an action to speak the command word again. \nAny creature other than you that sees its reflection in the activated mirror while within 30 feet of it must succeed on a DC 15 Charisma saving throw or be trapped, along with anything it is wearing or carrying, in one of the mirror's twelve extradimensional cells. This saving throw is made with advantage if the creature knows the mirror's nature, and constructs succeed on the saving throw automatically. \nAn extradimensional cell is an infinite expanse filled with thick fog that reduces visibility to 10 feet. Creatures trapped in the mirror's cells don't age, and they don't need to eat, drink, or sleep. A creature trapped within a cell can escape using magic that permits planar travel. Otherwise, the creature is confined to the cell until freed.\nIf the mirror traps a creature but its twelve extradimensional cells are already occupied, the mirror frees one trapped creature at random to accommodate the new prisoner. A freed creature appears in an unoccupied space within sight of the mirror but facing away from it. If the mirror is shattered, all creatures it contains are freed and appear in unoccupied spaces near it.\n While within 5 feet of the mirror, you can use an action to speak the name of one creature trapped in it or call out a particular cell by number. The creature named or contained in the named cell appears as an image on the mirror's surface. You and the creature can then communicate normally.\n In a similar way, you can use an action to speak a second command word and free one creature trapped in the mirror. The freed creature appears, along with its possessions, in the unoccupied space nearest to the mirror and facing away from it."
 },
 {
   "Item": "Mystic Dwarven Alchemical Lead Expulsion Device",
   "Damage": "4d10 bludgeoning",
   "Weight": "4 lb",
   "Properties": "ranged, Ammunition (range 60/240), loading, two-handed",
   "Type": "Weapon (exotic)",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "martial ranged weapon, uses lead bullets, loading, 4d10 damage, range 60/24 0"
 },
 {
   "Item": "Necklace of Adaptation",
   "Type": "Wondrous Item",
   "Cost (gp)": "2500",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this necklace, you can breathe normally in any environment, and you have advantage on saving throws made against harmful gases and vapors (such as cloudkill and stinking cloud effects, inhaled poisons, and the breath weapons of some dragons)."
 },
 {
   "Item": "Necklace of Fireballs",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This necklace has 7 beads hanging from it. You can use an action to detach a bead and throw it up to 6 feet away. When it reaches the end of its trajectory, the bead detonates as a 3rd-level fireball spell (save DC 15) You can hurl multiple beads, or even the whole necklace, as one action. When you do so, increase the level of the fireball by 1 for each bead beyond the first."
 },
 {
   "Item": "Oathbow",
   "Damage": "1d8 piercing",
   "Weight": "2 lb",
   "Properties": "ranged, Ammunition (range 150/600), heavy, two-handed",
   "Type": "Weapon (longbow)",
   "Cost (gp)": "13000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "When you nock an arrow on this bow, it whispers in Elvish, \"Swift defeat to my enemies.\" When you use this weapon to make a ranged attack, you can, as a command phrase, say, \"Swift death to you who have wronged me.\" The target of your attack becomes your sworn enemy until it dies or until dawn seven days later. You can have only one such sworn enemy at a time. When your sworn enemy dies, you can choose a new one after the next dawn.\nWhen you make a ranged attack roll with this weapon against your sworn enemy, you have advantage on the roll. In addition, your target gains no benefit from cover, other than total cover, and you suffer no disadvantage due to long range. If the attack hits, your sworn enemy takes an extra 3d6 piercing damage. \nWhile your sworn enemy lives, you have disadvantage on attack rolls with all other weapons."
 },
 {
   "Item": "Oil of Etherealness",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "Beads of this cloudy gray oil form on the outside of its container and quickly evaporate. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of the etherealness spell for 1 hour."
 },
 {
   "Item": "Oil of Sharpness",
   "Type": "Single Use",
   "Cost (gp)": "2000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This clear, gelatinous oil sparkles with tiny, ultrathin silver shards. The oil can coat one slashing or piercing weapon or up to 5 pieces of slashing or piercing ammunition. Applying the oil takes 1 minute. For 1 hour, the coated item is magical and has a +3 bonus to attack and damage rolls."
 },
 {
   "Item": "Oil of Slipperiness",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This sticky black unguent is thick and heavy in the container, but it flows quickly when poured. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of a freedom of movement spell for 8 hours. Alternatively, the oil can be poured on the ground as an action, where it covers a 10-foot square, duplicating the effect of the grease spell in that area for 8 hours."
 },
 {
   "Item": "Pearl of Power",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "You can use an action to speak this pearl's command word and regain one expended spell slot of up to 3rd level. Once you have used the pearl, it can't be used again until the next dawn."
 },
 {
   "Item": "Periapt of Health",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You are immune to contracting any disease while you wear this pendant. If you are already infected with a disease, the effects of the disease are suppressed you while you wear the pendant."
 },
 {
   "Item": "Periapt of Proof Against Poison",
   "Type": "Wondrous Item",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This delicate silver chain has a brilliant-cut black gem pendant. While you wear it, poisons have no effect on you. You are immune to the poisoned condition and have immunity to poison damage."
 },
 {
   "Item": "Periapt of Wound Closure",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you wear this pendant, you stabilize whenever you are dying at the start of your turn. In addition, whenever you roll a Hit Die to regain hit points, double the number of hit points it restores."
 },
 {
   "Item": "Philter of Love",
   "Type": "Single Use",
   "Cost (gp)": "600",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "The next time you see a creature within 10 minutes after drinking this philter, you become charmed by that creature for 1 hour. If the creature is of a species and gender you are normally attracted to, you regard it as your true love while you are charmed. This potion's rose-hued, effervescent liquid contains one easy-to-miss bubble shaped like a heart."
 },
 {
   "Item": "Pipes of Haunting",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You must be proficient with wind instruments to use these pipes. They have 3 charges. You can use an action to play them and expend 1 charge to create an eerie, spellbinding tune. Each creature within 30 feet of you that hears you play must succeed on a DC 15 Wisdom saving throw or become frightened of you for 1 minute. If you wish, all creatures in the area that aren't hostile toward you automatically succeed on the saving throw. A creature that fails the saving throw can repeat it at the end of each of its turns, ending the effect on itself on a success. A creature that succeeds on its saving throw is immune to the effect of these pipes for 24 hours. The pipes regain 1d3 expended charges daily at dawn."
 },
 {
   "Item": "Pipes of the Sewers",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You must be proficient with wind instruments to use these pipes. While you are attuned to the pipes, ordinary rats and giant rats are indifferent toward you and will not attack you unless you threaten or harm them. \nThe pipes have 3 charges. If you play the pipes as an action, you can use a bonus action to expend 1 to 3 charges, calling forth one swarm of rats (see the Monster Manual for statistics) with each expended charge, provided that enough rats are within half a mile of you to be called in this fashion (as determined by the DM). If there aren't enough rats to form a swarm, the charge is wasted. Called swarms move toward the music by the shortest available route but aren't under your control otherwise. The pipes regain ld3 expended charges daily at dawn.\nWhenever a swarm of rats that isn't under another creature's control comes within 30 feet of you while you are playing the pipes, you can make a Charisma check contested by the swarm's Wisdom check. If you lose the contest, the swarm behaves as it normally would and can't be swayed by the pipes' music for the next 24 hours. If you win the contest, the swarm is swayed by the pipes' music and becomes friendly to you and your companions for as long as you continue to play the pipes each round as an action. A friendly swarm obeys your commands. If you issue no commands to a friendly swarm, it defends itself but otherwise takes no actions. If a friendly swarm starts its turn and can't hear the pipes' music, your control over that swarm ends, and the swarm behaves as it normally would and can't be swayed by the pipes' music for the next 24 hours."
 },
 {
   "Item": "Portable Hole",
   "Type": "Wondrous Item",
   "Cost (gp)": "7000",
   "Container": true,
   "Capacity": 9999,
   "weightCounts": false,
   "Weight": 0,
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This fine black cloth, soft as silk, is folded up to the dimensions of a handkerchief. It unfolds into a circular sheet 6 feet in diameter. You can use an action to unfold a portable hole and place it on or against a solid surface, whereupon the portable hole creates an extradimensional hole 10 feet deep. The cylindrical space within the hole exists on a different plane, so it can't be used to create open passages. Any creature inside an open portable hole can exit the hole by climbing out of it.\nYou can use an action to close a portable hole by taking hold of the edges of the cloth and folding it up. Folding the cloth closes the hole, and any creatures or objects within remain in the extradimensional space. No matter what's in it, the hole weighs next to nothing.\nIf the hole is folded up, a creature with in the hole's extradimensional space can use an action to make a DC 10 Strength check. On a successful check, the creature forces its way out and appears within 5 feet of the portable hole or the creature carrying it. A breathing creature within a closed portable hole can survive for up to 10 minutes, after which time it begins to suffocate.\n Placing a portable hole inside an extradimensional space created by a bag of holding, Heward's handy haversack, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it and deposited in a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened."
 },
 {
   "Item": "Potion of Animal Friendship",
   "Type": "Single Use",
   "Cost (gp)": "500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, you can cast the animal friendship spell (save DC 13) for 1 hour at will. Agitating this muddy liquid brings little bits into view: a fish scale, a hummingbird tongue, a cat claw, or a squirrel hair."
 },
 {
   "Item": "Potion of Arcanum",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "Recover 1d4 levels worth of spell slots (sorcerer or bard only)"
 },
 {
   "Item": "Potion of Clairvoyance",
   "Type": "Single Use",
   "Cost (gp)": "1000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the effect of the clairvoyance spell. An eyeball bobs in this yellowish liquid but vanishes when the potion is opened."
 },
 {
   "Item": "Potion of Climbing",
   "Type": "Single Use",
   "Cost (gp)": "50",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain a climbing speed equal to your walking speed for 1 hour. During this time, you have advantage on Strength (Athletics) checks you make to climb. The potion is separated into brown, silver, and gray layers resembling bands of stone. Shaking the bottle fails to mix the colors."
 },
 {
   "Item": "Potion of Dimunition",
   "Type": "Single Use",
   "Cost (gp)": "600",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the \"reduce\" effect of the enlarge/reduce spell for 1d4 hours (no concentration required). The red in the potion's liquid continuously contracts to a tiny bead and then expands to color the clear liquid around it. Shaking the bottle fails to interrupt this process."
 },
 {
   "Item": "Potion of Fire Breath",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "After drinking this potion, you can use a bonus action to exhale fire at a target within 30 feet of you. The target must make a DC 13 Dexterity saving throw, taking 4d6 fire damage on a failed save, or half as much damage on a successful one. The effect t;nds after you exhale the fire three times or when 1 hour has passed."
 },
 {
   "Item": "Potion of Flying",
   "Type": "Single Use",
   "Cost (gp)": "4000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain a flying speed equal to your walking speed for 1 hour and can hover. If you're in the air when the potion wears off, you fall unless you have some other means of staying aloft. This potion's clear liquid floats at the top of its container and has cloudy white impurities drifting in it."
 },
 {
   "Item": "Potion of Gaseous Form",
   "Type": "Single Use",
   "Cost (gp)": "600",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the effect of the gaseous form spell for 1 hour (no concentration required) or until you end the effect as a bonus action. This potion's container seems to hold fog that moves and pours like water."
 },
 {
   "Item": "Potion of Hill Giant Strength",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, your Strength score changes to 21 for 1 hour.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a hill giant."
 },
 {
   "Item": "Potion of Stone Giant Strength",
   "Type": "Single Use",
   "Cost (gp)": "600",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, your Strength score changes to 23 for 1 hour.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a stone giant."
 },
 {
   "Item": "Potion of Fire Giant Strength",
   "Type": "Single Use",
   "Cost (gp)": "1200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, your Strength score changes to 25 for 1 hour.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a fire giant."
 },
 {
   "Item": "Potion of Cloud Giant Strength",
   "Type": "Single Use",
   "Cost (gp)": "2400",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, your Strength score changes to 27 for 1 hour.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a cloud giant."
 },
 {
   "Item": "Potion of Growth",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the \"enlarge\" effect of the enlarge/reduce spell for 1d4 hours (no concentration required). The red in the potion's liquid continuously expands from a tiny bead to color the clear liquid around it and then contracts. Shaking the bottle fails to interrupt this process."
 },
 {
   "Item": "Potion of Healing",
   "Type": "Single Use",
   "Cost (gp)": "50",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "You regain 2d4+2 hit points when you drink this potion. The potion's red liquid glimmers when agitated."
 },
 {
   "Item": "Potion of Greater Healing",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You regain 4d4+4 hit points when you drink this potion. The potion's red liquid glimmers when agitated."
 },
 {
   "Item": "Potion of Superior Healing",
   "Type": "Single Use",
   "Cost (gp)": "800",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "You regain 8d4+8 hit points when you drink this potion. The potion's red liquid glimmers when agitated."
 },
 {
   "Item": "Potion of Supreme Healing",
   "Type": "Single Use",
   "Cost (gp)": "2500",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "You regain 10d4+20 hit points when you drink this potion. The potion's red liquid glimmers when agitated."
 },
 {
   "Item": "Potion of Heroism",
   "Type": "Single Use",
   "Cost (gp)": "800",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "For 1 hour after drinking it, you gain 10 temporary hit points that last for 1 hour. For the same duration, you are under the effect of the bless spell (no concentration required). This blue potion bubbles and steams as if boiling."
 },
 {
   "Item": "Potion of Invisibility",
   "Type": "Single Use",
   "Cost (gp)": "2000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This potion's container looks empty but feels as though it holds liquid. When you drink it, you become invisible for 1 hour. Anything you wear or carry is invisible with you. The effect ends early if you attack or cast a spell."
 },
 {
   "Item": "Potion of Invulnerability",
   "Type": "Single Use",
   "Cost (gp)": "600",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "For 1 minute after you drink this potion, you have resistance to all damage. The potion's syrupy liquid looks like liquified iron."
 },
 {
   "Item": "Potion of Longevity",
   "Type": "Single Use",
   "Cost (gp)": "3000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, your physical age is reduced by 1d6 + 6 years, to a minimum of 13 years. Each time you subsequently drink a potion of longevity, there is 10 percent cumulative chance that you instead age by 1d6 + 6 years. Suspended in this amber liquid are a scorpion's tail, an adder's fang, a dead spider, and a tiny heart that, against all reason, is still beating. These ingredients vanish when the potion is opened."
 },
 {
   "Item": "Potion of Mind Reading",
   "Type": "Single Use",
   "Cost (gp)": "800",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the effect of the detect thoughts spell (save DC 13). The potion's dense, purple liquid has an ovoid cloud of pink floating in it."
 },
 {
   "Item": "Potion of Resistance",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain resistance to one type of damage for 1 hour. The type of damage is determined when the potion is made."
 },
 {
   "Item": "Potion of Speed",
   "Type": "Single Use",
   "Cost (gp)": "2000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, you gain the effect of the haste spell for 1 minute (no concentration required). The potion's yellow fluid is streaked with black and swirls on its own."
 },
 {
   "Item": "Potion of Vitality",
   "Type": "Single Use",
   "Cost (gp)": "2500",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "When you drink this potion, it removes any exhaustion you are suffering and cures any disease or poison affecting you. For the next 24 hours, you regain the maximum number of hit points for any Hit Die you spend. The potion's crimson liquid regularly pulses wi-dulllight, calling to mind a heartbeat."
 },
 {
   "Item": "Potion of Waterbreathing",
   "Type": "Single Use",
   "Cost (gp)": "150",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You can breathe underwater for 1 hour after drinking this potion. Its cloudy green fluid smells of the sea and has a jellyfish-like bubble floating in it."
 },
 {
   "Item": "Quiver of Ehlonna",
   "Type": "Wondrous Item",
   "Cost (gp)": "1500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Each of the quiver's three compartments connects to an extradimensional space that allows the quiver to hold numerous items while never weighing more than 2 pounds. The shortest compartment can hold up to sixty arrows, bolts, or similar objects. The midsize compartment holds up to eighteen javelins or similar objects. The longest compartment holds up to six long objects, such as bows, quarterstaffs, or spears. You can draw any item the quiver contains as if doing so from a regular quiver or scabbard."
 },
 {
   "Item": "Quiver of Swiftness",
   "Type": "Wondrous Item",
   "Cost (gp)": "8000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you are attuned to this quiver, whenever you take the attack action on your turn with a ranged weapon, you can make an additional attack with the same ranged weapon as a bonus action.  Additionally, you can ignore the loading property of any weapon whose ammunition can be stored in the quiver."
 },
 {
   "Item": "Ring of Animal Influence",
   "Type": "Ring",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This ring has 3 charges, and it regains 1d3 expended charges daily at dawn. While wearing the ring, you can use an action to expend 1 of its charges to cast one of the following spells:\n\n* Animal friendship (save DC 13)\n* Fear (save DC 13), targeting only beasts that have an Intelligence of 3 or lower\n* Speak with animals"
 },
 {
   "Item": "Ring of Evasion",
   "Type": "Ring",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This ring has 3 charges, and it regains 1d3 expended charges daily at dawn. When you fail a Dexterity saving throw while wearing it, you can use your reaction to expend 1 of its charges to succeed on that saving throw instead."
 },
 {
   "Item": "Ring of Feather Falling",
   "Type": "Ring",
   "Cost (gp)": "4000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "When you fall while wearing this ring, you descend 60 feet per round and take no damage from falling."
 },
 {
   "Item": "Ring of Free Action",
   "Type": "Ring",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you wear this ring, difficult terrain doesn't cost you extra movement. In addition, magic can neither reduce your speed nor cause you to be paralyzed or restrained."
 },
 {
   "Item": "Ring of Jumping",
   "Type": "Ring",
   "Cost (gp)": "1500",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you can cast the jump spell from it as a bonus action at will, but can target only yourself when you do so."
 },
 {
   "Item": "Ring of Mind Shielding",
   "Type": "Ring",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you are immune to magic that allows other creatures to read your thoughts, determine whether you are lying, know your alignment, or know your creature type. Creatures can telepathically communicate with you only if you allow it.\nYou can use an action to cause the ring to become invisible until you use another action to make it visible, until you remove the ring, or until you die.\nIf you die while wearing the ring, your soul enters it, unless it already houses a soul. You can remain in the ring or depart for the afterlife. As long as your soul is in the ring, you can telepathically communicate with any creature wearing it. A wearer can't prevent this telepathic communication."
 },
 {
   "Item": "Ring of Protection",
   "Type": "Ring",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "You gain a +1 bonus to AC and saving throws while wearing this ring."
 },
 {
   "Item": "Ring of Regeneration",
   "Type": "Ring",
   "Cost (gp)": "13000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you regain 1d6 hit points every 10 minutes, provided that you have at least 1 hit point. If you lose a body part, the ring causes the missing part to regrow and return to full functionality after 1d6 + 1 days if you have at least 1 hit point the whole time."
 },
 {
   "Item": "Ring of Resistance",
   "Type": "Ring",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "You have resistance to one damage type while wearing this ring. The gem in the ring indicates the type,"
 },
 {
   "Item": "Ring of Spell Storing",
   "Type": "Ring",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This ring stores spells cast into it, holding them until the attuned wearer uses them. The ring can store up to 5 levels worth of spells at a time. When found, it contain ld6 - 1 levels of stored spells chosen by the DM.\nAny creature can cast a spell of 1st through 5th level into the ring by touching the ring as the spell is cast. The spell has no effect, other than to be stored in the ring. If the ring can't hold the spell, the spell is expendec without effect. The level of the slot used to cast the spell determines how much space it uses.\nWhile wearing this ring, you can cast any spell stored in it. The spell uses the slot level, spell save DC, spell attack bonus, and spellcasting ability of the original caster, but is otherwise treated as if you cast the spell. The spell cast from the ring is no longer stored in it, freeing up space."
 },
 {
   "Item": "Ring of Swimming",
   "Type": "Ring",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "You have a swimming speed of 40 feet while wearing this ring."
 },
 {
   "Item": "Ring of Telekinesis",
   "Type": "Ring",
   "Cost (gp)": "14000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you can cast the telekinesis spell at will, but you can target only objects that aren't being worn or carried."
 },
 {
   "Item": "Ring of the Ram",
   "Type": "Ring",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This ring has 3 charges, and it regains 1d3 expended charges daily at dawn. While wearing the ring, you can use an action to expend 1 to 3 of its charges to attack one creature you can see within 60 feet of you. The ring produces a spectral ram's head and makes its attack roll with a +7 bonus. On a hit, for each charge you spend, the target takes 2d10 force damage and is pushed 5 feet away from you.\nAlternatively, you can expend 1 to 3 of the ring's charges as an action to try to break an object you can see within 60 feet of you that isn't being worn or carried. The ring makes a Strength check with a +5 bonus for each charge you spend."
 },
 {
   "Item": "Ring of Warmth",
   "Type": "Ring",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you have resistance to cold damage. In addition, you and everything you wear and carry are unharmed by temperatures as low as - 50 degrees Fahrenheit."
 },
 {
   "Item": "Ring of Water Walking",
   "Type": "Ring",
   "Cost (gp)": "2500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While wearing this ring, you can stand on and move across any liquid surface as if it were solid ground."
 },
 {
   "Item": "Ring of X-ray Vision",
   "Type": "Ring",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this ring, you can use an action to speak its command word. When you do so, you can see into and through solid matter for 1 minute. This vision has a radius of 30 feet. To you, solid objects within that radius appear transparent and don't prevent light from passing through them. The vision can penetrate 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Thicker substances block the vision, as does a thin sheet of lead. Whenever you use the ring again before taking a long rest, you must succeed on a DC 15 Constitution saving throw or gain one level of exhaustion."
 },
 {
   "Item": "Robe of Eyes",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This robe is adorned with eyelike patterns. While you wear the robe, you gain the following benefits:                                            The robe lets you see in all directions, and you have advantage on Wisdom (Perception) checks that rely on sight.                       You have darkvision out to a range of 120 feet.                       You can see invisible creatures and objects, as well as see into the Ethereal Plane, out to a range of 120 feet.                                          The eyes on the robe can't be closed or averted. Although you can close or avert your own eyes, you are never considered to be doing so while wearing this robe \nA light spell cast on the robe or a daylight spell cast within 5 feet of the robe causes you to be blinded for 1 minute. At the end of each of your turns, you can make a Constitution saving throw (DC 11 for light or DC 15 for daylight), ending the blindness on a success."
 },
 {
   "Item": "Robe of Scintillating Colors",
   "Type": "Wondrous Item",
   "Cost (gp)": "11000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This robe has 3 charges, and it regains 1d3 expended charges daily at dawn. While you wear it, you can use an action and expend 1 charge to cause the garment to display a shifting pattern of dazzling hues until the end of your next turn. During this time, the robe sheds bright light in a 30-foot radius and dim light for an additional 30 feet. Creatures that can see you have disadvantage on attack rolls against you. In addition, any creature in the bright light that can see you when the robe's power is activated must succeed on a DC 15 Wisdom saving throw or become stunned until the effect ends."
 },
 {
   "Item": "Robe of Stars",
   "Type": "Wondrous Item",
   "Cost (gp)": "14000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This black or dark blue robe is embroidered with small white or silver stars. You gain a +1 bonus to saving throws while you wear it.\nSix stars, located on the robe's upper front portion, are particularly large. While wearing this robe, you can use an action to pull off one of the stars and use it to cast magic missile as a 5th-level spell. Daily at dusk, 1d6 removed stars reappear on the robe. While you wear the robe, you can use an action to enter the Astral Plane along with everything you are wearing and carrying. You remain there until you use an action to return to the plane you were on. You reappear in the last space you occupied, or if that space is occupied, the nearest unoccupied space."
 },
 {
   "Item": "Rod of Absorption",
   "Type": "Rod",
   "Cost (gp)": "13000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "While holding this rod, you can use your reaction to absorb a spell that is targeting only you and not with an area of effect. The absorbed spell's effect is canceled, and the spell's energy- not the spell itself- is stored in the rod. The energy has the same level as the spell when it was cast. The rod can absorb and store up to 50 levels of energy over the course of its existence. Once the rod absorbs 50 levels of energy, it can't absorb more. If you are targeted by a spell that the rod can't store, the rod has no effect on that spell.\nWhen you become attuned to the rod, you know how many levels of energy the rod has absorbed over the course of its existence, and how many levels of spell energy it currently has stored.\nIf you are a spellcaster holding the rod, you can convert energy stored in it into spell slots to cast spells you have prepared or know. You can create spell slots only of a level equal to or lower than your own spell slots, up to a maximum of 5th level. You use the stored levels in place of your slots, but otherwise cast the spell as normal. For example, you can use 3 levels stored in the rod as a 3rd-level spell slot.\n A rod that can no longer absorb spell energy and has no energy remaining becomes nonmagical."
 },
 {
   "Item": "Rod of Alertness",
   "Type": "Rod",
   "Cost (gp)": "20000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This rod has a flanged head and the following properties.\nAlertness. While holding the rod, you have advantage on Wisdom (Perception) checks and on rolls for initiative.\nSpells. While holding the rod, you can use an action to cast one of the following spells from it: detect evil and good, detect magic, detect poison and disease, or see invisibility.\nProtective Aura. As an action, you can plant the haft end of the rod in the ground, whereupon the rod's head sheds bright light in a 60-foot radius and dim light for an additional 60 feet. While in that bright light, you and any creature that is friendly to you gain a +1 bonus to AC and saving throws and can sense the location of any invisible hostile creature that is also in the bright light.\nThe rod's head stops glowing and the effect ends after 10 minutes, or when a creature uses an action to pull the rod from the ground. This property can't be used again until the next dawn."
 },
 {
   "Item": "Rod of the Pact Keeper +1",
   "Type": "Rod",
   "Cost (gp)": "6000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (Warlock)",
   "Effect": "While holding this rod, you gain a +1 bonus to spell attack rolls and to the saving throw DCs of your warlock spells.\nIn addition, you can regain one warlock spell slot as an action while holding the rod. You can't use this Property again until you finish a long rest."
 },
 {
   "Item": "Rod of Rulership",
   "Type": "Rod",
   "Cost (gp)": "8000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "You can use an action to present the rod and command Obedience from each creature of your choice that you can see within 120 feet of you. Each target must succeed on a DC 15 Wisdom saving throw or be charmed by you for 8 hours. While charmed in this way, the creature regards you as its trusted leader. If harmed by you or your companions, or commanded to do something contrary to its nature, a target ceases to be charmed in this way. The rod can't be used again until the next dawn."
 },
 {
   "Item": "Rod of Security",
   "Type": "Rod",
   "Cost (gp)": "16000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "While holding this rod, you can use an action to activate it. The rod then instantly transports you and up to 199 other willing creatures you can see to a paradise that exists in an extraplanar space. You choose the form that the paradise takes. It could be a tranquil garden, lovely glade, cheery tavern, immense palace, tropical island, fantastic carnival, or whatever else you can imagine.\nRegardless of its nature, the paradise contains enough water and food to sustain its visitors. Everything else that can be interacted with inside the extraplanar space can exist only there. For example, a flower picked from a garden in the paradise disappears if it is taken outside the extraplanar space.\nFor each hour spent in the paradise, a visitor regains hit points as if it had spent 1 Hit Die. Also, creatures don't age while in the paradise, although time passes normally. Visitors can remain in the paradise for up to 200 days divided by the number of creatures present (round down).\nWhen the time runs out or you use an action to end it, all visitors reappear in the location they occupied when you activated the rod, or an unoccupied space nearest that location. The rod can't be used again until ten days have passed."
 },
 {
   "Item": "Rope of Climbing",
   "Type": "Wondrous Item",
   "Cost (gp)": "1500",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This 60-foot length of silk rope weighs 3 pounds and can hold up to 3,000 pounds. If you hold one end of the rope and use an action to speak the command word, the rope animates. As a bonus action, you can command the other end to move toward a destination you choose. That end moves 10 feet on your turn when you first command it and 10 feet on each of your turns until reaching its destination, up to its maximum length away, or until you tell it to stop. You can also tell the rope to fasten itself securely to an object or to unfasten itself, to knot or unknot itself, or to coil itself for carrying. \nIf you tell the rope to knot, large knots appear at 1-foot intervals along the rope. While knotted, the rope shortens to a 50-foot length and grants advantage on checks made to climb it.\nThe rope has AC 20 and 20 hit points. It regains 1 hit point every 5 minutes as long as it has at least 1 hit point. If the rope drops to 0 hit points, it is destroyed."
 },
 {
   "Item": "Rope of Entanglement",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "This rope is 30 feet long and weighs 3 pounds. If you hold one end of the rope and use an action to speak its command word, the other end darts forward to entangle a creature you can see within 20 feet of you. The target must succeed on a DC 15 Dexterity saving throw or become restrained.\nYou can release the creature by using a bonus action to speak a second command word. A target restrained by the rope can use an action to make a DC 15 Strength or Dexterity check (target's choice). On a success, the creature is no longer restrained by the rope. \nThe rope has AC 20 and 20 hit points. It regains 1 hit point every 5 minutes as long as it has at least 1 hit point. If the rope drops to 0 hit points, it is destroyed."
 },
 {
   "Item": "Saddle of the Cavalier",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While in this saddle on a mount, you can't be dismounted against your will if you're conscious, and attack rolls against the mount have disadvantage."
 },
 {
   "Item": "Scroll of Protection",
   "Type": "Single Use",
   "Cost (gp)": "800",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "Each scroll of protection works against a specific type of creature. \nUsing an action to read the scroll encloses you in a invisible barrier that extends from you to form a 5-footradius, 10-foot-high cylinder. For 5 minutes, this barrier prevents creatures of the specified type from entering or affecting anything within the cylinder.\nThe cylinder moves with you and remains centered on you. However, if you move in such a way that a creature of the specified type would be inside the cylinder, the effect ends.\nA creature can attempt to overcome the barrier by using an action to make a DC 15 Charisma check. On a success, the creature ceases to be affected by the barrier."
 },
 {
   "Item": "Cantrip Scroll",
   "Type": "Single Use",
   "Cost (gp)": "25",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +5 and the Save DC is 13."
 },
 {
   "Item": "1st Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "50",
   "Rarity": "Common",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +5 and the Save DC is 13."
 },
 {
   "Item": "2nd Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "100",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +5 and the Save DC is 13."
 },
 {
   "Item": "3rd Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "200",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +7 and the Save DC is 15."
 },
 {
   "Item": "4th Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "400",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +7 and the Save DC is 15."
 },
 {
   "Item": "5th Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "800",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +9 and the Save DC is 17."
 },
 {
   "Item": "6th Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "1600",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +9 and the Save DC is 17."
 },
 {
   "Item": "7th Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "3200",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +10 and the Save DC is 18."
 },
 {
   "Item": "8th Level Scroll",
   "Type": "Single Use",
   "Cost (gp)": "6400",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class's spell list you can use an action to read the scroll and cast its spell without having to provide any of the spell's components. Otherwise, the scroll is unintelligible.\nIf the spell is on your class's spell list but of a higher level than you can normally cast, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 + spell's level. On a failed check, the spell disappears from the scroll with no other effect.\nOnce the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust. The attack bonus for the spell on the scroll is +10 and the Save DC is 18."
 },
 {
   "Item": "Sending Stones",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "Sending stones come in pairs, with each smooth stone carved to match the other so the pairing is easily recognized. While you touch one stone, you can use an action to cast the sending spell from it. The target is the bearer of the other stone. If no creature bears the other stone, you know that fact as soon as you use the stone and don't cast the spell.\nOnce sending is cast through the stones, they can't be used again until the next dawn. If one of the stones in a pair is destroyed, the other one becomes nonmagical."
 },
 {
   "Item": "Sentinel Shield",
   "AC": 2,
   "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While holding this shield, you have advantage on initiative rolls and Wisdom (Perception) checks. The shield is emblazoned with a symbol of an eye."
 },
 {
   "Item": "Slippers of Spider Climbing",
   "Type": "Wondrous Item",
   "Cost (gp)": "1500",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you wear these light shoes, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free. You have a climbing speed equal to your walking speed. However the slippers don't allow you to move this way on a slippery surface, such as one covered by ice or oil."
 },
 {
   "Item": "Shield +1",
   "AC": 3,
   "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While holding this shield, you have a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC."
 },
 {
   "Item": "Shield +2",
   "AC": 4,
   "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "While holding this shield, you have a +2 bonus to AC. This bonus is in addition to the shield's normal bonus to AC."
 },
 {
   "Item": "Shield +3",
   "AC": 5,
   "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "18000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "While holding this shield, you have a +3 bonus to AC. This bonus is in addition to the shield's normal bonus to AC."
 },
 {
   "Item": "Spellguard Shield",
   "AC": 2,
   "Weight": 6,
   "Type": "Armor (shield)",
   "Cost (gp)": "14000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "While holding this shield, you have advantage on saving throws against spells and other magical effects, and spell attacks have disadvantage against you."
 },
 {
  "Item": "Amulet of the Shield Guardian",
  "Type": "Wondrous Item",
  "Cost (gp)": "22000",
  "Rarity": "Very Rare",
  "Attunement": "Yes",
  "Effect": "Once attuned, the wielder of this amulet gains the services of a Shield Guardian, a faithful companion that follows the wielders commands and strives to protect it. Possession of this amulet also imbues the wearer with the knowledge to create a new Shield Guardian attuned to this amulet should the first be destroyed, requiring 10000 gp worth of materials in the form of fine metals, gemstones, and arcanum crystal."
 },
 {
   "Item": "Staff of Charming",
   "Type": "Staff",
   "Cost (gp)": "7000",
   "Rarity": "Rare",
   "Attunement": "Yes (bard, cleric, druid, sorcerer, warlock, wizard)",
   "Effect": "While holding this staff, you can use an action to expend 1 of its 10 charges to cast charm person, command, or comprehend languages from it using your spell save DC. The staff can also be used as a magic quarterstaff.\nIf you are holding the staff and fail a saving throw against an enchantment spell that targets only you, you can turn your failed save into a successful one. You can't use this property of the staff again until the next dawn. If you succeed on a save against an enchantment spell that targets only you, with or without the staff's intervention, you can use your reaction to expend 1 charge from the staff and turn the spell back on its caster as if you had cast the spell.\nThe staff regains 1d8 + 2 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff becomes a nonmagical quarterstaff."
 },
 {
   "Item": "Staff of Fire",
   "Type": "Staff",
   "Cost (gp)": "13000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (druid, sorcerer, warlock, wizard)",
   "Effect": "You have resistance to fire damage while you hold this staff.\nThe staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: burning hands (1 charge), fireball (3 charges), or wall of fire (4 charges).\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last cha rge, roll a d20. On a 1, the staff blackens, crumbles into cinders, and is destroyed."
 },
 {
   "Item": "Staff of Frost",
   "Type": "Staff",
   "Cost (gp)": "13000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (druid, sorcerer, warlock, wizard)",
   "Effect": "You have resistance to cold damage while you hold this staff.\nThe staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: cone of cold (5 charges), fog cloud (1 charge), ice storm (4 charges), or wall of ice (4 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff turns to water and is destroyed."
 },
 {
   "Item": "Staff of Healing",
   "Type": "Staff",
   "Cost (gp)": "8000",
   "Rarity": "Rare",
   "Attunement": "Yes (bard, cleric, druid)",
   "Effect": "This staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability modifier: cure wounds (1 charge per spell level, up to 4th), lesser restoration (2 charges). or mass cure wounds (5 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1. the staff vanishes in a flash of light, lost forever."
 },
 {
   "Item": "Staff of Striking",
   "Type": "Staff",
   "Cost (gp)": "21000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This staff can be wielded as a magic quarterstaff that grants a + 3 bonus to attack and damage rolls made with it.\nThe staff has 10 charges. When you hit with a melee attack using it, you can expend up to 3 of its charges. For each charge you expend, the target takes an extra ld6 force damage. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff becomes a nonmagical quarterstaff."
 },
 {
   "Item": "Staff of Swarming Insects",
   "Type": "Staff",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes (bard, cleric, druid, sorcerer, warlock, wizard)",
   "Effect": "This staff has 10 charges and regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, a swarm of insects consumes and destroys the staff, then disperses.\nSpells. While holding the staff, you can use an action to expend some of its charges to cast one of the following spells from it, using your spell save DC: giant insect (4 charges) or insect plague (5 charges). Insect Cloud. While holding the staff, you can use an action and expend 1 charge to cause a swarm of harmless flying insects to spread out in a 30-foot radius from you. The insects remain for 10 minutes, making the area heavily obscured for creatures other than you. The swarm moves with you, remaining centered on you. A wind of at least 10 miles per hour disperses the swarm and ends the effect."
 },
 {
   "Item": "Staff of the Adder",
   "Type": "Staff",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (cleric, druid, warlock)",
   "Effect": "You can use a bonus action to speak this staff's command word and make the head of the staff become that of an animate poisonous snake for 1 minute. By using another bonus action to speak the command word again, you return the staff to its normal inanimate form.\nYou can make a melee attack using the snake head, which has a reach of 5 feet. Your proficiency bonus applies to the attack roll. On a hit, the target takes 1d6 piercing damage and must succeed on a DC 15 Constitution saving throw or take 3d6 poison damage. The snake head can be attacked while it is animate. It has an Armor Class of 15 and 20 hit points. If the head drops to 0 hit points, the staff is destroyed. As long as it's not destroyed, the staff regains all lost hit points when it reverts to its inanimate form."
 },
 {
   "Item": "Staff of the Python",
   "Type": "Staff",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (cleric, druid, warlock)",
   "Effect": "You can use an action to speak this staff's command word and throw the staff on the ground within 10 feet of you. The staff becomes a giant constrictor snake (see the Monster Manual for statistics) under your control and acts on its own initiative count. By using a bonus action to speak the command word again, you return the staff to its normal form in a space formerly occupied by the snake. \nOn your turn, you can mentally command the snake if it is within 60 feet of you and you aren't incapacitated. You decide what action the snake takes and where it moves during its next turn, or you can issue it a general command, such as to attack your enemies or guard a location.\n If the snake is reduced to 0 hit points, it dies and reverts to its staff form. The staff then shatters and is destroyed. If the snake reverts to staff form before losing all its hit points, it regains all of them."
 },
 {
   "Item": "Staff of the Woodlands",
   "Type": "Staff",
   "Cost (gp)": "18000",
   "Rarity": "Rare",
   "Attunement": "Yes (druid)",
   "Effect": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While holding it, you have a +2 bonus to spell attack rolls.\nThe staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff loses its properties and becomes a nonmagical quarterstaff.\nSpells. You can use an action to expend 1 or more of the staff's charges to cast one of the following spells from it, using your spell save DC: animal friendship (1 charge), awaken (5 charges), barkskin (2 charges), locate animals or plants (2 charges), speak with animals (1 charge), speak with plants (3 charges), or wall of thorns (6 charges).\nYou can also use an action to cast the pass without trace spell from the staff without using any charges.\nTree Form. You can use an action to plant one end of the staff in fertile earth and expend 1 charge to transform the staff into a healthy tree. The tree is 60 feet tall and has a 5-foot-diameter trunk, and its branches at the top spread out in a 20-foot radius. The tree appears ordinary but radiates a faint aura of transmutation magic if targeted by detect magic. While touching the tree and using another action to speak its command, word, you return the staff to its normal form. Any creature in the tree falls when it reverts to a staff."
 },
 {
   "Item": "Staff of Thunder and Lightning",
   "Type": "Staff",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "Yes",
   "Effect": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. It also has the following additional properties. When one of these properties is used, it can't be used again until the next dawn.\nLightning. When you hit with a melee attack using the staff, you can cause the target to take an extra 2d6 lightning damage.\nThunder. When you hit with a melee attack using the staff, you can cause the staff to emit a crack of thunder, audible out to 300 feet. The target you hit must succeed on a DC 17 Constitution saving throw or become stunned until the end of your next turn.\nLightning Strike. You can use an action to cause a bolt of lightning to leap from the staff's tip in a line that is 5 feet wide and 120 feet long. Each creature in that line must make a DC 17 Dexterity saving throw, taking 9d6 lightning damage on a failed save, or half as much damage on a successful one.\nThunderclap. You can use an action to cause the staff to issue a deafening thunderclap, audible out to 600 feet. Each creature within 60 feet of you (not including you) must make a DC 17 Constitution saving throw. On a failed save, a creature takes 2d6 thunder damage and becomes deafened for 1 minute. On a successful save, a creature takes half damage and isn't deafened.\nThunder and Lightning. You can use an action to use the Lightning Strike and Thunderclap properties at the same time. Doing so doesn't expend the daily use of those properties, only the use of this one."
 },
 {
   "Item": "Staff of Withering",
   "Type": "Staff",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes (cleric, druid, warlock)",
   "Effect": "This staff has 3 charges and regains 1d3 expended charges daily at dawn.\nThe staff can be wielded as a magic quarterstaff. On a hit, it deals damage as a normal quarterstaff, and you can expend 1 charge to deal an extra 2d10 necrotic damage to the target. In addition, the target must succeed on a DC 15 Constitution saving throw or have disadvantage for 1 hour on any ability check or saving throw that uses Strength or Constitution."
 },
 {
   "Item": "Stone of Controlling Earth Elementals",
   "Type": "Wondrous Item",
   "Cost (gp)": "5000",
   "Rarity": "Rare",
   "Attunement": "No",
   "Effect": "If the stone is touching the ground, you can use an action to speak its command word and summon an earth elemental, as if you had cast the conjure elemental spell. The stone can't be used this way again until the next dawn. The stone weighs 5 pounds."
 },
 {
   "Item": "Stone of Good Luck",
   "Type": "Wondrous Item",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While this polished agate is on your person, you gain a + 1 bonus to ability checks and saving throws."
 },
 {
   "Item": "Sun Blade",
   "Type": "Weapon (longsword)",
   "Damage": "1d8/1d10 slashing",
   "Weight": "3 lb",
   "Properties": "versatile",
   "Cost (gp)": "13000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "This item appears to be a longsword hilt. While grasping the hilt, you can use a bonus action to cause a blade of pure radiance to spring into existence, or make the blade disappear. While the blade exists, this magic longsword has the finesse property. If you are proficient with shortswords or longswords, you are proficient with the sun blade.\nYou gain a +2 bonus to attack and damage rolls made with this weapon, which deals radiant damage instead of slashing damage. When you hit an undead with it, that target takes an extra 1d8 radiant damage. The sword's luminous blade emits bright light in a 15-foot radius and dim light for an additional 15 feet. The light is sunlight. While the blade persists, you can use an action to expand or reduce its radius of bright and dim light by 5 feet each, to a maximum of 30 feet each or a minimum of 10 feet each."
 },
 {
   "Item": "Tentacle Rod",
   "Type": "Rod",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "Made by the drow, this rod is a magic weapon that ends in three rubbery tentacles. While holding the rod, you can use an action to direct each tentacle to attack a creature you can see within 15 feet of you. Each tentacle makes a melee attack roll with a +9 bonus. On a hit, the tentacle deals 1d6 bludgeoning damage. If you hit a target with all three tentacles, it must make a DC 15 Constitution saving throw. On a failure, the creature's speed is halved, it has disadvantage on Dexterity saving throws, and it can't use reactions for 1 minute. Moreover, on each of its turns, it can take either an action or a bonus action, but not both. At the end of each of its turns, it can repeat the saving throw, ending the effect on itself on a success."
 },
 {
   "Item": "Tome of Clear Thought",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book contains memory and logic exercises, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying the book's contents and practicing its guidelines, your Intelligence score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Tome of Leadership and Influence",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book contains guidelines for influencing and charming others, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying the book's contents and practicing its guidelines, your Charisma score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Tome of Understanding",
   "Type": "Wondrous Item",
   "Cost (gp)": "30000",
   "Rarity": "Very Rare",
   "Attunement": "No",
   "Effect": "This book contains intuition and insight exercises, and its words are charged with magic. If you spend 48 hours over a period of 6 days or fewer studying the book's contents and practicing its guidelines, your Wisdom score increases by 2, as does your maximum for that score. The manual then loses its magic, but regains it in a century."
 },
 {
   "Item": "Trident of Fish Command",
   "Damage": "1d6/1d8 piercing",
   "Weight": "4 lb",
   "Properties": "Thrown (range 20/60), versatile",
   "Type": "Weapon (trident)",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "This trident is a magic weapon. It has 3 charges. While you carry it, you can use an action and expend 1 charge to cast dominate beast (save DC 15) from it on a beast that has an innate swimming speed. The trident regains 1d3 expended charges daily at dawn."
 },
 {
   "Item": "Wand of 1st Level Spell",
   "Type": "Wand",
   "Cost (gp)": "3000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This wand has 7 charges and regains 1d6+1 charges daily at dawn.  If you expend the wands last charge roll a d20.  On a 1, the wand crumbles into ashes and is destroyed.  Each wand of this type has one 1st level spell associated with it.  The wielder can expend 1 charge of the wand to cast the spell as a 1st level spell.  If the spell can be cast at higher levels, the wielder can expend additional charges to cast it at a higher level.  For each charge expended the level of the spell increases by 1. The save DC and attack roll for spells cast from this wand depend on the spell list the spell is from and the wielders ability scores.  If it was chosen from the druid, cleric, or ranger spell lists, use wisdom.  If it was chosen from the sorcerer, bard, warlock, or paladin spell lists use charisma. If it was chosen from the wizard spell list use intelligence."
 },
 {
   "Item": "Wand of 2nd Level Spell",
   "Type": "Wand",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "This wand has 7 charges and regains 1d6+1 charges daily at dawn.  If you expend the wands last charge roll a d20.  On a 1, the wand crumbles into ashes and is destroyed.  Each wand of this type has one 2nd level spell associated with it.  The wielder can expend 1 charge of the wand to cast the spell as a 2nd level spell.  If the spell can be cast at higher levels, the wielder can expend additional charges to cast it at a higher level.  For each charge expended the level of the spell increases by 1. The save DC and attack roll for spells cast from this wand depend on the spell list the spell is from and the wielders ability scores.  If it was chosen from the druid, cleric, or ranger spell lists, use wisdom.  If it was chosen from the sorcerer, bard, warlock, or paladin spell lists use charisma. If it was chosen from the wizard spell list use intelligence."
 },
 {
   "Item": "Wand of 3rd Level Spell",
   "Type": "Wand",
   "Cost (gp)": "12000",
   "Rarity": "Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "This wand has 7 charges and regains 1d6+1 charges daily at dawn.  If you expend the wands last charge roll a d20.  On a 1, the wand crumbles into ashes and is destroyed.  Each wand of this type has one 3rd level spell associated with it.  The wielder can expend 1 charge of the wand to cast the spell as a 3rd level spell.  If the spell can be cast at higher levels, the wielder can expend additional charges to cast it at a higher level.  For each charge expended the level of the spell increases by 1. The save DC and attack roll for spells cast from this wand depend on the spell list the spell is from and the wielders ability scores.  If it was chosen from the druid, cleric, or ranger spell lists, use wisdom.  If it was chosen from the sorcerer, bard, warlock, or paladin spell lists use charisma. If it was chosen from the wizard spell list use intelligence."
 },
 {
   "Item": "Wand of 4th Level Spell",
   "Type": "Wand",
   "Cost (gp)": "24000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "This wand has 7 charges and regains 1d6+1 charges daily at dawn.  If you expend the wands last charge roll a d20.  On a 1, the wand crumbles into ashes and is destroyed.  Each wand of this type has one 4th level spell associated with it.  The wielder can expend 1 charge of the wand to cast the spell as a 4th level spell.  If the spell can be cast at higher levels, the wielder can expend additional charges to cast it at a higher level.  For each charge expended the level of the spell increases by 1. The save DC and attack roll for spells cast from this wand depend on the spell list the spell is from and the wielders ability scores.  If it was chosen from the druid, cleric, or ranger spell lists, use wisdom.  If it was chosen from the sorcerer, bard, warlock, or paladin spell lists use charisma. If it was chosen from the wizard spell list use intelligence."
 },
 {
   "Item": "Wand of Binding",
   "Type": "Wand",
   "Cost (gp)": "12000",
   "Rarity": "Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "This wand has 7 charges for the following properties. It regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed. \nSpells. While holding the wand, you can use an action to expend some of its charges to cast one of the following spells (save DC 17): hold monster (5 charges) or hold person (2 charges).\nAssisted Escape. While holding the wand, you can use your reaction to expend 1 charge and gain advantage on a saving throw you make to avoid being paralyzed or restrained, or you can expend 1 charge and gain advantage on any check you make to escape a grapple."
 },
 {
   "Item": "Wand of Secrets",
   "Type": "Wand",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "The wand has 3 charges. While holding it. you can use an action to expend 1 of its charges, and if a secret door or trap is within 30 feet of you, the wand pulses and points at the one nearest to you. The wand regains ld3 expended charges daily at dawn."
 },
 {
   "Item": "Wand of the War Mage +1",
   "Type": "Wand",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +1 bonus to spell attack rolls. In addition, you ignore half cover when making a spell attack."
 },
 {
   "Item": "Wand of the War Mage +2",
   "Type": "Wand",
   "Cost (gp)": "9000",
   "Rarity": "Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +2 bonus to spell attack rolls. In addition, you ignore half cover when making a spell attack."
 },
 {
   "Item": "Wand of the War Mage +3",
   "Type": "Wand",
   "Cost (gp)": "15000",
   "Rarity": "Very Rare",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +3 bonus to spell attack rolls. In addition, you ignore half cover when making a spell attack."
 },
 {
   "Item": "Wand of Practiced Spells +1",
   "Type": "Wand",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +1 bonus to spell attack rolls of cantrips you cast."
 },
 {
   "Item": "Wand of Practiced Spells +2",
   "Type": "Wand",
   "Cost (gp)": "5000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +2 bonus to spell attack rolls of cantrips you cast."
 },
 {
   "Item": "Wand of Practiced Spells +3",
   "Type": "Wand",
   "Cost (gp)": "9000",
   "Rarity": "Uncommon",
   "Attunement": "Yes (spellcaster)",
   "Effect": "While holding this wand, you gain a +3 bonus to spell attack rolls of cantrips you cast."
 },
 {
   "Item": "Wand of Pure Magic",
   "Type": "Wand",
   "Cost (gp)": "10000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While you are attuned to this wand your maximum number of spell slots of levels 1 through 3 is increased by 1.  You must have a spell slot of a particular level for the wand to grant you an additional spell slot of that level."
 },
 {
   "Item": "Wind Fan",
   "Type": "Wondrous Item",
   "Cost (gp)": "2000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "While holding this fan , you can use an action to cast the gust of wind spell (save DC 13) from it. Once used, the fan shouldn't be used again until the next dawn. Each time it is used again before then, it has a cumulative 20 percent chance of not working and tearing into useless, nonmagical tatters."
 },
 {
   "Item": "Winged Boots",
   "Type": "Wondrous Item",
   "Cost (gp)": "4000",
   "Rarity": "Uncommon",
   "Attunement": "Yes",
   "Effect": "While you wear these boots, you have a flying speed equal to your walking speed. You can use the boots to fly for up to 4 hours, all at once or in several shorter flights, each one using a minimum of 1 minute from the duration. If you are flying when the duration expires, you descend at a rate of 30 feet per round until you land. The boots regain 2 hours of flying capability for every 12 hours they aren't in use."
 },
 {
   "Item": "Wings of Flying",
   "Type": "Wondrous Item",
   "Cost (gp)": "7000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this cloak, you can use an action to speak its command word. Thish turns the cloak into a pair of bat wings or bird wings on your back for 1 hour or until you repeat the command word as an action. The wings give you a flying speed of 60 feet. When they disappear, you can't use them again for 1d12 hours."
 },
 {
   "Item": "Amulet of Intelligence +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this amulet your intelligence score increases by 2.  This magical increase occurs even if it increases your intelligence above your normal maximum."
 },
 {
   "Item": "Amulet of Charisma +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this amulet your charisma score increases by 2.  This magical increase occurs even if it increases your charisma above your normal maximum."
 },
 {
   "Item": "Amulet of Wisdom +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this amulet your wisdom score increases by 2.  This magical increase occurs even if it increases your wisdom above your normal maximum."
 },
 {
   "Item": "Belt of Strength +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt your strength score increases by 2.  This magical increase occurs even if it increases your strength above your normal maximum."
 },
 {
   "Item": "Belt of Dexterity +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt your dexterity score increases by 2.  This magical increase occurs even if it increases your dexterity above your normal maximum."
 },
 {
   "Item": "Belt of Constitution +2",
   "Type": "Wondrous Item",
   "Cost (gp)": "6000",
   "Rarity": "Rare",
   "Attunement": "Yes",
   "Effect": "While wearing this belt your constitution score increases by 2.  This magical increase occurs even if it increases your constitution above your normal maximum."
 },
 {
   "Item": "Apparatus of Kwalish",
   "Type": "Wondrous Item",
   "Cost (gp)": "1000000",
   "Rarity": "Legendary",
   "Attunement": "No",
   "Effect": "See DMG Page 151"
 },
 {
  "Item": "Armor of Invulnerability",
  "AC": 18,
  "Weight": 65,
  "Type": "Armor (plate)",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "You have resistance to nonmagical damage while you wear this armor. Additionally, you can use an action to make yourself immune to nonmagical damage for 10 minutes or until you are no longer wearing the armor. Once this special action is used, it can't be used again until the next dawn."
 },
 {
  "Item": "Belt of Cloud Giant Strength",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this belt, your Strength score changes to 27. If your Strength is already equal to or greater than the belt's score, the item has no effect on you."
 },
 {
  "Item": "Cloak of Invisibility",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this cloak, you can pull its hood over your head to cause yourself to become invisible. While you are invisible, anything you are carrying or wearing is invisible with you. You become visible when you cease wearing the hood. Pulling the hood up or down requires an action.\n\nDeduct the time you are invisible, in increments of 1 minute, from the cloak's maximum duration of 2 hours. After 2 hours of use, the cloak ceases to function. For every uninterrupted period of 12 hours the cloak goes unused, it regains 1 hour of duration."
 },
 {
  "Item": "Crystal Ball of Mind Reading",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "The typical crystal ball, a very rare item, is about 6 inches in diameter. While touching it, you can cast the scrying spell (save DC 17) with it. You can use an action to cast the detect thoughts spell (save DC 17) while you are scrying with the crystal ball, targeting creatures you can see within 30 feet of the spell's sensor. You don't need to concentrate on this detect thoughts to maintain it during its duration, but it ends if scrying ends."
 },
 {
  "Item": "Crystal Ball of Telepathy",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "The typical crystal ball, a very rare item, is about 6 inches in diameter. While touching it, you can cast the scrying spell (save DC 17) with it. While scrying with the crystal ball, you can communicate telepathically with creatures you can see within 30 feet of the spell's sensor. You can also use an action to cast the suggestion spell (save DC 17) through the sensor on one of those creatures. You don't need to concentrate on this suggestion to maintain it during its duration, but it ends if scrying ends. Once used, the suggestion power of the crystal ball can't be used again until the next dawn."
 },
 {
  "Item": "Crystal Ball of True Seeing",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "The typical crystal ball, a very rare item, is about 6 inches in diameter. While touching it, you can cast the scrying spell (save DC 17) with it. While scrying with the crystal ball, you have truesight with a radius of 120 feet centered on the spell's sensor."
 },
 {
  "Item": "Cubic Gate",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "This cube is 3 inches across and radiates palpable magical energy. The six sides of the cube are each keyed to a different plane of existence, one of which is the Material Plane. The other sides are linked to planes determined by the DM.\n\nYou can use an action to press one side of the cube to cast the gate spell with it, opening a portal to the plane keyed to that side. Alternatively, if you use an action to press one side twice, you can cast the plane shift spell (save DC 17) with the cube and transport the targets to the plane keyed to that side.\n\nThe cube has 3 charges. Each use of the cube expends 1 charge. The cube regains ld3 expended charges daily at dawn."
 },
 {
  "Item": "Efreeti Chain",
  "AC": 19,
  "Weight": 55,
  "Type": "Armor (chain mail)",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this armor, you gain a +3 bonus to AC, you are immune to fire damage, and you can understand and speak Primordial. In addition, you can stand on and walk across molten rock as if it were solid ground."
 },
 {
  "Item": "Bronze Griffon",
  "Type": "Wondrous Item",
  "Cost (gp)": "10000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis bronze statuette is of a griffon rampant. It can become a griffon for up to 6 hours. Once it has been used, it can't be used again until 5 days have passed."
 },
 {
  "Item": "Ebony Fly",
  "Type": "Wondrous Item",
  "Cost (gp)": "8000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis ebony statuette is carved in the likeness of a horsefly. It can become a giant fly for up to 12 hours and can be ridden as a mount. Once it has been used, it can't be used again until 2 day have passed."
 },
 {
  "Item": "Ivory Goats",
  "Type": "Wondrous Item",
  "Cost (gp)": "15000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThese ivory statuettes of goats are always created in sets of three. Each goat looks unique and functions differently from the others. Their properties are as follows:\n\n* The goat of traveling can become a Large goat with the same statistics as a riding horse. It has 24 charges, and each hour or portion thereof it spends in beast form costs 1 charge. While it has charges, you can use it as often as you wish. When it runs out of charges, it reverts to a figurine and can't be used again until 7 days have passed, when it regains all its charges.\n* The goat of travail becomes a giant goat for up to 3 hours. Once it has been used, it can't be used again until 30 days have passed.\n* The goat of terror becomes a giant goat for up to 3 hours. The goat can't attack, but you can remove its horns and use them as weapons. One horn becomes a +1 lance, and the other becomes a +2 longsword. Removing a horn requires an action, and the weapons disappear and the horns return when the goat reverts to figurine form. In addition, the goat radiates a 30-foot-radius aura of terror while you are riding it. Any creature hostile to you that starts its turn in the aura must succeed on a DC 15 Wisdom saving throw or be frightened of the goat for 1 minute, or until the goat reverts to figurine form. The frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Once it successfully saves against the effect, a creature is immune to the goat's aura for the next 24 hours. Once the figurine has been used, it can't be used again until 15 days have passed."
 },
 {
  "Item": "Marble Elephant",
  "Type": "Wondrous Item",
  "Cost (gp)": "8000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis marble statuette is about 4 inches high and long. It can become an elephant for up to 24 hours. Once it has been used, it can't be used again until 7 days have passed."
 },
 {
  "Item": "Obsidian Steed",
  "Type": "Wondrous Item",
  "Cost (gp)": "18000",
  "Rarity": "Very Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis polished obsidian horse can become a nightmare for up to 24 hours. The nightmare fights only to defend itself. Once it has been used, it can't be used again until 5 days have passed. If you have a good alignment, the figurine has a 10 percent chance each time you use it to ignore your orders, including a command to revert to figurine form. If you mount the nightmare while it is ignoring your orders, you and the nightmare are instantly transported to a random location on the plane of Hades, where the nightmare reverts to figurine form."
 },
 {
  "Item": "Onyx Dog",
  "Type": "Wondrous Item",
  "Cost (gp)": "8000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis onyx statuette of a dog can become a mastiff for up to 6 hours. The mastiff has an Intelligence of 8 and can speak Common. It also has dark vision out to a range of 60 feet and can see invisible creatures and objects within that range. Once it has been used, it can't be used again until 7 days have passed."
 },
 {
  "Item": "Serpentine Owl",
  "Type": "Wondrous Item",
  "Cost (gp)": "12000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis serpentine statuette of an owl can become a giant owl for up to 8 hours. Once it has been used, it can't be used again until 2 days have passed. The owl can telepathically communicate with you at any range if you and it are on the same plane of existence."
 },
 {
  "Item": "Silver Raven",
  "Type": "Wondrous Item",
  "Cost (gp)": "5000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.\n\nThe creature is friendly to you and your companions. It understands your languages and obeys your spoken commands. If you issue no commands, the creature defends itself but takes no other actions. See the Monster Manual for the creature's statistics, except for the giant fly.\n\nThe creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.\n\nThis silver statuette of a raven can become a raven for up to 12 hours. Once it has been used, it can't be used again until 2 days have passed. While in raven form, the figurine allows you to cast the animal messenger spell on it at will."
 },
 {
  "Item": "Hammer of Thunderbolts",
  "Damage": "2d6 bludgeoning",
  "Weight": "10 lb",
  "Properties": "heavy, two-handed",
  "Type": "Weapon (maul)",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\n\nGiant's Bane (Requires Attunement). You must be wearing a belt of giant strength (any variety) and gauntlets of ogre power to attune to this weapon. The attunement ends if you take off either of those items. While you are attuned to this weapon and holding it, your Strength score increases by 4 and can exceed 20, but not 30. When you roll a 20 on an attack roll made with this weapon against a giant, the giant must succeed on a DC 17 Constitution saving throw or die.\n\nThe hammer also has 5 charges. While attuned to it, you can expend 1 charge and make a ranged weapon attack with the hammer, hurling it as if it had the thrown property with a normal range of 20 feet and a long range of 60 feet. If the attack hits, the hammer unleashes a thunderclap audible out to 300 feet. The target and every creature within 30 feet of it must succeed on a DC 17 Constitution saving throw or be stunned until the end of your next turn. The hammer regains 1d4 + 1 expended charges daily at dawn."
 },
 {
  "Item": "Iron Flask",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "See DMG Page 178"
 },
 {
  "Item": "Plate Armor of Etherealness",
  "AC": 18,
  "Weight": 65,
  "Type": "Armor (plate)",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While you're wearing this armor, you can speak its command word as an action to gain the effect of the etherealness spell, which last for 10 minutes or until you remove the armor or use an action to speak the command word again. This property of the armor can't be used again until the next dawn."
 },
 {
  "Item": "Ring of Djinni Summoning",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you can speak its command word as an action to summon a particular djinni from the Elemental Plane of Air. The djinni appears in an unoccupied space you choose within 120 feet of you. It remains as long as you concentrate (as if concentrating on a spell), to a maximum of 1 hour, or until it drops to 0 hit points. It then returns to its home plane.\n\nWhile summoned, the djinni is friendly to you and your companions. It obeys any commands you give it, no matter what language you use. If you fail to command it, the djinni defends itself against attackers but takes no other actions.\n\nAfter the djinni departs, it can't be summoned again for 24 hours, and the ring becomes nonmagical if the djinni dies."
 },
 {
  "Item": "Ring of Air Elemental Command",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you have advantage on attack rolls against elementals from the plane of air, and they have disadvantage on attack rolls against you. In addition, you have access to properties based on the linked plane.\n\nThe ring has 5 charges. It regains 1d4 + 1 expended charges daily at dawn. Spells cast from the ring have a save DC of 17. You can expend 2 of the ring's charges to cast dominate monster on an air elemental. In addition, when you fall, you descend 60 feet per round and take no damage from falling. You can also speak and understand Auran.\n\nIf you help slay an air elemental while attuned to the ring, you gain access to the following additional properties:\n\n* You have resistance to lightning damage.\n* You have a flying speed equal to your walking speed and can hover.\n* You can cast the following spells from the ring, expending the necessary number of charges: chain lightning (3 charges), gust of wind (2 charges), or wind wall (1 charge)."
 },
 {
  "Item": "Ring of Earth Elemental Command",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you have advantage on attack rolls against elementals from the plane of earth, and they have disadvantage on attack rolls against you. In addition, you have access to properties based on the linked plane.\n\nThe ring has 5 charges. It regains 1d4 + 1 expended charges daily at dawn. Spells cast from the ring have a save DC of 17. You can expend 2 of the ring's charges to cast dominate monster on an earth elemental. In addition, you can move in difficult terrain that is composed of rubble, rocks, or dirt as if it were normal terrain. You can also speak and understand Terran.\n\nIf you help slay an earth elemental while attuned to the ring, you gain access to the following additional properties:\n\n* You have resistance to acid damage.\n* You can move through solid earth or rock as if those areas were difficult terrain. If you end your turn there you are shunted out to the nearest unoccupied space you last occupied.\n* You can cast the following spells from the ring, expending the necessary number of charges: stone shape (2 charges), stoneskin (3 charges), or wall of stone (3 charges)."
 },
 {
  "Item": "Ring of Fire Elemental Command",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you have advantage on attack rolls against elementals from the plane of fire, and they have disadvantage on attack rolls against you. In addition, you have access to properties based on the linked plane.\n\nThe ring has 5 charges. It regains 1d4 + 1 expended charges daily at dawn. Spells cast from the ring have a save DC of 17. You can expend 2 of the ring's charges to cast dominate monster on a fire elemental. In addition, you have resistance to fire damage. You can also speak and understand Ignan.\n\nIf you help slay a fire elemental while attuned to the ring, you gain access to the following additional properties:\n\n* You are immune to fire damage.\n* You can cast the following spells from the ring, expending the necessary number of charges: burning hands (1 charge), fireball (2 charges), and wall of fire (3 charges)."
 },
 {
  "Item": "Ring of Water Elemental Command",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you have advantage on attack rolls against elementals from the plane of water, and they have disadvantage on attack rolls against you. In addition, you have access to properties based on the linked plane.\n\nThe ring has 5 charges. It regains 1d4 + 1 expended charges daily at dawn. Spells cast from the ring have a save DC of 17. You can expend 2 of the ring's charges to cast dominate monster on a water elemental. In addition, you can stand on and walk across liquid surfaces as if they were solid ground. You can also speak and understand Aquan.\n\nIf you help slay a water elemental while attuned to the ring, you gain access to the following additional properties:\n\n* You can breathe underwater and have a swimming speed equal to your walking speed.\n* You can cast the following spells from the ring, expending the necessary number of charges: create or destroy water (1 charge), control water (3 charges), ice storm (2 charges), or wall of ice (3 charges)."
 },
 {
  "Item": "Ring of Invisibility",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you can turn invisible as an action. Anything you are wearing or carrying is invisible with you. You remain invisible until the ring is removed, until you attack or cast a spell, or until you use a bonus action to become visible again."
 },
 {
  "Item": "Ring of Spell Turning",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "While wearing this ring, you have advantage on saving throws against any spell that targets only you (not in an area of effect). In addition, if you roll a 20 for the save and the spell is 7th level or lower, the spell has no effect on you and instead targets the caster, using the slot level, spell save DC, attack bonus, and spellcasting ability of the caster."
 },
 {
  "Item": "Ring of Three Wishes",
  "Type": "Ring",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "While wearing this ring, you can use an action to expend 1 of its 3 charges to cast the wish spell from it. The ring becomes nonmagical when you use the last charge."
 },
 {
  "Item": "Robe of the Archmagi",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes (sorcerer, warlock, or wizard)",
  "Effect": "This elegant garment is made from exquisite cloth of white, gray, or black and adorned with silvery runes. You gain these benefits while wearing the robe:\n\n* If you aren't wearing armor, your base Armor Class is 15 + your Dexterity modifier.\n* You have advantage on saving throws against spells and other magical effects.\n* Your spell save DC and spell attack bonus each increase by 2."
 },
 {
  "Item": "Rod of Lordly Might",
  "Type": "Rod",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "See DMG page 196"
 },
 {
  "Item": "Rod of Resurrection",
  "Type": "Rod",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes (Cleric, Druid, or Paladin)",
  "Effect": "The rod has 5 charges. While you hold it, you can use an action to cast one of the following spells from it: heal (expends 1 charge) or resurrection (expends 5 charges).\n\nThe rod regains 1 expended charge daily at dawn. If the rod is reduced to 0 charges, roll a d20. On a 1, the rod disappears in a burst of radiance."
 },
 {
  "Item": "Scarab of Protection",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "If you hold this beetle-shaped medallion in your hand for 1 round, an inscription appears on its surface revealing its magical nature. It provides two benefits while it is on your person:\n\n* You have advantage on saving throws against spells.\n* The scarab has 12 charges. If you fail a saving throw against a necromancy spell or a harmful effect originating from an undead creature, you can use your reaction to expend 1 charge and turn the failed save into a successful one. The scarab crumbles into powder and is destroyed when its last charge is expended."
 },
 {
  "Item": "Sovereign Glue",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "This viscous, milky-white substance can form a permanent adhesive bond between any two objects. It must be stored in a jar or flask that has been coated inside with oil of slipperiness. When found, a container contains 1d6 + 1 ounces.\n\nOne ounce of the glue can cover a 1-foot square surface. The glue takes 1 minute to set. Once it has done so, the bond it creates can be broken only by the application of universal solvent or oil of etherealness or with a wish spell."
 },
 {
  "Item": "Staff of the Magi",
  "Type": "Staff",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes (Sorcerer, Warlock, or Wizard)",
  "Effect": "This staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While you hold it, you gain a +2 bonus to spell attack rolls.\n\nThe staff has 50 charges for the following properties. It regains 4d6 + 2 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 20, the staff regains 1d12 + 1 charges.\n\nSpell Absorption. While holding the staff, you have advantage on saving throws against spells. In addition, you can use your reaction when another creature casts a spell that targets only you. If you do, the staff absorbs the magic of the spell, canceling its effect and gaining a number of charges equal to the absorbed spell's level. However, if doing so brings the staff's total number of charges above 50, the staff explodes as if you activated its retributive strike (see below).\n\nSpells. While holding the staff, you can use an action to expend some of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: conjure elemental (7 charges), dispel magic (3 charges), fireball (7th-level version, 7 charges), flaming sphere (2 charges), ice storm (4 charges), invisibility (2 charges), knock (2 charges), lightning bolt (7th-level version, 7 charges), passwall (5 charges), plane shift (7 charges), telekinesis (5 charges), wall of fire (4 charges), or web (2 charges).\n\nYou can also use an action to cast one of the following spells from the staff without using any charges: arcane lock, detect magic, enlarge/reduce, light, mage hand, or protection from evil and good.\n\nRetributive Strike. You can use an action to break the staff over your knee or against a solid surface, performing a retributive strike. The staff is destroyed and releases its remaining magic in an explosion that expands to fill a 30-foot-radius sphere centered on it. You have a 50 percent chance to instantly travel to a random plane of existence, avoiding the explosion. If you fail to avoid the effect, you take force damage equal to 16 x the number of charges in the staff. Every other creature in the area must make a DC 17 Dexterity saving throw. On a failed save, a creature takes an amount of damage based on how far away it is from the point of origin, as shown in the following table. On a successful save, a creature takes half as much damage."
 },
 {
  "Item": "Talisman of the Sphere",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "When you make an Intelligence (Arcana) check to control a sphere of annihilation while you are holding this talisman, you double your proficiency bonus on the check. In addition, when you start your turn with control over a sphere of annihilation, you can use an action to levitate it 10 feet plus a number of additional feet equal to 10 x your Intelligence modifier."
 },
 {
  "Item": "Universal Solvent",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "This tube holds milky liquid with a strong alcohol smell. You can use an action to pour the contents of the tube onto a surface within reach. The liquid instantly dissolves up to 1 square foot of adhesive it touches, including sovereign glue."
 },
 {
  "Item": "Vorpal Sword",
  "Type": "Weapon (longsword)",
  "Damage": "1d8/1d10 slashing",
  "Weight": "3 lb",
  "Properties": "versatile",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "You gain a +3 bonus to attack and damage rolls made with this magic weapon. In addition, the weapon ignores resistance to slashing damage.\n\nWhen you attack a creature that has at least one head with this weapon and roll a 20 on the attack roll, you cut off one of the creature's heads. The creature dies if it can't survive without the lost head. A creature is immune to this effect if it is immune to slashing damage, doesn't have or need a head, has legendary actions, or the DM decides that the creature is too big for its head to be cut off with this weapon. Such a creature instead takes an extra 6d8 slashing damage from the hit."
 },
 {
  "Item": "Well of Many Worlds",
  "Type": "Wondrous Item",
  "Cost (gp)": "1000000",
  "Rarity": "Legendary",
  "Attunement": "No",
  "Effect": "This fine black cloth, soft as silk, is folded up to the dimensions of a handkerchief. It unfolds into a circular sheet 6 feet in diameter.\n\nYou can use an action to unfold and place the well of many worlds on a solid surface, whereupon it creates a two-way portal to another world or plane of existence. Each time the item opens a portal, the DM decides where it leads. You can use an action to close an open portal by taking hold of the edges of the cloth and folding it up. Once well of many worlds has opened a portal, it can't do so again for ld8 hours."
 },
 {
  "Item": "Baret of Improved Concentration",
  "Type": "Wondrous Item",
  "Cost (gp)": "25000",
  "Rarity": "Very Rare",
  "Attunement": "Yes",
  "Effect": "While attuned to this baret you can concentrate on up to 2 spells at the same time. If you are concentrating on more than 1 spell at once and you are forced to make a concentration save you must make a separate save for each spell, and have disadvantage on the saving throw."
 },
 {
  "Item": "Staff of Shillelagh",
  "Type": "Weapon (staff)",
  "Damage": "1d8 bludgeoning",
  "Weight": "4 lb",
  "Properties": "-",
  "Cost (gp)": "12000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Effect": "When making a melee attack with this magical staff you can use your spell attack modifier instead of your normal attack modifier. Additionally it grants a +1 bonus to attack and damage rolls made with it."
 },
 {
  "Item": "Sword of Extended Reach",
  "Type": "Weapon (Greatsword)",
  "Cost (gp)": "9000",
  "Rarity": "Rare",
  "Attunement": "No",
  "Damage": "2d6 slashing",
  "Weight": "6 lb",
  "Properties": "heavy, two-handed",
  "Effect": "This sword grants a +1 bonus to attack and damage rolls.\n\nWhile weilding this sword you can speak the command word as a bonus action. When you do so the sword magically grows to an unusual size while it's weight and heft do not change, extending it's reach by 5 ft until the beginning of your next turn."
 },
 {
  "Item": "Blade of Any Size",
  "Type": "Weapon (dagger)",
  "Damage": "1d4/1d6/1d8/1d10/2d6 piercing",
  "Weight": "1 lb",
  "Properties": "Finesse, light, thrown (range 20/60)/Finesse, light/Versatile/two-handed, heavy",
  "Cost (gp)": "5000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "By pressing one of four buttons on the hilt of this dagger as an action you can change it into a shortsword, longsword, greatsword, or back into a dagger."
 },
 {
  "Item": "Harp of Inspiration",
  "Type": "Wondrous Item",
  "Cost (gp)": "3000",
  "Rarity": "Uncommon",
  "Attunement": "Yes (bard)",
  "Effect": "While attuned to this harp your maximum number of uses of bardic inspiration is increased by one."
 },
 {
  "Item": "Armor of Magic Shadows",
  "AC": 13,
  "Weight": 13,
  "Type": "Armor (studded leather)",
  "Cost (gp)": "9000",
  "Rarity": "Rare",
  "Attunement": "Yes (spellcaster)",
  "Effect": "This armor grants a +1 bonus to AC. While attuned to and wearing this armor, you can expend a spell slot as a bonus action to become invisible for a number of rounds equal to the level of the slot expended."
 },
 {
  "Item": "Ring of Attunement",
  "Type": "Ring",
  "Cost (gp)": "15000",
  "Rarity": "Very Rare",
  "Attunement": "Yes",
  "Effect": "This item while attuned does not count towards the maximum number of items a character can have attuned, but rather increases the maximum number by 1. However, it is only possible to have one of these attuned on a single person."
 },
 {
  "Item": "Abjurer's Robe",
  "Type": "Wondrous Item",
  "Cost (gp)": "18000",
  "Rarity": "Very Rare",
  "Attunement": "Yes (Wizard or Sorcerer)",
  "Effect": "While you are attuned to and wearing this robe your AC is equal to 13 + your dexterity modifier. Additionally, this robe has 10 charges, and regains 1d8 charges daily at dawn. You can use a charge of the robe to cast one of the following spells: shield, absorb elements, protection from evil and good."
 },
 {
  "Item": "Apprentice's Robe",
  "Type": "Wondrous Item",
  "Cost (gp)": "5000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "While wearing this robe your AC is equal to 13 + your dexterity modifier."
 },
 {
  "Item": "Evoker's Robe",
  "Type": "Wondrous Item",
  "Cost (gp)": "18000",
  "Attunement": "Yes (Wizard or Sorcerer)",
  "Effect": "While you are attuned to and wearing this robe your AC is equal to 13 + your dexterity modifier. Additionally, this robe has 10 charges, and regains 1d8 charges daily at dawn. You can use charges to cast the following spells: Magic Missile (1 charge), Shatter (2 charges), Lightning Bolt (3 charges)"
 },
 {
  "Item": "Robes of the Persuasive Speaker",
  "Type": "Wondrous Item",
  "Cost (gp)": "5000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "This robe has 3 charges and recovers 1d3 charges daily at dawn. While wearing the robe, you can expend one charge as an action to gain advantage on the next charisma check you make. Alternatively you can expend 2 charges to cast the spell Command."
 },
 {
  "Item": "The Party Inventory",
  "Type": "Wondrous Item",
  "Cost (gp)": "15000",
  "Rarity": "Very Rare",
  "Attunement": "Yes, up to 8 creatures",
  "Effect": "Up to 8 creatures can be attuned to this item at the same time. The Party Inventory looks like a large sack, and always weighs 5 lbs, no matter how much is put in it. The inside of the bag opens to an interdimensional space that is 10 ft by 10 ft, and can hold 1000 lbs. Any creature who is attuned to the bag and is within 60 ft of it can summon any item in the bag to their hand as a bonus action."
 },
 {
  "Item": "Magic Dust",
  "Type": "Single Use",
  "Cost (gp)": "250",
  "Rarity": "Common",
  "Attunement": "No",
  "Effect": "Snorting or smoking this powerful stimulant gives an incredible feeling of power to the user, heightening senses, improving strength, and increasing mental acuity. After using the dust the user gains a +4 bonus to strength, dexterity, intelligence, and Charisma; 2d8 temporary hitpoints; advantage on perception checks; and is immune to exhaustion for 1 hour. This does not remove levels of exhaustion already suffered, but suppresses any effects of that exhaustion. After the effect wears off the user suffers a level of exhaustion, and has disadvantage on all checks for 24 hours, this can be avoided by using more Magic Dust before the effect wears off. Using Magic Dust also brings with it the risk of addiction. After using Magic Dust, roll a d20. On a result of 4 or less the user becomes addicted to Magic Dust, suffering a constant desire to have more Dust, and cannot have less than 1 level of exhaustion unless they have used Magic Dust within the last 24 hours. This addiction can be removed by Greater Restoration."
 },
 {
  "Item": "Opium Tea / Unprocessed Opium",
  "Type": "Single Use",
  "Cost (gp)": "5",
  "Rarity": "Common",
  "Attunement": "No",
  "Effect": "Opium Tea is an incredibly calming drug used to dull pain and calm the nerves. Drinking this tea makes the user immune to fear and grants 1d4 temporary hitpoints, however it also immediately adds 1 level of exhaustion to the user. These effects last for 1 hour. Using Opium Tea also brings with it the risk of addiction. After using Opium Tea, roll a d20. On a result of 4 or less the user becomes addicted to Opium Tea, suffering a constant desire to have more Opium, and have their maximum hit points reduced by 5 unless they have used Opium within the last 24 hours. This addiction can be removed by Greater Restoration."
 },
 {
  "Item": "Case of Emergency",
  "Type": "Single Use",
  "Cost (gp)": "1000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "This tiny black box, about an inch in diameter, contains within it the power to change the future in a small, but predictable way. You can smash the box as a reaction when making any d20 roll, and instead of making the roll, proceed with the result as if you had rolled a 20 on the die."
 },
 {
  "Item": "Potion of Rage",
  "Type": "Single Use",
  "Cost (gp)": "500",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "After drinking this potion the user enters a frenzied state of bloodlust. For the next minute or until they become incapacitated they have advantage on strength checks, +3 damage when attacking with strength, resistance to bludgeoning, piercing, and slashing damage, and can make an additional attack as a bonus action when they take the attack action on their turn."
 },
 {
  "Item": "Bag of Endless Knives",
  "Type": "Wondrous Item",
  "Cost (gp)": "4000",
  "Rarity": "Uncommon",
  "Attunement": "No",
  "Effect": "When you reach into this bag you will always find a dagger. Once drawn out of the bag the dagger exists for 1 round before disappearing. Nothing else can be stored in the bag, but the bag acts as a quiver, requiring no action to draw a dagger out."
 },
 {
  "Item": "Lesser Spellbook of Memory",
  "Type": "Wondrous Item",
  "Cost (gp)": "4000",
  "Rarity": "Uncommon",
  "Attunement": "Yes (Wizard or Factotum)",
  "Effect": "This spellbook is enchanted to enhance the memory of the user. The attuned wizard can copy spells into this spellbook (using the normal rules for copying spells), and can prepare an additional spell each day so long as that spell is scribed in this book."
 },
 {
  "Item": "Shield Wand Case",
  "Type": "Wondrous Item",
  "Cost (gp)": "600",
  "Rarity": "Common",
  "Attunement": "No",
  "Effect": "This specially crafted case consists of a twisted metal rod with a hollow tube on one end. When properly installed on a shield (a permanent modification) the rod sticks out several inches from the center of the shields face, while the hollow tube ends just next to the hand grip on the shield, allowing one to stick a magic wand into the tube and hold it while also gripping the hand grip. This allows the user to use the wand from their shield hand without needing a separate free hand for it. This does not eliminate the need to have a free hand for somatic and material components of spells outside of whatever spell is provided by the wand."
 },
 {
  "Item": "Haft Wand Case",
  "Type": "Wondrous Item",
  "Cost (gp)": "600",
  "Rarity": "Common",
  "Attunement": "No",
  "Effect": "This specially crafted weapon handle consists of a hollow metal rod that attaches to a more typical weapon handle, and must be specifically crafted for the weapon in question. When properly attached to a weapon (a permanent modification) this allows the user to use the wand placed within the weapon without needing a separate free hand for it. This does not eliminate the need to have a free hand for somatic and material components of spells outside of whatever spell is provided by the wand."
 },
 {
  "Item": "Spellbook of Memory",
  "Type": "Wondrous Item",
  "Cost (gp)": "9000",
  "Rarity": "Rare",
  "Attunement": "Yes (Wizard or Factotum)",
  "Effect": "This spellbook is enchanted to enhance the memory of the user. The attuned wizard can copy spells into this spellbook (using the normal rules for copying spells), and can prepare 3 additional spells each day so long as these spells are scribed in this book."
 },
 {
  "Item": "Greater Spellbook of Memory",
  "Type": "Wondrous Item",
  "Cost (gp)": "15000",
  "Rarity": "Very Rare",
  "Attunement": "Yes (Wizard or Factotum)",
  "Effect": "This spellbook is enchanted to enhance the memory of the user. The attuned wizard can copy spells into this spellbook (using the normal rules for copying spells), and can prepare 5 additional spells each day so long as these spells are scribed in this book."
 },
 {
  "Item": "Ockham's Laser",
  "Type": "Wondrous Item",
  "Cost (gp)": "8000",
  "Rarity": "Rare",
  "Attunement": "Yes",
  "Effect": "This bracer fits snuggly on the wrist up to the elbow. It has 10 charges. When activated, a wand pops out of the bracer and fires one of the following spells of your choice, using the number of charges indicated: Ray of Frost - free; magic missile - 1 charge; scorching ray - 3 charges. Lightning Bolt - 5 charges, Sunbeam - 10 charges. It regains 1d6 charges daily at dawn. When necessary, the spell attack bonus for these spells is +7, and the Save DC is 15."
 },
 {
   "Item": "Book of Rituals",
   "Type": "Wondrous Item",
   "Cost": "6000",
   "Rarity": "Uncommon",
   "Attunement": "No",
   "Effect": "This magical spell book contains 9 (3d4 + 2) spell levels worth of random spells that have the ritual tag (determined by the DM when the item is acquired). The book details all of the methods and incantations necessary to cast the rituals it contains. A spellcaster with the ritual caster ability can use the book to cast any of the rituals within as a ritual without preparing them or having them in their spellbook otherwise. However, the book does not contain the information necessary to cast the spells normally, and thus do not contain the information a wizard would need to add the spells to their normal spell book."
 },
 {
  "Item": "The General's Crossbow",
  "Type": "Weapon (Hand Crossbow)",
  "Cost": "1000000",
  "Rarity": "Legendary",
  "Attunement": "Yes",
  "Effect": "This magical crossbow was specifically designed and built by a team of the best gnomish artificers from Stagenheim specifically as a gift for General Lilith of the Black Wolf Irregulars. It is attuned to her particular essence and can only be attuned by her. When attuned to this item, Lilith gains the following benefits:\n\n* +3 to attack and damage rolls made with this crossbow.\n* +2 to her dexterity and intelligence scores (does not stack with other magical bonuses to these scores).\n* When she makes an attack with this crossbow she can choose a damage type: fire, cold, lightning, poison, or acid. The crossbow does an additional 1d8 damage of that type.\n* This crossbow magically creates its own ammunition when fired, ignoring the loading and ammunition properties."
 }
]