{
  "id": "lizardfolk",
  "name": "Lizardfolk",
  "singular": "Lizardfolk",
  "description": "\n\nOnly a fool looks at the lizardfolk and sees nothing more than scaly humanoids. Their physical shape notwithstanding, lizardfolk have more in common with iguanas or dragons than they do with humans, dwarves, or elves. Lizardfolk possess an alien and inscrutable mindset, their desires and thoughts driven by a different set of basic principles than those of warm-blooded creatures. Their dismal swamp homes might lie hundreds of miles from the nearest human settlement, but the gap between their way of thinking and that of the smooth-skins is far greater.\n\nDespite their alien outlook, some lizardfolk make an effort to understand and, in their own manner, befriend people of other races. Such lizardfolk make faithful and skilled allies.",
  "traits": [
    { "name": "Size", "description": "Lizardfolk are a little bulkier and taller than humans, and their colorful frills make them appear even larger. Your size is Medium." },
    { "name": "Speed", "description": "Your base walking speed is 9m, and you have a swimming speed of 9m." },
    { "name": "Bite", "description": "Your fanged maw is a natural weapon, which you can use to make unarmed strikes. It has the light and finesse properties, and does 1d6 piercing damage." },
    { "name": "Cunning Artisan", "description": "As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size Small or larger to create one of the following items: a shield, a club, a javelin, or ld4 darts or blowgun needles. To use this trait, you need a blade, such as a dagger, or appropriate artisan's tools, such as leatherworker's tools." },
    { "name": "Hold Breath", "description": "You can hold your breath for up to 15 minutes at a time." },
    { "name": "Hunter's Lore", "description": "You gain proficiency with two of the following skills of your choice: Animal Handling, Nature, Perception, Stealth, and Survival." },
    { "name": "Natural Armor", "description": "You have tough, scaly skin. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor." },
    { "name": "Hungry Jaws", "description": "In battle, you can throw yourself into a vicious feeding frenzy. As a bonus action, you can make a special attack with your bite. If the attack hits, it deals its normal damage, and you gain temporary hit points (minimum of 1) equal to your Constitution modifier, and you can't use this trait again until you finish a short or long rest." },
    { "name": "Languages", "description": "Lizardfolk gain draconic as a bonus language." }
  ],
  "agepoints": {
    "puberty": 7,
    "sexualmaturity": 10,
    "mentalmaturity": 15,
    "middleage": 30,
    "oldage": 45,
    "averagelifespan": 65,
    "maxage": 70
  },
  "subraces": [
    {
      "id": "default",
      "name": "",
      "image": "https://elthelas-images.herokuapp.com/races/lizardfolk.jpg",
      "description": "",
      "traits": [

      ],
      "averageheight": 68,
      "baseheight": 57,
      "heightroll": "2d10",
      "averageweight": 195,
      "baseweight": 120,
      "weightroll": "2d6",
      "speed": [9, 0, 0, 9, 0]
    }
  ]
}