{
  "id": "sorceronblooded",
  "name": "Sorceron Blooded",
  "singular": "Sorceron Blooded",
  "description": "\n\nthe Sorceron were a race of Godly servants that served all Gods. Originally serving the Gods in creating the world Elthelas and the many interconnecting planes of existence in an age long since forgotten. They were masters of magic, the inventors of the arcane arts. In the Gods War they served on both sides, and were the primary combatants, and while most of them died in that conflict, some few survivors retreating to other planes of existence besides the material with the Gods. Yet, before that age many Sorceron interbred with the races of Elthelas, and every now and then a child will be born with more Sorceron blood than typical. These unusual children show a rare talent for magic and are gifted with intelligence and charisma far beyond that of their kin.\n\nThe Sorceron Blooded look very similar to a normal human, but their blood typically betrays them when they are young, with their gift for magic blooming almost as soon as they can talk.",
  "traits": [
    { "name": "Size", "description": "The Sorceron-blooded are generally similar to elves or humans in height, weight, and build. Your size is medium." },
    { "name": "Speed", "description": "Your base walking speed is 9m." },
    { "name": "Natural Spellcaster", "description": "Choose one cantrip from the sorcerer or wizard spell list, and one first level spell from the same list. You can cast this cantrip at will, and the first level spell once per short rest without expending a spell slot. The spellcasting ability for these spells depends on the list you chose it from. Charisma for a sorcerer spell, or intelligence for a wizard spell." }
  ],
  "agepoints": {
    "puberty": 12,
    "sexualmaturity": 15,
    "mentalmaturity": 25,
    "middleage": 80,
    "oldage": 100,
    "averagelifespan": 110,
    "maxage": 140
  },
  "subraces": [
    {
      "id": "humanborn",
      "name": "Human Born",
      "singular": "Human Born",
      "description": "Sorceron Blooded born of humans tend towards more versatility than many others. Often rising to positions of leadership and influence.",
      "traits": [
        { "name": "Versatility", "description": "Gain proficiency in two skills of your choice." }
      ],
      "image": "https://elthelas-images.herokuapp.com/races/sorceronblooded.jpg",
      "averageheight": 69,
      "baseheight": 56,
      "heightroll": "2d12",
      "averageweight": 175,
      "baseweight": 110,
      "weightroll": "2d4",
      "speed": [9, 0, 0, 0, 0]
    },
    {
      "id": "elfborn",
      "name": "Elf Born",
      "singular": "Elf Born",
      "description": "Sorceron Blooded born of elves retain much of the fey grace of their parents, but with a spellcasting ability beyond even most elves.",
      "traits": [
        { "name": "Fey Ancestry", "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep." },
        { "name": "Trance", "description": "Elves don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep." },
        { "name": "Darkvision", "description": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray." }
      ],
      "image": "https://elthelas-images.herokuapp.com/races/elfborn.jpg",
      "averageheight": 65,
      "baseheight": 54,
      "heightroll": "2d10",
      "averageweight": 140,
      "baseweight": 100,
      "weightroll": "1d6",
      "speed": [9, 0, 0, 0, 0]
    },
    {
      "id": "dwarfborn",
      "name": "Dwarf Born",
      "singular": "Dwarf Born",
      "description": "Sorceron Blooded born of dwarves are hardy folk, with a keen intellect, often discernible from other dwarves only by their unnatural gift with magic.",
      "traits": [
        { "name": "Dwarven Resilience", "description": "You have advantage on saving throws against poison, and you have resistance against poison damage." },
        { "name": "Darkvision", "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray." },
        { "name": "Dwarven Combat Training", "description": "You have proficiency with the battleaxe, handaxe, throwing hammer, and warhammer." }
      ],
      "image": "https://elthelas-images.herokuapp.com/races/dwarfborn.jpg",
      "averageheight": 47,
      "baseheight": 42,
      "heightroll": "2d4",
      "averageweight": 135,
      "baseweight": 100,
      "weightroll": "2d6",
      "speed": [9, 0, 0, 0, 0]
    },
    {
      "id": "orcborn",
      "name": "Orc Born",
      "singular": "Orc Born",
      "description": "Sorceron Blooded born of orcs are growing increasingly common since the awakening of the Prince of Fiends, as the Prince enjoys his carnal pleasures, and many an orc woman dreams of the prestige of bearing a child of the prince. As the first generation of orc born sorceron blooded has reached maturity they have been recruited into the highest echelons of orc society, serving as blackguards, warlords, and mages in service of the Prince.",
      "traits": [
        { "name": "Darkvision", "description": "You can see in dim light within 18m of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray." },
        { "name": "Menacing", "description": "You gain proficiency in the intimidation skill." },
        { "name": "Aggressive", "description": "As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started." }
      ],
      "averageheight": 69,
      "baseheight": 58,
      "heightroll": "2d10",
      "averageweight": 215,
      "baseweight": 140,
      "weightroll": "2d6",
      "speed": [9, 0, 0, 0, 0]
    }
  ]
}