{
  "id": "amatherasshield",
  "title": "Amathera's Shield",
  "description": "Amathera's Shield is an organization of knights, paladins, and others dedicated to defending the helpless and uplifting the poor and downtrodden.  \n\nIt has two branches, the militaristic branch seeks out war zones, building and defending refugee camps, and setting up defenses in communities likely to be subject to raids or attack.  The charitable branch goes into communities to distribute food, supplies and education.\n\nBoth branches have a heirarchical ranking system based on knightly orders, with new initiates referred to as pages, followed by squires.  Senior members are called 'shieldmaiden' or 'shieldwarden' depending on their gender.\n\nAmathera's Shield is sponsored by the church of Amathera, and is greatly respected everywhere Amathera is worshipped.  Their headquarters is in the city of Mandon in Zelfir, but they have chapterhouses in many major cities throughotu the world.",
  "nations": [
    "zelfir",
    "deradragorim",
    "alfadir",
    "staelia",
    "eldoran",
    "gerasalim",
    "kandor",
    "dormania",
    "terron",
    "shendarel",
    "seran",
    "curinor",
    "morrindim"
  ],
  "cities": [
    "malidal",
    "desadorel",
    "farengar",
    "kaland",
    "eastguard",
    "strovenguard",
    "granitebluff",
    "storval",
    "torinhammer",
    "tenecha",
    "kimly",
    "swava",
    "alados",
    "kelas",
    "dieel",
    "fradae",
    "damat",
    "mandon",
    "zelfin",
    "lastwatch",
    "portsmith",
    "vashna",
    "delan"
  ],
  "rules": [
    "Defend the weak and provide refuge.",
    "Don't start conflicts, finish them.",
    "Provide charity for the poor."
  ],
  "ranks": [
    {
      "index": 0,
      "name": "Volunteer",
      "minDisposition": 0,
      "description": "You have volunteered to aid the order."
    },
    {
      "index": 1,
      "name": "Squire",
      "minDisposition": 2,
      "description": "You have been accepted by a knight of the order for training, in return for service."
    },
    {
      "index": 2,
      "name": "Knight",
      "minDisposition": 4,
      "description": "You have been recognized for your skill and valor, and have been granted title as a knight."
    },
    {
      "index": 3,
      "name": "Guardian",
      "minDisposition": 8,
      "description": "Your reknown in defense of the downtrodden precedes you wherever you go."
    }
  ],
  "features": [
    {
      "minrank": 1,
      "name": "Defense",
      "description": "You gain proficiency with shields and a +1 Shield with the insignia of Amathera on it."
    },
    {
      "minrank": 2,
      "name": "Protector",
      "description": "When gain the protection fighting style. If you already have this fighting style, pick another fighting style of your choice."
    },
    {
      "minrank": 3,
      "name": "Magic Refuge",
      "description": "You can cast the spell Ottiluke's Resilient Sphere 1/day without using a spell slot.  When cast in this way you can only target a willing target."
    }
  ]
}