{
  "id": "aasimar",
  "name": "Aasimar",
  "singular": "Aasimar",
  "description": "\n\nAasimar are the distant descendents of angels and gods. In many societies the birth of an aasimar is heralded as a grand event. Aasimar are incredibly rare, and don't have a unique culture of their own, but their personality is invariably altered by their divine forebear. The expectation that they will be better than their peers is strong, and can be overwhelming to some, while to others it is a call to true greatness.",
  "traits": [
    { "name": "Darkvision", "description": "darkvision 60 ft" },
    { "name": "Speed", "description": "Your base walking speed is 30 ft." },
    { "name": "Size", "description": "Your size is medium" },
    { "name": "Celestial Resistance", "description": "You have resistance to necrotic damage and radiant damage." },
    { "name": "Healing Hands", "description": "As an action, you can touch a creature and cause it to regain a number of hit points equal to your level.  Once you use this trait, you can't use it again until you finish a long rest." },
    { "name": "Light Bearer", "description": "You know the light cantrip.  Charisma is your spellcasting ability for it." }
  ],
  "agepoints": {
    "puberty": 18,
    "sexualmaturity": 22,
    "mentalmaturity": 35,
    "middleage": 60,
    "oldage": 80,
    "averagelifespan": 110,
    "maxage": 140
  },
  "subraces": [
      {
        "id": "protectedaasimar",
        "name": "Protected Aasimar",
        "singular": "Protected Aasimar",
        "image": "/static/images/races/aasimar.jpg",
        "description": "\n\nProtector aasimar are charged by the powers of good to guard the weak, to strike at evil wherever it arises, and to stand vigilant against the darkness. From a young age, a protector aasimar receives advice and directives that urge to stand against evil.\n\n",
        "traits": [
          { "name": "Ability Score Increase", "description": "Your wisdom score increases by 1 and your charisma score increases by 2." },
          { "name": "Radiant Soul", "description": "Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing your eyes to glimmer and two luminous, incorporeal wings to sprout from your back.\nYour transformation lasts for 1 minute or until you end it as a bonus action.  During it, you have a fly speed of 30 feet, and once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or spell.  The extra radiant damage equals your level.\nOnce you use this trait, you can't use it again until you finish a long rest." }
        ],
        "averageheight": 69,
        "baseheight": 58,
        "heightroll": "2d10",
        "averageweight": 175,
        "baseweight": 120,
        "weightroll": "2d4",
        "stats": [0, 0, 0, 0, 1, 2],
        "speed": [30, 0, 0, 0, 0]
      },
      {
        "id": "scourgeaasimar",
        "name": "Scourge Aasimar",
        "singular": "Scourge Aasimar",
        "description": "\n\nScourge aasimar are imbued with a divine energy that blazes intensely within them. It feeds a powerful desire to destroy evil-a desire that is, at its best, unflinching and, at its worst, all-consuming. Many scourge aasimar wear masks to block out the world and focus on containing this power, unmasking themselves only in battle.\n\n",
        "image": false,
        "traits": [
          { "name": "Ability Score Increase", "description": "Your constitution score increases by 1 and your charisma score increases by 2." },
          { "name": "Radiant Consumption", "description": "Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing a searing light to radiate from you, pour out of your eyes and mouth, and threaten to char you. Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, you and each creature within 10 feet of you take radiant damage equal to half your level (rounded up). In addition, once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra radiant damage equals your level. Once you use this trait, you can't use it again until you finish a long rest." }
        ],
        "averageheight": 69,
        "baseheight": 58,
        "heightroll": "2d10",
        "averageweight": 175,
        "baseweight": 120,
        "weightroll": "2d4",
        "stats": [0, 0, 1, 0, 0, 2],
        "speed": [30, 0, 0, 0, 0]
      },
      {
        "id": "fallenaasimar",
        "name": "Fallen Aasimar",
        "singular": "Fallen Aasimar",
        "description": "\n\nAn aasimar who was touched by dark powers as a youth or who turns to evil in early adulthood can become one of the fallen-a group of aasimar whose inner light has been replaced by shadow.\n\n",
        "image": false,
        "traits": [
          { "name": "Ability Score Increase", "description": "Your strength score increases by 1 and your charisma score increases by 2." },
          { "name": "Necrotic Shroud", "description": "Starting at 3rd level, you can use your action to unleash the divine energy within yourself, causing your eyes to turn into pools of darkness and two skeletal, ghostly, flightless wings to sprout from your back. The instant you transform, other creatures within 10 feet of you that can see you must each succeed on a Charisma saving throw (DC 8 + your proficiency bonus + your Charisma modifier) or become frightened of you until the end of your next turn. Your transformation lasts for 1 minute or until you end it as a bonus action. During it, once on each of your turns, you can deal extra necrotic damage to one target when you deal damage to it with an attack or a spell. The extra necrotic damage equals your level. Once you use this trait, you can't use it again until you finish a long rest." }
        ],
        "averageheight": 69,
        "baseheight": 58,
        "heightroll": "2d10",
        "averageweight": 175,
        "baseweight": 120,
        "weightroll": "2d4",
        "stats": [1, 0, 0, 0, 0, 2],
        "speed": [30, 0, 0, 0, 0]
      }
    ]
}