{
  "id": "faelin",
  "name": "Faelin",
  "singular": "Faelin",
  "description": "\n\nFaelin are frail, with light green skin and rainbow colored hair. These fey live in family groups in tree houses above the jungles of Gnarra. They are a stunningly beautiful and agile people, skilled at climbing any surface, and with latent magical talents, but they are physically weak when caught in single combat.\n\nThe Faelin have no written language and thus no recorded history, their reclusive nature means they are mentioned only in passing in the texts of other peoples. However, theological texts claim them as the patron people of the nature goddess Gaian, who brought them to Elthelas to be stewards of the deep forests.\n\n#### Faelin Culture in Elthelas\n\n The Faelin's culture revolves around matrilineal family groups. Often an extended family of up to 30-40 Faelin will live together, with the eldest matriarch given an outsized influence in decision making. Young men who come of age will visit nearby family groups until they meet their future spouse, then joining her family group where they will live for the rest of their lives. Divorce is unheard of among the Faelin. Beyond their family group, the Faelin almost universally dedicate themselves to serving the will of Gaian. Those who leave Gnarra typically do so on some mission or other from the Awakened Goddess. A Faelin treehouse is typically built in the canopy of the tallest trees of the Gnarra jungle, often 100 ft or more off the ground, and forming a massive complex throughout the branches of the tree. It is not unusual for a Faelin treehouse to encompass several thousand square feet of floorspace in a hodgepodge floorplan that grows as the family group does.",
  "traits": [
    "Ability Score Increase: Your dexterity score and your charisma score each increase by 2.",
    "Size: Faelin are typically between 2 1/2 and 3 1/2 feet tall, and weight around 50 lbs, your size is Small.",
    "Speed: Your base walking speed is 30 feet, you can also climb up rough surfaces such as trees and rough-hewn walls without making Athletics checks at a speed of 20 feet.",
    "Darkvision: Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray.",
    "Natural Acrobat: You have proficiency in the acrobatics skill.",
    "Fey: Your fey heritage gives you advantage on saving throws against being charmed, and magic cannot put you to sleep.",
    "Trance: Faelin don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
    "Cantrip: choose one cantrip from the druid spell list. Charisma is your ability modifier for casting this spell."
  ],
  "agepoints": {
    "puberty": 24,
    "sexualmaturity": 30,
    "mentalmaturity": 50,
    "middleage": 80,
    "oldage": 110,
    "averagelifespan": 150,
    "maxage": 190
  },
  "subraces": [
    {
    "id": "default",
    "name": "",
    "description": "",
    "image": "/images/races/faelin.png",
    "traits": [],
      "averageheight": 36,
      "baseheight": 31,
      "heightroll": "2d4",
      "averageweight": 40,
      "baseweight": 35,
      "weightroll": "1"
    }
  ]
}