{
  "id": "feyri",
  "name": "Fey'ri",
  "singular": "Fey'ri",
  "description": "\n\nAt the time of the demon invasion, Dera was home to the largest elven community outside of Eldoran. Unfortunately for these elves, their community was among the first attacked by the demons. Throughout most of the world it is believed that all of the elves were slaughtered, however a small percentage were kept as slaves, serving the whims of their demon masters, and subject to their lusts. Many of them died birthing the demonic offspring of these unions, and those who did not were rendered infertile. When Bahamut turned his wrath on the demons, forcing them to flee, they left their slaves, and their offspring, behind. These elves, trapped between an angry God and demon slave-masters, hid in the sewers of the ruined city, where they have lived since, expanding them as they had need of space. Over time they have intermarried and the demonic blood has spread and become diluted throughout their people. Today they rarely leave their underground home, but occasionally one will leave to travel the world. They are typically mistaken for a pointy eared , skinny and winged tiefling, and they rarely find a welcoming reception. Most return home.\n\nFey'ri have a naturally evil disposition, and the society as a whole has largely given into the call of their blood. The underworks of Dera where they live is a harsh environment where only the strongest are permitted to survive.\n\n",
  "traits": [
    { "name": "Ability Score Increase", "description": "Your dexterity score increases by 1 and your intelligence score increases by 2." },
    { "name": "Size", "description": "Fey'ri range from under 5 to over 6 feet tall and have slender builds. Your size is medium." },
    { "name": "Speed", "description": "Your base walking speed is 30 feet. You also have wings and starting at 6th level you have a base fly speed of 40 ft." },
    { "name": "Darkvision", "description": "Accustomed to hidden dungeons and sewers, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in the darkness, only shades of gray." },
    { "name": "Fey Ancestry", "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep." },
    { "name": "Trance", "description": "Fey'ri don't need to sleep. Instead they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep." },
    { "name": "Hellish Resistance", "description": "You have resistance to fire damage." }
  ],
  "agepoints": {
    "puberty": 11,
    "sexualmaturity": 14,
    "mentalmaturity": 25,
    "middleage": 35,
    "oldage": 50,
    "averagelifespan": 70,
    "maxage": 90
  },
  "subraces": [
    {
      "id": "default",
      "name": "Fey'ri",
      "singular": "Fey'ri",
      "image": "/static/images/races/feyri.jpg",
      "description": "",
      "traits": [],
      "averageheight": 65,
      "baseheight": 54,
      "heightroll": "2d10",
      "averageweight": 130,
      "baseweight": 100,
      "weightroll": "1d4",
      "stats": [0, 1, 0, 2, 0, 0],
      "speed": [30, 40, 0, 0, 0]
    }
  ]
}