{
  "id": "genasi",
  "name": "Genasi",
  "singular": "Genasi",
  "description": "",
  "traits": [
    "Size. Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium.",
    "Speed. Your base walking speed is 30 feet."
  ],
  "agepoints": {
    "puberty": 14,
    "sexualmaturity": 17,
    "mentalmaturity": 30,
    "middleage": 45,
    "oldage": 60,
    "averagelifespan": 85,
    "maxage": 110
  },
  "subraces": [
    {
      "id": "airgenasi",
      "name": "Air Genasi",
      "singular": "Air Genasi",
      "image": "/images/races/airgenasi.jpg",
      "description": "",
      "traits": [
        "Your Constitution score increases by 2 and your Dexterity score increases by 1.",
        "Unending Breath. You can hold your breath indefinitely while you’re not incapacitated.",
        "Mingle with the Wind. You can cast the levitate spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
      ],
      "averageheight": 67,
      "baseheight": 56,
      "heightroll": "2d10",
      "averageweight": 140,
      "baseweight": 100,
      "weightroll": "1d6"
    },
    {
      "id": "earthgenasi",
      "name": "Earth Genasi",
      "singular": "Earth Genasi",
      "image": "/images/races/earthgenasi.jpg",
      "description": "",
      "traits": [
        "Your Constitution score increases by 2 and your Strength score increases by 1.",
        "Earth Walk. You can move across difficult terrain made of earth or stone without expending extra movement.",
        "Merge with Stone. You can cast the pass without trace spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
      ],
      "averageheight": 67,
      "baseheight": 56,
      "heightroll": "2d10",
      "averageweight": 195,
      "baseweight": 120,
      "weightroll": "2d6"
    },
    {
      "id": "firegenasi",
      "name": "Fire Genasi",
      "singular": "Fire Genasi",
      "image": "/images/races/firegenasi.jpg",
      "description": "",
      "traits": [
        "Your Constitution score increases by 2 and your Intelligence score increases by 1.",
        "Darkvision. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. Your ties to the Elemental Plane of Fire make your darkvision unusual: everything you see in darkness is in a shade of red.",
        "Fire Resistance. You have resistance to fire damage.",
        "Reach to the Blaze. You know the produce flame cantrip. Once you reach 3rd level, you can cast the burning hands spell once with this trait as a 1st-level spell, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
      ],
      "averageheight": 67,
      "baseheight": 58,
      "heightroll": "2d8",
      "averageweight": 165,
      "baseweight": 120,
      "weightroll": "2d4"
    },
    {
      "id": "watergenasi",
      "name": "Water Genasi",
      "singular": "Water Genasi",
      "image": "/images/races/watergenasi.jpg",
      "description": "",
      "traits": [
        "Your Constitution score increases by 2 and your Wisdom score increases by 1.",
        "Acid Resistance. You have resistance to acid damage.",
        "Amphibious. You can breathe air and water.",
        "Swim. You have a swimming speed of 30 feet.",
        "Call to the Wave. You know the shape water cantrip (see chapter 2). When you reach 3rd level, you can cast the create or destroy water spell as a 2nd-level spell once with this trait, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
      ],
      "averageheight": 67,
      "baseheight": 56,
      "heightroll": "2d10",
      "averageweight": 165,
      "baseweight": 110,
      "weightroll": "2d4"
    }
  ]
}