{
  "id": "hobgoblins",
  "name": "Hobgoblins",
  "singular": "Hobgoblin",
  "description": "\n\nThe middle size cousin of the goblinoids, hobgoblins are also the most organized and militaristic. They live largely on the outskirts of Orcish society, and are often used as mercenaries by the Orcs in particularly hot battles. Hobgoblins are more versatile than your typical Orc, and do especially well in massed formations.\n\nLike all goblinoids, hobgoblins tend to be mean, vindictive, and deceitful. Unlike other goblinoids, they also tend to form large powerful bands capable of a real united threat. Hobgoblin mercenary bands can be found all over the world, although they primarily find themselves working for other evil creatures. Their greater versatility as compared to orcs and other goblinoids makes them excellent at filling specialized roles, everything from elite deep penetration teams to scouts to quartermasters.\n\nOutside of militaristic life, hobgoblin society is tribal, and focused on a specific pecking order.",
  "traits": [
    "Your strength score increases by 2, one other ability of your choice increases by 1.",
    "Hobgoblins are similar in height and weight to humans. Your size is medium.",
    "Darkvision 60 ft",
    "Size: Hobgoblins are roughly the height and weight of humans, your size is medium.",
    "Speed: Your speed is 30 ft",
    "Martial Advantage: The hobgoblin can deal an extra 2d6 damage to a creature it hits with a weapon attack if that creature is within 5 feet of an ally of the hobgoblin that isn't incapacitated. Once it uses this feature it cannot do so again until it finishes a short rest.",
    "Martial Training: You are proficient with two martial weapons of your choice and with light armor.",
    "Saving Face: Hobgoblins are careful not to show weakness in front of their allies, for fear of losing status. If you miss with an attack roll or fail an ability check or a saving throw, you can gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +5). Once you use this trait, you can't use it again until you finish a short or long rest."
  ],
  "agepoints": {
    "puberty": 8,
    "sexualmaturity": 10,
    "mentalmaturity": 15,
    "middleage": 25,
    "oldage": 35,
    "averagelifespan": 50,
    "maxage": 65
  },
  "subraces": [
    {
      "id": "default",
      "name": "",
      "image": "/images/races/hobgoblin.jpg",
      "description": "",
      "traits": [
      
      ],
      "averageheight": 67,
      "baseheight": 56,
      "heightroll": "2d10",
      "averageweight": 165,
      "baseweight": 110,
      "weightroll": "2d4"
    }  
  ]
}