{
  "id": "minotaur",
  "name": "Minotaurs",
  "singular": "Minotaur",
  "description": "Half man, half cow, minotaurs are a strong warrior people. Created by the Demon Lord Baphomet in ages long past, those on the material plane who have avoided his demonic influence have shrunk somewhat in size over the generations. On the plains of Asura they build mazelike stone cities. Unlike the more demonic minotaurs that occasionally find their way to the Material, the minotaurs of Asura are strictly herbivorous.",
  "traits": [
    {
      "name": "Size", "description": "Minotaurs average over 6 feet in height, and have stocky builds. Your size is Medium."
    },
    {
      "name": "Speed", "description": "Your walking speed is 30 feet"
    },
    {
      "name": "Ability Score Increase", "description": "Your Strength increases by 2 and your Constitution increases by 1."
    },
    {
      "name": "Horns", "description": "Your horns are natural melee weapons, which you can use to make unarmed strikes. If you hit with them, you deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
    },
    {
      "name": "Goring Rush", "description": "Immediately after you use the Dash action on your turn and move at least 20 feet, you can make one melee attack with your horns as a bonus action."
    },
    {
      "name": "Hammering Horns", "description": "Immediately after you hit a creature with a melee attack as part of the Attack action on your turn, you can use a bonus action to attempt to shove that target with your horns. The target must be no more than one size larger than you and within 5 feet of you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you push it up to 10 feet away from you."
    },
    {
      "name": "Imposing Presence", "description": "You have proficiency in one of the following skills of your choice: Intimidation or Persuasion."
    }
  ],
  "agepoints": {
    "puberty": 12,
    "sexualmaturity": 15,
    "mentalmaturity": 25,
    "middleage": 40,
    "oldage": 55,
    "averagelifespan": 75,
    "maxage": 95
  },
  "subraces": [
    {
      "id": "default",
      "name": "",
      "image": "https://elthelas-images.herokuapp.com/races/minotaur.jpg",
      "description": "",
      "traits": [
      
      ],
      "averageheight": 73,
      "baseheight": 64,
      "heightroll": "2d8",
      "averageweight": 240,
      "baseweight": 175,
      "weightroll": "2d6",
      "stats": [2, 0, 1, 0, 0, 0],
      "speed": [30, 0, 0, 0, 0]
    }  
  ]
}